[
    {
        "names": [
            "Mark Takano",
            "Peter"
        ],
        "places": [
            "California",
            "Riverside"
        ],
        "organizations": [
            "EPA",
            "CDC",
            "IRA",
            "FBI",
            "CIA"
        ],
        "products": [],
        "committee": "Mark Takano For Congress",
        "name": "Mark Takano",
        "email": "info@marktakano.com",
        "subject": "re: my MAGA opponent",
        "date": "2024-01-28T22:47:39Z",
        "year": "2024",
        "month": "1",
        "day": "28",
        "hour": "22",
        "minute": "47",
        "domain": "marktakano.com",
        "body": "Peter -- we just found out some scary details about my MAGA opponent in myupcoming March 5th primary election. My MAGA opponent wants to: - Defund theEPA - Defund the CDC - Defund the IRA - Defund the FBI, CIA, and more! Infact, here’s him with a couple of his greatest heroes just last month!https://secure.actblue.com/donate/mc_takano_q12024_df?amount=7[https://secure.actblue.com/donate/mc_takano_q12024_df?amount=7] Peter, ifthis guy wins, he’ll be just another MAGA rubber stamp – prioritizing chaosand extremism over the good of the people. That’s why we have to fight back.So right now, I’m counting on this grassroots army once again. Peter, we’relaunching a $10,000 End of Month fundraising goal to make sure we win on March5th and keep this district from slipping into GOP hands. Can you chip in $7 tohelp me reach our critical January fundraising goal? »[https://secure.actblue.com/donate/mc_takano_q12024_df?amount=7] If you'vesaved your payment information with ActBlue Express, your donation will gothrough immediately: CONTRIBUTE $7 »[https://secure.actblue.com/donate/mc_takano_q12024_df?amount=7&amounts;=7,15,25&express;_lane=true]CONTRIBUTE $15 »[https://secure.actblue.com/donate/mc_takano_q12024_df?amount=15&amounts;=7,15,25&express;_lane=true]Or a custom donation »[https://secure.actblue.com/donate/mc_takano_q12024_df?amount=10&amounts;=7,15,25]Thank you! Mark Takano P.S. We rely on small-dollar donors to keep ourcampaign funded. It may not seem like much but even $1, $2, $3, or anythingyou can contribute would make a huge difference. Join our team by chipping innow! » [https://secure.actblue.com/donate/mc_takano_q12024_df?amount=1,2,3]----------------------------------------------- Paid for by Mark Takano ForCongress P.O. Box 5214, Riverside, CA 92517 www.marktakano.com Mark Takanorepresents the good people of California's Inland Empire in Congress, fightingfor the region's progressive priorities. He's been a voice for veterans,seniors, students, local businesses and hardworking families. But now,Republicans have captured a slim House Majority. The leadership of progressiveDemocrats like Mark will be critical to holding Republicans accountable andensuring the healing of our country during this challenging time. Click hereto receive fewer emails. https://go.marktakano.com/a/fewer-emails Click hereto update your info. https://go.marktakano.com/a/update-your-info Click hereto unsubscribe:https://go.marktakano.com/p/a5pgxiwEYkeOZat0VVDFmQ2?unsubscribedata=qv%2BjcikV0RNiYjB6OdAUy9HLEMGI%2FBNbfuMF%2ByJRnrrfaDi7RCSWbjLq3CeT3Xiv5mEq3uZ1m4fOFmqrSMKkLWTnTGu4%2Bv0V1jFlVzldTCZGlAviWwl5%2BTWb32kNL%2FjdwQBthlchd2xOouugV63ybS2VE3A5Nttmi4EN1K5XZeYZdieccUXd3muX3uiY2d1zOvGXIqRKZD5XEDXz2kpuSk8KpVEGIkD2bUUr7kLgkVhNUK1fmmiEz6YJpgBR5W4EsdvhaaNp%2B9bEaEvWojndWuJRQPlbFmv4BQWRpUSodzHahgH3Qp%2F93MH6le2Ch3%2BdCCHY3QqEHuu9RQgv2PvWPIx33C%2Bc6ulaXgXVdnMk1RBTkgydiiHQzz6kJ2c5wFBtR5daqnl%2FbZwYbKT6%2FIWQGYK0kHcfAgwdQK2eNdIDJ4ipsRs2VsUNut47wAD62e70.",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Brandon Herrera",
            "Tony"
        ],
        "places": [
            "San Antonio"
        ],
        "organizations": [],
        "products": [
            "Tantal AK-47",
            "rifle"
        ],
        "committee": "Brandon Herrera Victory Committee",
        "name": "Brandon Herrera",
        "email": "brandon@brandonherreraforcongress.com",
        "subject": "I want to give away this AK.",
        "date": "2024-01-31T23:35:58Z",
        "year": "2024",
        "month": "1",
        "day": "31",
        "hour": "23",
        "minute": "35",
        "domain": "brandonherreraforcongress.com",
        "body": "Dear Supporter,The deadline to be entered to win one of my custom rifles is almost here!My campaign needs to raise $300,000 before February 15 so that I can informRepublican voters about Tony's anti-gun, anti-border security record. Soplease help us reach that goal by donating athttps://BrandonHerreraforCongress.com. And in order to show my gratitude, I'll be offering another one of my favoritepersonal firearms as an extra incentive: a beautiful AKG Built Tantal AK-47 in5.45 (see the photo below). Every $5 you donate will earn you one entry towin; $20 gets you 4 entries, $100 gets you 20 entries, etc.Can you help me out by chipping in a contribution athttps://BrandonHerreraforCongress.com?I'm running in the largest border district in the country, and there is a lotof ground to cover. Your support will help me spread the message about mycampaign to Republican primary voters.Please make a donation today at https://BrandonHerreraforCongress.com.**I 'll give one lucky donor my AKG Built Tantal AK-47 in 5.45.** Every $5 youcontribute will earn you an entry. I've already given away one rifle and onetrip to a range day in San Antonio, and I can't wait to notify the nextwinner.Thanks for all your help.Respectfully, Brandon HerreraPS: Every $5 you donate gives you one chance to win my AKG Built Tantal AK-47.Please chip in what you can today at https://BrandonHerreraforCongress.com.![](https://contact.brandonherreraforcongress.com/uploads/1706737567.jpg)            Paid for by the Brandon Herrera Victory Committee ---  Unsubscribe here![](https://contact.brandonherreraforcongress.com/t/hAsYRM5uT6q0oSW0CYSAkw/6fI53a1vdu7637OWRF387YCA)",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [],
        "places": [
            "Washington, DC",
            "Fort Collins, CO"
        ],
        "organizations": [
            "House Republicans",
            "National Republican Congressional Committee",
            "NRCC",
            "Conservative Liberty Wire"
        ],
        "products": [],
        "committee": "National Republican Congressional Committee",
        "name": "Deadline Approaching",
        "email": "news@iesp.conservativelibertywire.com",
        "subject": "ONE HOUR REMAINING",
        "date": "2024-01-31T21:00:28Z",
        "year": "2024",
        "month": "1",
        "day": "31",
        "hour": "21",
        "minute": "0",
        "domain": "iesp.conservativelibertywire.com",
        "body": "You have 60 MINUTES to complete your… ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ JANUARY FUNDRAISING RECORDS PATRIOT Friend DEADLINE 60 MINUTES GOALCOMPLETION FAILED CURRENT MATCH 13X MATCH STATUS [INACTIVE] ACTIVATE NOW?Friend. As of this morning, you have not activated your 13x match to helpHouse Republicans meet their January goal.Would you like to activate yourmatch now? ACTIVATE 13X MATCH By activating your 13x match, you willmultiply the impact your support has on ensuring the House Majority starts2024 off right.This 13x match is an opportunity exclusive to top patriots andwill only be available for the next hour. With your help, we can crush thisCRITICAL deadline and outraise the Dems. This offer expires in 60 minutes soyou must activate your 13X Match RIGHT NOW ! ACTIVATE 13X MATCH Thank you,House Republicans Paid for by the NRCC and not authorized by any candidate orcandidate's committee.NRCC.org NRCC 320 First St SE Washington, DC 20003 Byproviding your cell phone or mobile phone number you are consenting to receivecalls and texts, including autodialed and automated calls and texts, to thatnumber with campaign notifications from the National Republican CongressionalCommittee (21818). NRCC is happy to help at 888-606-1023. Reply HELP for help,STOP to end. MessFreqMayVary. Msg&DataRatesMayApply.; Message frequency mayvary. Terms and Conditionshere . Privacy Policy Conservative Liberty Wire POBox 1188 Fort Collins, CO 80522 unsubscribe |manage data preferences",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Bonnie Watson Coleman"
        ],
        "places": [
            "Washington, DC",
            "United States"
        ],
        "organizations": [],
        "products": [],
        "committee": "Bonnie Watson Coleman for Congress",
        "name": "Bonnie",
        "email": "info@bonnieforcongress.com",
        "subject": "just hours away",
        "date": "2024-01-31T21:57:15Z",
        "year": "2024",
        "month": "1",
        "day": "31",
        "hour": "21",
        "minute": "57",
        "domain": "bonnieforcongress.com",
        "body": "Team- Our first end-of-month fundraising deadline of 2024 is in just a fewhours. Democrats nationwide need to step up and fight back to win in November- starting with tonight’s deadline. My team tells me we still have a littleover $2k left to hit our goal. Will you help us close the gap? Chip in $15 orany amount at this secure link: https://secure.actblue.com/donate/bwc-fr-2401-up?amount=10 [https://secure.actblue.com/donate/bwc-fr-2401-up?amount=10] Thank you for your commitment to taking back the House,Bonnie ​ Click here to unsubscribe from Bonnie's email list.[https://secure.ngpvan.com/p/Ys0vrJnkgEyH5A7MGfcTuQ2?unsubscribedata=Jg3MO71rutkfDCsq4BTMMmorPOjiKM2EeVIXuwaGft7SuOTKjQJ0sG4qHhsuY2WSVPFQOSHXVAn5HgHrVGUbWhs8c2X7olA%2Fav8yDj3%2FhZ5NdY9AykHjHwFXw%2FjZm1TJwSBkLWe4wPwm8Bzox4a9MDoSBJ31vMOCiW4GLojqmzVAbqE0X0VhrkccWskLwflvfZ9n%2BLPazPXqP8qFNHk8CysM5xUY%2FaTOJb9Wp6W8J1WG%2FNTiXsyOYcwyt5uPKH3fDGMmLcFWLKSFykoIJihJOn376W4QHbXuUK9HurQLJBaCs8zo0C4chgxKCLFC1jm97eg7%2BmvQDHZUJGdaC34z4w%2BAthWnDWKj4IaTZEuLcj9U3SSEeK5Rtvs2b7e17VHLNp0Y9gMNT%2FlXBHJPgJhUSn5ruvpLS%2F%2Fj5zwzDNcgxzNhdOvXUWEUyji0mV9xKb4N]​ ​Paid for by Bonnie Watson Coleman for Congress Bonnie Watson Coleman forCongress 918 Pennsylvania Ave, SE Washington, DC 20003 United States ​​",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Madeline Dean",
            "Peter"
        ],
        "places": [
            "Pennsylvania",
            "Berks",
            "Montgomery",
            "Glenside"
        ],
        "organizations": [
            "Team Dean",
            "Mad 4 PA PAC"
        ],
        "products": [],
        "committee": "Mad 4 PA PAC",
        "name": "Mad HQ",
        "email": "info@mad4pa.com",
        "subject": "🏁 Let’s cross the finish line, Peter 🏁",
        "date": "2024-01-31T23:01:14Z",
        "year": "2024",
        "month": "1",
        "day": "31",
        "hour": "23",
        "minute": "1",
        "domain": "mad4pa.com",
        "body": "With just a few hours left to meet our $7,000 fundraising goal, we’re still$1,412 short. Will you help us cross the finish line before tonight?[https://secure.actblue.com/donate/md_janeom?amount=25]DONATE NOW[https://secure.actblue.com/donate/md_janeom?amount=25] Hitting our financialtargets is critical as we work to get Mad on the ballot and win in November.Here’s a breakdown of the numbers for you: $2,500 to add additional capacityto our team – we need staff ready to work with volunteers and travel aroundthe district collecting signatures. $2,500 to access the voter database toensure the right people are getting our petition sign-ups. $2,000 for physicalmaterials to circulate petitions to supporters in the district Peter, now thatyou see just how important this goal is, will you consider making a $30donation today to help us cross the finish line and get ALL the materials weneed to get on the ballot in time?[https://secure.actblue.com/donate/md_janeom?amount=25] Thanks in advance,Team Dean Madeleine is an attorney, professor, mother, grandmother, and Memberof Congress, representing Pennsylvania’s 4th Congressional District of Berksand Montgomery Counties. She is an outspoken leader who champions progressivepriorities such as education, universal access to healthcare, gun safety, andethical government. Madeleine Dean has built a reputation for getting thingsdone, and we need her to continue to be our voice to serve us in Congress. Weare excited to have you on Team Dean! Our campaign is funded by people whocare about our democracy and want to see continued progress in our communityand in our country. If you'd like to donate, click here:https://secure.actblue.com/donate/madslist?amount=25&refcode;=footer&refcode2;=36b31e8a-8cc0-ee11-b660-002248223197If you’d like to volunteer, click here: https://secure.ngpvan.com/qaBeBKvRnUS-xnVmoAyPBg2? Paid for by Mad4PA PAC Mad 4 PA PAC PO Box 444 Glenside, PA 19038United States Email is the best way for us to keep you informed about what’shappening with the campaign, but we know that our inboxes can get flooded.Sign up for our Email Lite program to stay up-to-date with Mad and thecampaign without overloading your inbox. We will only send you the importantmessages only a few times a month. Sign up for Email Lite here:https://secure.ngpvan.com/jaqe1XmM2Ea2ZZ_R1XFjFg2?refcode=footer&ContactId;=&refcode2;=36b31e8a-8cc0-ee11-b660-002248223197If you’d like to unsubscribe, we hate to see you go, but click here tounsubscribe:https://secure.ngpvan.com/p/m39uBPW2vUSIrb7nvy835w2?unsubscribedata=ERgIGyWTpb%2BJ3LwgwWe2iLXXMFg14KLGZVTKVESi81mT%2BYUw6mCUkZmkNd5QCL5M0sgMVLTVa2cl%2ByU3avg46QcaBpZX%2BeRzCON%2BWcWwhQZpFvghJpBmSYD5dajRbPTPLh0ILLUQb7oSUerBCFPOkdx%2FYitwn8BXH1JJ22EhO2sHrOkRWfYUeP8sBuLoyhMm9UewcAWolIFbxfgbbFToX4%2BgD0tWRMhARy1omHb4FXZJ%2FRfRrU5vsV6lDYJRRX2Vnq%2FYT4vgTyJJ7UrV5gleJHDgV8lKJn3RToNMXeSa7eDB6TyBI5L%2BSXBSGBeOwKNQTDD9i00rX8aa9oNe2kZGMUx%2FtV668ZNbd6XhxnVH%2FWEk8PPhFYhFKgO6syItmcVVwcNZKUyEa6H3NhmAAqqsSBrTGbNS6xjct3e06FRLkFiNhjo4E14sTZ3obp3AOPZH",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Ronna McDaniel",
            "dpwillis67"
        ],
        "places": [],
        "organizations": [
            "Republican National Committee",
            "GOP"
        ],
        "products": [],
        "committee": "Republican National Committee",
        "name": "Ronna McDaniel",
        "email": "email@rightwaypress.com",
        "subject": "You need to see this immediately",
        "date": "2024-01-31T20:30:22Z",
        "year": "2024",
        "month": "1",
        "day": "31",
        "hour": "20",
        "minute": "30",
        "domain": "rightwaypress.com",
        "body": "Untitled Document Your Party needs your support. Fellow American, I’mreaching out to our Party’s top grassroots leaders with an urgent message. TheRepublican Party is on pace to miss our FIRST fundraising Goal of 2024, butluckily for you, I’m authorizing a1150% Impact just for YOU to get us back ontrack. <> <> As the only organization tasked with electing Conservatives inevery state up and down the ballot, the RNC is in a unique position to pavethe way for a Republican White House. But I’m afraid if you don’t step up andhelp us hit our First Election Year Goal , we’ll beOUTRAISED by theDemocrats. <> <> <> <> <> <> <> FIRST ELECTION YEAR GOAL SUPPORTER: MISSINGDEADLINE: ASAP CONTRIBUTE NOW >> YOU are one of the most importantsupporters in our grassroots movement, and I’m counting on you to set anexample for your fellow Patriots.Will you answer the call? Activate your 1150%IMPACT ASAP with a contribution of $25 and help us prepare to DEFEAT theRadical Left in November. Thank you and God bless you, Ronna McDanielChairwoman, Republican National Committee CONTRIBUTE NOW >> Paid for by theRepublican National Committee Not authorized by any candidate or candidate'scommittee. www.GOP.com This Email was Sent to dpwillis67@gmail.com If youwould like to stop recieving our emails CLICK HERE",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Lynn Peterson",
            "Peter"
        ],
        "places": [
            "Oregon",
            "OR-05",
            "Lake Oswego"
        ],
        "organizations": [],
        "products": [],
        "committee": "Lynn Peterson for Congress",
        "name": "Team Peterson",
        "email": "info@electlynnpeterson.com",
        "subject": "Expectations are high",
        "date": "2024-01-31T21:51:18Z",
        "year": "2024",
        "month": "1",
        "day": "31",
        "hour": "21",
        "minute": "51",
        "domain": "electlynnpeterson.com",
        "body": "Peter, we're just a few hours away from our first end-of-month fundraisingdeadline of the ✨Election Year ✨. For the next few months, our fundraisingnumbers will help set the narrative as we approach the primary and look towardthe general election. For many, these numbers serve as a proxy metric forviability. To some, they show if we have the resources to reach more voters.To others, they're a measurement of just how high the energy there is for acampaign among grassroots donors giving just a few dollars at a time.Generally, they are a window into our ability to put together a winningcampaign and mobilize folks with our message. So we have to hunker down and doall we can to give Lynn a strong show of support at the outset of the ElectionYear. We've been demonstrating on the trail that Lynn is the candidate withthe strongest record of achievement and that she has a clear record of winningbig races — now we have to back that up with robust fundraising. We've set agoal of $10,000 in January — all from grassroots donations. Will you help usget there by donating $10 today? [https://secure.actblue.com/donate/stand-with-lynn-peterson?refcode=2024-01-31-eom&recurring;=&amount;=10&amounts;=10,30,50,100,200&refcode2;=c192d7c7-82c0-ee11-b660-002248223197]Donate Now If you've stored your info with ActBlue Express, we'll process yourcontribution instantly: $5 [https://secure.actblue.com/donate/stand-with-lynn-peterson?express_lane=true&amount;=5&refcode;=2024-01-31-eom&refcode2;=c192d7c7-82c0-ee11-b660-002248223197&amounts;=10,30,50,100,200]$15 [https://secure.actblue.com/donate/stand-with-lynn-peterson?express_lane=true&amount;=15&refcode;=2024-01-31-eom&refcode2;=c192d7c7-82c0-ee11-b660-002248223197&amounts;=10,30,50,100,200]$25 [https://secure.actblue.com/donate/stand-with-lynn-peterson?express_lane=true&amount;=25&refcode;=2024-01-31-eom&refcode2;=c192d7c7-82c0-ee11-b660-002248223197&amounts;=10,30,50,100,200]$50 [https://secure.actblue.com/donate/stand-with-lynn-peterson?express_lane=true&amount;=50&refcode;=2024-01-31-eom&refcode2;=c192d7c7-82c0-ee11-b660-002248223197&amounts;=10,30,50,100,200]OTHER AMOUNT [https://secure.actblue.com/donate/stand-with-lynn-peterson?refcode=2024-01-31-eom&refcode2;=c192d7c7-82c0-ee11-b660-002248223197&amounts;=10,30,50,100,200]Expectations are high for a Democratic challenger in a district that will becritical for the House majority. National Republicans are ready to spendmillions in OR-05, and Lynn needs to show that she's built a movement that canovercome right-wing efforts to define the race. With your support, Peter,we'll meet those expectations — and then some. Please, chip in what you canbefore our deadline tonight. Every donation will make a difference and showthat Lynn's movement is growing even bigger![https://secure.actblue.com/donate/stand-with-lynn-peterson?refcode=2024-01-31-eom&recurring;=&amount;=10&amounts;=10,30,50,100,200&refcode2;=c192d7c7-82c0-ee11-b660-002248223197]Team Peterson Donate Today [https://secure.actblue.com/donate/stand-with-lynn-peterson?refcode=2024-01-31-eom&recurring;=&amount;=10&amounts;=10,30,50,100,200&refcode2;=c192d7c7-82c0-ee11-b660-002248223197]Paid for by Lynn Peterson for Congress This email was sent by Lynn Peterson[https://electlynnpeterson.com/] Lynn Peterson for Congress 333 S State StV128 Lake Oswego, OR 97034 United States Email is an important way for LynnPeterson to keep supporters like you informed about critical issues and tobuild a winning grassroots campaign. Too much email? Switch to our less emailoption here[https://secure.ngpvan.com/45nrpDdGFk6AHkTqyWHOTw2?contactdata=xGlL2FcpLQM2cdYITPY4CSurqvUHIK2HI043PyiEOxKtnf1C2QJxZwREe2zI/gJweNnM8OmoEmF5osTzRrwIfQ==]. Click here to update your email address or other information.[https://secure.ngpvan.com/p/DbSwL8O2GkGc-gfzwMuDBw2?accessCode=4ebcabde-8da1-8471-b60d-62ff73096c34&sspStartingTab;=ContactInfo]If you no longer want to hear from Lynn Peterson, click here to get off allour lists instantly[https://secure.ngpvan.com/p/eDlKJMoC00qiRwNMf3OUYg2?unsubscribedata=I6ax3Dk%2Ber0oIPWO7XcuW0QWblRJAezO9ztlanQsqcNeZNK8Yy60z7oQfkgWTAaW4%2BClh50G%2BXNrnzmRhiVwoxNdorpH3l6aEhp%2BUuBX4w%2Fy%2BLJagFuvQgFMmmRd%2Fe4UXaNEnOTmik9z9QugTHGOznTuwT9VSN6aOiyWLu34pFLQxhZfTU3RpxY6zfdUH9vkoaCW059MLNhk9LOfUxtnUFxM8xYCjcOpd4BEgoehMxZMhL%2BtZ5jOvla3vjxVi5YT4WSWE%2BhBqs2yz2d5jJvjLWOtRKfcTtFmMjyGXPHnjVuftZNqeSuepnkMb5Sa%2BkMimJl9wo83b3eg%2FN%2B6v5jSPSzJ6xRhBlnWqJfp5ig01R08KsJxWrMNN1v%2F9pvAidBpE3cE3Nqsl7eWJMP2XBGsFk%2FdKiFiJ18Xeylb6NrCpQdMRV9K9s64Xk9VDWVA561x]. Questions or concerns? Contact us here[https://secure.ngpvan.com/p/fLF93FpxWE2WxGCbue1iPw2?] .http://www.mandatemedia.com/ [http://www.mandatemedia.com/]",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "James Comer"
        ],
        "places": [],
        "organizations": [],
        "products": [],
        "committee": "Comer for Congress",
        "name": "James Comer",
        "email": "email@myfreedomnews.com",
        "subject": "We’ve hit a brick wall",
        "date": "2024-01-31T22:32:21Z",
        "year": "2024",
        "month": "1",
        "day": "31",
        "hour": "22",
        "minute": "32",
        "domain": "myfreedomnews.com",
        "body": "Something needs to be done Fellow American, We have a major problem… ourJanuary fundraising has hit a brick wall! RUSH A GIFT It’s critical we startoff this election year with a resounding message to the Establishment in DC:our campaign is strong and ready to march through anything to achieve victoryin November. I’m working around the clock, but the truth is I simply can’t doit alone. I urgently need the support of grassroots patriots across this greatcountry to stand with me in this critical time. CHIP IN We both know ourcountry faces a great crossroads in 2024. Either we allow corrupt politiciansto sell out our country with impunity… …or we reclaim the promise of Americangreatness by electing a government of the people, by the people, for thepeople. We must wrestle power away from the Establishment in DC and return itto where it belongs: We The People. The Establishment has the billionaires,the media, and the liberal donors on their side. We have God and each other.I’ll take those odds every day of the week and twice on Sunday. I’d be honoredto have you stand with me against the corruption of Permanent Washington.RUSH A GIFT With Courage, James Comer Chairman, House Oversight CommitteePaid for by Comer for Congress This Email was Sent to dpwillis67@gmail.com Ifyou would like to stop recieving our emails CLICK HERE <>",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Ron Wyden",
            "Donald Trump"
        ],
        "places": [],
        "organizations": [],
        "products": [],
        "committee": "Wyden for Senate",
        "name": "Ron Wyden",
        "email": "campaign@wydenforsenate.com",
        "subject": "Time to face the facts",
        "date": "2024-01-31T23:46:33Z",
        "year": "2024",
        "month": "1",
        "day": "31",
        "hour": "23",
        "minute": "46",
        "domain": "wydenforsenate.com",
        "body": "As we come to the end of the first month of this election year, we have toface some facts. Donald Trump is on a glide path to re-capturing theRepublican nomination for President. He's accomplished this while running onopenly authoritarian rhetoric, gloating that his Supreme Court picksoverturned Roe v. Wade , promising to pardon insurrectionists, and makingplans to radically reshape the executive branch, gut decades of environmentalregulations, and much more. Republicans in Congress have closed ranks behindTrump in rapid succession. The party is all-in on the dangerous MAGA agendamore than ever before. We need to be able to fight them every step of the waythis year through Election Day, and that's why it's critical for us to closeJanuary strong. Can you pitch in before tonight and help us get 45 moregrassroots donations? [https://secure.actblue.com/donate/stand-with-ron-wyden?refcode=2024-01-31-eom&recurring;=&amount;=13&amounts;=10,30,50,100,200&refcode2;=5e24d8d7-92c0-ee11-b660-002248223197]Donate Today [https://secure.actblue.com/donate/stand-with-ron-wyden?refcode=2024-01-31-eom&recurring;=&amount;=13&amounts;=10,30,50,100,200&refcode2;=5e24d8d7-92c0-ee11-b660-002248223197]Voters sent Trump and MAGA-aligned politicians a powerful message in 2022 whenDemocrats held our Senate majority — but it didn't come easily. We had toovercome waves of unfavorable polls and spending from deep-pocketed right-winggroups. The playing field is even tougher this year, but the stakes have neverbeen higher. So I'm doubling down on promoting the policies that we know theAmerican people want: lowering the cost of health care and prescription drugs,ensuring billionaires pay their fair share, protecting data privacy, expandingaccess to reproductive health care, and securing our democracy. These are thepolicies that will help us prevail over Trump's dark vision. And I need youwith me as I work to help Democrats in races across the country fight forthem. So please, donate $13 before tonight![https://secure.actblue.com/donate/stand-with-ron-wyden?refcode=2024-01-31-eom&recurring;=&amount;=13&amounts;=10,30,50,100,200&refcode2;=5e24d8d7-92c0-ee11-b660-002248223197]More soon, Ron Express Donate: If you've stored your info with ActBlueExpress, we'll process your contribution instantly: $5[https://secure.actblue.com/donate/stand-with-ron-wyden?express_lane=true&amount;=5&refcode;=2024-01-31-eom&refcode2;=5e24d8d7-92c0-ee11-b660-002248223197&amounts;=10,30,50,100,200]$15 [https://secure.actblue.com/donate/stand-with-ron-wyden?express_lane=true&amount;=15&refcode;=2024-01-31-eom&refcode2;=5e24d8d7-92c0-ee11-b660-002248223197&amounts;=10,30,50,100,200]$25 [https://secure.actblue.com/donate/stand-with-ron-wyden?express_lane=true&amount;=25&refcode;=2024-01-31-eom&refcode2;=5e24d8d7-92c0-ee11-b660-002248223197&amounts;=10,30,50,100,200]$50 [https://secure.actblue.com/donate/stand-with-ron-wyden?express_lane=true&amount;=50&refcode;=2024-01-31-eom&refcode2;=5e24d8d7-92c0-ee11-b660-002248223197&amounts;=10,30,50,100,200]Paid for and authorized by Wyden for Senate. This email was sent by Ron Wyden[https://www.standtallforamerica.com] Wyden for Senate P.O. Box 3498 Portland,OR 97208 United States Email is an important way for Ron Wyden to keepsupporters like you informed about critical issues and to build a winninggrassroots campaign. Too much email? Switch to our less email option here[https://takeaction.standtallforamerica.com/a/less-email?contactdata=3ZLWMX8AcJUcviOCnzjgdcacUvHSh8Jsm0ewuEqEUxUPaUy0mpMXWyMIF1ktrfgR]. Click here to update your email address or other information.[https://secure.ngpvan.com/p/t_05VCIF40Gh7i86FAf0Eg2?accessCode=9f128640-d54e-aa17-6b2a-5f38c068e998&sspStartingTab;=ContactInfo]If you no longer want to hear from Ron Wyden, click here to get off all ourlists instantly[https://takeaction.standtallforamerica.com/a/unsubscribe?unsubscribedata=SWHV2Lg64u2JoZohL4NwKw%2F%2BAOku%2F77LbtUK680sXbWALBQ9Zd70bvyjG0u6xZVr4I1JQqQGk2gcVvj9Mi2rE%2BRlnK4EEV5bj%2Fm6lcD%2FJyE32G3Ql4Myu20ys8o3Bv5vqePI0q80OUXQQUhVEFQoeKpeJo1UJ%2Fw%2FmHBRGgLYRt%2BTkoyMuDeqzsj%2B8f%2B8Pztvmj0oHxFmt2PiXK4eXhs90Hc2bVL22PpCbmJLDn%2BhaDBB6Pfjc5Ud2Xcpj41BbAO8pgfgGjluOm3agFhRBZO9%2BUP8x5Do7weQ416PTme8q3bwndeLbCrXh7cZSIXbCugE7U1qK3ie303iCmWr6eX6cKKEPdhovNFw2AXT%2FU7u%2FmPGc1GAeV6gikwGYMAJlSPeLpHXqVGAxOrxeBEA7TtAsJfktkaxFX92gZIEzygsC18%3D]. Questions or concerns? Contact us here[https://www.standtallforamerica.com/contact/] .",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [],
        "places": [
            "Pennsylvania"
        ],
        "organizations": [
            "DLCC",
            "ActBlue Express",
            "Democratic Legislative Campaign Committee",
            "DLCC PAC"
        ],
        "products": [],
        "committee": "DLCC PAC",
        "name": "Special Election Alert (via DLCC.org)",
        "email": "staff@dlcc.org",
        "subject": "re: one of the most important special elections of the year",
        "date": "2024-01-31T21:10:39Z",
        "year": "2024",
        "month": "1",
        "day": "31",
        "hour": "21",
        "minute": "10",
        "domain": "dlcc.org",
        "body": "With eight hours left before our January deadline and less than two weeks until this special election, we need supporters like you to help invest in state legislative races. Right now PA needs our attention. | | |  --- | ![DLCC Logo](https://actionnetwork.org/user_files/user_files/000/097/354/original/2023_09_Email-Wrapper-Graphic_B_v2.png) |  ---|--- Here’s what's happening in Pennsylvania: * The House is currently **_TIED_** , and we have **one of the most important special elections of the year** happening in less than _TWO WEEKS_.  * **A win** means Democrats defend control of the chamber and continue fighting for abortion access while keeping extreme Republican lawmakers in check.  * **A loss** next month means far-right Republicans take full control of PA’s legislature and put our fundamental freedoms at risk. **We just announced a $50,000 investment in PA, but we need to keep up our work leading up to Election Day. That’s why we’re counting on you to step up today.** Will you own a piece of this fight and pitch in a 3X-matched gift of $7 to power our candidates to victory in Pennsylvania and beyond? | If you've stored your payment information with ActBlue Express, your donation will process immediately.  --- | Chip in $7 now ($21 impact!) --- | Chip in $25 now ($75 impact!) --- | Chip in $50 now ($150 impact!) --- | Chip in $100 now ($300 impact!) --- | Chip in another amount » ---  We can’t let Republicans take Pennsylvania backward. This is a must-win race,and our in-state partners need every resource to mount the strongest campaignpossible in this notorious battleground county.With only **eight hours left before our January deadline** and two weeks untilthis special election, we need supporters like you to help invest in statelegislative races. **Right now PA needs our attention – it’s all hands ondeck.**Before tonight’s midnight deadline, can we count on you to chip in a3X-matched gift of $7, rally behind our state Democrats and power ourcandidates to victory in critical battlegrounds like Pennsylvania andnationwide?Let's do this.Team DLCC  3X-MATCH: ACTIVE » **MAKE IT MONTHLY »**             | --- Democratic Legislative Campaign Committee 1225 Eye Street NW Suite 1250, Washington, DC 20005 Paid for by DLCC PAC. Dlcc.org. Not authorized by any candidate or candidate'scommittee.  Contributions or gifts to DLCC PAC are not tax deductible. | The Democratic Legislative Campaign Committee and DLCC PAC are dedicated to winning and defending Democratic majorities in state legislatures across the country. This message was sent to dpwillis67@gmail.com because you are a part of our grassroots network.  Emails are a crucial way to stay in touch with our supporters. Please add usto your address book or safe senders list to ensure timely election updates.  We're fighting to elect Democrats and advance a progressive vision in thestates. Our success depends on grassroots donors like you. Ninety-eightpercent of our donors give less than $200, and two-thirds give less than $20.To make a contribution, please click here. To unsubscribe and stop receivingemails about our efforts, please click here. ---  | | Sent via ActionNetwork.org. To update your email address, change your name or address, or to stop receiving emails from Democratic Legislative Campaign Committee, please click here.  ---  ![](https://an.dlcc.org/ss/o/sKxQ9Tusut-gXiwfMaIEaQ/43g/j8-y4zEdR9GB6vFl1pB57w/ho.gif)",
        "party": "D",
        "disclaimer": "TRUE"
    }
]