[
    {
        "names": [
            "Derek",
            "Andrew"
        ],
        "places": [
            "Virginia"
        ],
        "organizations": [
            "Democratic Party of Virginia"
        ],
        "products": [],
        "committee": "Democratic Party of Virginia",
        "name": "Andrew Whitley",
        "email": "info@vademocrats.org",
        "subject": "An update on the Blue Commonwealth Gala",
        "date": "2021-08-27T15:52:04Z",
        "year": "2021",
        "month": "8",
        "day": "27",
        "hour": "15",
        "minute": "52",
        "domain": "vademocrats.org",
        "body": "Hi Derek, We’re going virtual, folks! Due to the COVID-19 pandemic and therise of the Delta variant, the 2021 Blue Commonwealth Gala will now bevirtual. While it is unfortunate that we cannot see you all in person, we arelooking forward to the exciting virtual event our team is putting together.Donate any amount to reserve your ticket today.[https://secure.actblue.com/donate/bcg21f] The DPVA is hard at work creatingrobust programs to elect Democrats up and down the ballot and the money raisedthrough this event goes toward making sure we continue on our road of successfor everyone who calls the Commonwealth home.https://secure.actblue.com/donate/bcg21f[https://secure.actblue.com/donate/bcg21f] In 2019, we took the majority inVirginia for the first time in a generation. In 2020, we took back thepresidency. Chip in any amount to virtually join your fellow VirginiaDemocrats on September 25th in the fight to keep our majority in the House andelect our statewide ticket in 2021 .[https://secure.actblue.com/donate/bcg21f] Best, Andrew ---- Paid for by theDemocratic Party of Virginia, www.vademocrats.org. Not authorized by anycandidate or candidate’s committee. Democratic Party of Virginia PO Box 448Richmond, VA 23218 United States To unsubscribe, go to: unsubscribe:https://email.ngpvan.com/unsubscribeUnique/6781dddb-9f06-ec11-981f-501ac57ba3ed/23760ca1-4e07-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMDYvMS84NDIzNSIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICIyMzc2MGNhMS00ZTA3LWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=EtY63EEjQ1z7eg_EF49AijEODe9GJXzZXU8BDbUAQwo=&id;=118612594",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Joe Biden",
            "Kamala Harris",
            "Lloyd Austin",
            "Peter",
            "Andy Biggs",
            "Donald Trump",
            "Blinken"
        ],
        "places": [
            "Afghanistan",
            "America",
            "Israel",
            "Middle East",
            "Saigon",
            "Kabul"
        ],
        "organizations": [
            "House Freedom Caucus",
            "BIGGS FOR CONGRESS",
            "USA Freedom Fighters"
        ],
        "products": [],
        "committee": "BIGGS FOR CONGRESS",
        "name": "Rep. Andy Biggs",
        "email": "anthony@usafreedomfighters.org",
        "subject": "Resign!",
        "date": "2021-08-31T16:03:20Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "16",
        "minute": "3",
        "domain": "usafreedomfighters.org",
        "body": "Peter, I miss having a President who didn't back down to America's enemies. Joe Biden, Kamala Harris, and Secretary of Defense Lloyd Austin should RESIGN immediately following the complete collapse of Afghanistan at the hands of the Taliban. We haven't seen images like the ones from the front lines since the fall of Saigon. This is NOT a display of American Exceptionalism, and it's NOT the way we treat our men and women in uniform and the American citizens on the ground! Everyone responsible for this botched withdrawal should resign immediately! If you believe Joe Biden failed our Armed Forces and our American interests on the ground in Afghanistan, stand with me by making your immediate contribution of $25, $50, $100, $250, or even $1,000 today. Joe Biden's failure in Afghanistan destabilizes the Middle East and jeopardizes our security and the safety of our allies in Israel. Since July: Joe Biden has assured the American people Kabul WOULD NOT fall to the Taliban. He has given the Taliban a list of Americans and other high-profile allies, putting them in danger of being captured and tortured… or worse. He presided over a suicide bombing near an entrance to the airport in Kabul, leading to the deaths of more than a dozen U.S. military personnel and dozens of others. He and Secretary Blinken have begun importing unvetted immigrants from Afghanistan, including those with potential ties to extremist groups! President Trump issued a timeline for withdrawal, but he would never have left American forces and diplomats on the ground without resources to defend our interests and get out safely. Joe Biden surrendered in Afghanistan, and he surrendered the America First policies that make our nation great. Joe Biden is failing to lead our country, and it's absolutely shameful. It's time to hold Joe Biden, Kamala Harris, and Lloyd Austin accountable - they should resign immediately! I'm forcing their hand in Congress, and I'm asking for your immediate help. If you want to save America's greatness in the face of the Taliban takeover of Afghanistan, please chip in $1,000, $250, $100, $50, or even $25 right away. Joe Biden's failure in Afghanistan will echo across the globe, weaken our position as a global leader, and embolden terrorists. You and I must hold him accountable. Thank you. Protecting Our Sovereignty, Rep. Andy Biggs (AZ-5) Chairman, House Freedom Caucus PAID FOR BY BIGGS FOR CONGRESS Please take a minute to read the special message from our sponsor. Sponsorships like this one help us keep our news service free of charge. The sponsorship above reflects the opinions & representations of the advertiser, & not necessarily the opinion of USA Freedom Fighters. This email was sent to: dpwillis67@gmail.com © 2021 USA Freedom Fighters Report as Spam This message was intended for: dpwillis67@gmail.com You were added to the system April 25, 2020. For more information click here. Update your preferences Unsubscribe | Unsubscribe via email",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Matt Jacobs",
            "Peter"
        ],
        "places": [
            "California",
            "Ventura County",
            "Thousand Oaks"
        ],
        "organizations": [
            "Matt Jacobs for Congress",
            "Democratic"
        ],
        "products": [],
        "committee": "Matt Jacobs for Congress",
        "name": "Matt Jacobs, Candidate for U.S. Congress (CA-26)",
        "email": "matt@outreach.mattjacobsforcongress.com",
        "subject": "This is personal to me.",
        "date": "2021-08-31T20:53:07Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "20",
        "minute": "53",
        "domain": "outreach.mattjacobsforcongress.com",
        "body": "Major deadline TONIGHT. Help end single-party Democratic control. Peter— I’m afather of three young children and a former federal counter-terrorismprosecutor. That’s why everything happening today – both at home and abroad –feels so personal to me. I’m running for Congress because I care deeply aboutour community and country. And I need your support, Peter, to get there.URGENT DEADLINE: Help Me Reach My Goals As a Californian, I’m all toofamiliar with the devastating effects of single-party Democratic rule in thisstate. Now, unfortunately, we’re seeing the devastating effects of single-party Democratic rule on a national scale. URGENT DEADLINE: Help Me Reach MyGoals Peter, there's no limit to the damage Democrats might do if theircontrol of government continues to gounchecked. >> That’s why it's soimportant for us to win this seat and take back the House in 2022. URGENTDEADLINE: Help Me Reach My Goals Democrats know they’re vulnerable here inVentura County. And as their failures grow nationally, so too does theintensity of their baseless attacks on candidates like me. Our most importantdeadline yet is at midnight tonight. Can I count on you to help us meet ourend-of-month goals so we have the resources to fight back? URGENT: Support ourdefense fund before midnight tonight. Thank you for your support, Peter. MattJacobs Candidate for Congress (CA-26) Paid for by Matt Jacobs for CongressP.O. Box 4723 3435 E. Thousand Oaks Blvd, Thousand Oaks, CA 91359 Click hereto unsubscribe.",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Eric Greitens",
            "Kimberly Guilfoyle",
            "George Soros",
            "Kamala Harris"
        ],
        "places": [
            "Missouri",
            "U.S."
        ],
        "organizations": [
            "Greitens for U.S. Senate",
            "Department of Defense"
        ],
        "products": [],
        "committee": "Greitens for U.S. Senate",
        "name": "Kimberly Guilfoyle, Eric, me (3)",
        "email": "eric@greitens4missouri.com",
        "subject": "FW: Critical Deadline",
        "date": "2021-08-31T17:04:24Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "17",
        "minute": "4",
        "domain": "greitens4missouri.com",
        "body": "Our chance to take back the Senate. Peter, As the National Chair of EricGreitens’ MUST-WIN U.S. Senate campaign, I promised Eric there was no way I’dlet us fall behind on our fundraising goals. But with just hours left untilthe end-of-month deadline, we’re still $11,539 short. Thankfully, we were ableto secure a 300% match on all gifts before we close the books tonight -- butthat match will mean nothing without grassroots patriots like YOU to help useit. So please, make a contribution before the end-of-month deadline TONIGHT at11:59 P.M. to help a pro-Trump Navy SEAL win this OPEN seat that will decidethe fate of the 50-50 Senate. All gifts 300% MATCHED >>> CONTRIBUTE $25 >>$100 CONTRIBUTE $50 >> $200 CONTRIBUTE $75 >> $300 CONTRIBUTE $100 >> $400CONTRIBUTE $250 >> $1000 CONTRIBUTE OTHER AMOUNT Thank you, KimberlyGuilfoyle National Chair Greitens for U.S. Senate - - - - Forwarded Message -- - - From: Eric Greitens Sent: Thurs, August 26, 2021 Subject: re: 1 seat To:dpwillis67+greitens@gmail.com Peter, George Soros spent MILLIONS in 2020 toensure the fate of his socialist agenda and secure the Senate majority forKamala Harris. Now we’re just 1 SEAT away from ending Kamala’s 50-50 Senatemajority -- but we’re still $35,818 short of meeting our August fundraisinggoal. That’s why with the end-of-month deadline nearly here, I’m counting onyour sustained support to help CRUSH our goal. Please make a contributionbefore the end-of-month deadline to help a pro-Trump Navy SEAL WIN the openSenate seat needed to FLIP Kamala’s 50-50 Senate majority. CONTRIBUTE $25CONTRIBUTE $50 CONTRIBUTE $75 CONTRIBUTE $100 CONTRIBUTE $250 CONTRIBUTEOTHER AMOUNT Our campaign is George Soros’s worst nightmare, Peter. Soros isused to buying his radical puppets' paths to victory… But if every AmericaFirst patriot across the country steps up to win this OPEN seat that willdetermine the fate of the 50-50 Senate, we’ll have a grassroots army that caneven go toe-to-toe with Soros millions. That’s why it’s so important that wecrush our fundraising goals and give the early signal to Soros and his liberallackeys like Kamala -- their Senate majority is coming to an end. Please makea contribution before the end-of-month deadline to help a pro-Trump Navy SEALWIN the open Senate seat needed to FLIP Kamala’s 50-50 Senate majority. Thankyou, Eric Greitens Navy SEAL Candidate for U.S. Senate (Missouri) Paid for byGreitens for U.S. Senate PO Box 989, Chesterfield, MO 63006 Military imagesand information do not imply endorsement by DOD [Department of Defense] or anyservice branch. This email was sent to: dpwillis67+greitens@gmail.com. Pleasedo not reply to this email as this address is not monitored. We believe thatemail is a vital way to stay in direct contact with supporters, but you canclickhere if you would like to unsubscribe from these messages.",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [],
        "places": [
            "Minnesota",
            "Saint Paul",
            "United States"
        ],
        "organizations": [
            "Minnesota Political Contribution Refund Program",
            "House DFL",
            "ActBlue Express",
            "DFL House Caucus"
        ],
        "products": [],
        "committee": "DFL House Caucus",
        "name": "House DFL Refund",
        "email": "house@dflhouse.com",
        "subject": "Redeem now",
        "date": "2021-08-31T20:15:43Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "20",
        "minute": "15",
        "domain": "dflhouse.com",
        "body": "Friend, The Minnesota Political Contribution Refund (PCR) Program has been renewed for 2021. That means you can make a contribution of $50 (or $100 per couple) and receive a full refund from the state. If you've saved your payment information with ActBlue Express, your donation will go through immediately Refundable $50 Refundable $100 According to our records, you have not yet claimed your 2021 Refundable Contribution with the House DFL. The end of the month is a very important time for our organization as we make plans for the month ahead. Will you make a fully refundable contribution before our end of the month goal at midnight tonight? Thank you, House DFL Team Donate -------------------------------------------------------- | Prepared and paid for by the DFL House Caucus. | -------------------------------------------------------- DFL House Caucus 255 E Plato Blvd Saint Paul MN 55107 United States If you believe you received this message in error or wish to no longer receive email from us, please https://act.myngp.com/el/42RJeE7cPH-kXrVQHgCFSEzkMhfZBo6dJdOWRdzMdoE=/0JNX6ctHC8Sufk3jsWEI7wNXAsiPdYtqljFj5dioTTc=.",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Jim Inhofe",
            "Chuck Schumer"
        ],
        "places": [
            "Oklahoma City",
            "Oklahoma"
        ],
        "organizations": [
            "Friends of Jim Inhofe",
            "Democrat"
        ],
        "products": [],
        "committee": "Friends of Jim Inhofe",
        "name": "Jim Inhofe",
        "email": "info@senatepatriot.com",
        "subject": "Can I count on you, Friend?",
        "date": "2021-08-30T22:04:22Z",
        "year": "2021",
        "month": "8",
        "day": "30",
        "hour": "22",
        "minute": "4",
        "domain": "senatepatriot.com",
        "body": "Can I count on you, Friend? We need you now more than ever. View this emailonline http://email.senatepatriot.com/q/1m71536TLL01RT03k7N6/wvhttp://email.senatepatriot.com/c/11DBVhfskiCE9L1eiW4zNiP Democrats areofficially on the defensive. They know that we are SO close to beating ChuckSchumer… all we need is ONE MORE SEAT. If everyone on this list steps up, wewill be that much closer to reclaiming our Majority. This deadline is socrucial that I have unlocked an EMERGENCY 2X-MATCH. CHIP IN $25 X 2http://email.senatepatriot.com/c/11DCijW4uX6mxXkMvb0MhaJ CHIP IN $50 X 2http://email.senatepatriot.com/c/11DCtQhnAhldK3uyBitSw6G CHIP IN $100 X 2http://email.senatepatriot.com/c/11DCFmCGFBA4W9EkHpWYL2D CHIP IN $250 X 2http://email.senatepatriot.com/c/11DCQSXZKVOW8fO6Nxq4ZYA It is CRITICAL thatwe reach our fundraising goal! Liberal Billionaires are lining the pockets ofcountless Democrat campaigns. We can’t win back the Majority without you!Thank you for your support, Jim Inhofe PAID FOR BY FRIENDS OF JIM INHOFE POBox 13300 Oklahoma City, OK 73113 If you would like to no longer receive theseemails, click Unsubscribehttp://email.senatepatriot.com/u/1aAFLXMEUyTS5MSAdSR9.",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Tim Ryan",
            "Donald Trump",
            "Rachel Maddow",
            "Lawrence O'Donnell"
        ],
        "places": [
            "Ohio"
        ],
        "organizations": [
            "MSNBC",
            "Republican party",
            "Democratic Senate Majority",
            "Tim Ryan for Ohio"
        ],
        "products": [],
        "committee": "Tim Ryan for Ohio",
        "name": "Team Ryan",
        "email": "info@e.timforoh.com",
        "subject": "Rachel Maddow confirms: Trump is terrified of Tim Ryan",
        "date": "2021-08-31T22:07:33Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "22",
        "minute": "7",
        "domain": "e.timforoh.com",
        "body": "[ https://act.timforoh.com/go/46?t=1001&akid;=737%2E3611125%2EWhczCn ][IMG]MSNBC confirmed it: Trump chose to hold his first rally since leaving theWhite House in Ohio because he knows Tim Ryan has the momentum to flip thisopen Senate seat blue. [https://act.timforoh.com/go/1858?amount=5&t;=1007&akid;=737%2E3611125%2EWhczCn]'Trump taking the shots at Congressman Ryan… says something about his chancesat winning that Senate seat.' -- Rachel Maddow Ohio’s open seat is one of themost likely to flip in 2022. Tim is THE Democrat to win this seat and expandour Democratic Senate Majority -- and Donald Trump knows it. Republicans willpour millions of dollars into Ohio to try to stop Tim’s momentum. [https://act.timforoh.com/go/1859?t=1008&akid;=737%2E3611125%2EWhczCn ]Can wecount on you to chip in $25 and make sure we have the resources to compete? [https://act.timforoh.com/go/1859?t=1009&akid;=737%2E3611125%2EWhczCn ]DonateCheck out what Maddow’s fellow MSNBC host Lawrence O’Donnell had to say: [https://act.timforoh.com/go/1858?amount=5&t;=1010&akid;=737%2E3611125%2EWhczCn]'There are already a handful of Republican candidates for Senate in Ohio. ButDonald Trump didn't go there to help any of them. He went there to try to stopTim Ryan.' -- Lawrence O’Donnell O’Donnell was crystal clear: he said DonaldTrump went to Ohio to attack Tim Ryan and that Trump is “very afraid” of Tim.Trump’s position as the leader of the Republican party rests on his ability toflip the House and Senate red in 2022. But he can’t compete with Tim’s trackrecord and winning message of cutting workers in on the deal. That’s why weneed the resources to get Tim’s message out everywhere across our state -- andmake sure it’s louder than all the Republican BS Trump’s directing our way. Weneed your help to send Trump and his team a clear message: [https://act.timforoh.com/go/1859?t=1011&akid;=737%2E3611125%2EWhczCn ]Tim hasthe people behind him, and we’re going all the way to the Senate! [https://act.timforoh.com/go/1859?t=1012&akid;=737%2E3611125%2EWhczCn ]Donate$25 [ https://act.timforoh.com/go/1860?t=1013&akid;=737%2E3611125%2EWhczCn]Donate $50 [https://act.timforoh.com/go/1861?t=1014&akid;=737%2E3611125%2EWhczCn ]Donate$100 [ https://act.timforoh.com/go/1862?t=1015&akid;=737%2E3611125%2EWhczCn]Donate $200 [https://act.timforoh.com/go/1863?t=1016&akid;=737%2E3611125%2EWhczCn ]Donate$250 [ https://act.timforoh.com/go/1864?t=1017&akid;=737%2E3611125%2EWhczCn]Other Amount -- Team Ryan [https://act.timforoh.com/go/47?t=1002&akid;=737%2E3611125%2EWhczCn ][IMG] Webelieve that emails are the best way for our organization to stay in touchwith supporters like you. But if you'd like to receive fewer emails, [https://act.timforoh.com/signup/Fewer_Emails/?t=1003&akid;=737%2E3611125%2EWhczCn]click here. If you'd like to make a donation to our campaign, you can do thatbelow! [ https://act.timforoh.com/go/1774?t=1004&akid;=737%2E3611125%2EWhczCn]Donate Monthly [https://act.timforoh.com/go/49?t=1005&akid;=737%2E3611125%2EWhczCn ]DonateOnce Paid for by Tim Ryan for Ohio Tim Ryan for Ohio P.O. Box 189 Niles, Ohio44446 United States [ mailto:info@timforoh.com ][IMG] [https://act.timforoh.com/go/11?t=1006&akid;=737%2E3611125%2EWhczCn ][IMG] Youcan unsubscribe from this mailing list at any time:http://act.timforoh.com/cms/unsubscribe/unsubscribe/?akid=737%2E3611125%2EWhczCn",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Marco Lopez",
            "Marjorie Taylor Greene",
            "Matt Gaetz",
            "Donald Trump",
            "Doug Ducey",
            "Kelli Ward",
            "Nate Silver",
            "President Biden",
            "Barack Obama"
        ],
        "places": [
            "Arizona"
        ],
        "organizations": [
            "The Washington Post",
            "Arizona GOP",
            "ActBlue",
            "POLITICO",
            "FiveThirtyEight"
        ],
        "products": [],
        "committee": "Marco Lopez for Governor",
        "name": "GOP Extremism Alert",
        "email": "info@marcolopez.com",
        "subject": "the ONLY way to stop GOP extremists",
        "date": "2021-08-31T16:06:16Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "16",
        "minute": "6",
        "domain": "marcolopez.com",
        "body": "Friend, Arizona is GROUND ZERO in the fight for our democracy – and as an expert at The Washington Post confirms, the ONLY way to stop GOP extremists in their tracks is by replacing them with a Democratic governor. Can you donate right now – before our critical end-of-month deadline at midnight – to help elect Marco Lopez (D), defeat these extremists and flip Arizona blue? https://secure.actblue.com/contribute/page/marco-lopez-for-governor_email3?amounts=5,25,50,100,250&refcode;=jtk188-fr-text We're FINALLY in a position to kick these extremists out of power – but there's a major problem: The Arizona GOP is bringing its most dangerous conspiracy theorists to our state to attack our democracy. First, Marjorie Taylor Greene and Matt Gaetz – the Trump-obsessed, QAnon-backing, \"Stop the Steal\" duo – came to challenge President Biden's victory. Then Donald Trump himself came to rile up his rabid base and keep battleground Arizona red! Arizona Republicans should be ashamed of these conspiracy theorists. But instead, Doug Ducey, Kelli Ward and our GOP opponents are 100% focused on propping them up instead of solving the problems facing working Arizonans. That's why Marco Lopez (D) – a former border-city mayor and Obama administration alum – is running for governor to defeat these Republican extremists and flip Arizona blue. Nate Silver's FiveThirtyEight confirms that this race is a TOSS-UP, which means Democrats need a fighter here who can win. But POLITICO is reporting that Republicans are getting ready to spend BIG to defeat us – and right now, we're falling short of the resources we need to fight back and win this race. In a fight against this much far-right firepower, every dollar counts. So please – with only HOURS until our critical end-of-month fundraising deadline – will you donate whatever you can spare to flip Arizona blue and defeat these dangerous GOP extremists? https://secure.actblue.com/contribute/page/marco-lopez-for-governor_email3?amounts=5,25,50,100,250&refcode;=jtk188-fr-text Thank you, Team Lopez -------- This email was sent to dpwillis67@gmail.com. To unsubscribe from this email list, please click here: https://email.ngpvan.com/unsubscribeUnique/be007c7f-c009-ec11-981f-501ac57ba3ed/57bc5133-750a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMzAvMS84OTQ2MyIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICI1N2JjNTEzMy03NTBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=o609QWH1WqPRdb3OpIOyslllvvDa9UltBMduFR4RoK0=&id;=107358601 Marco Lopez for Governor PO Box 34672 Phoenix, AZ 85067 United States 2021 | Paid for by Marco Lopez for Governor Authorized by Marco Lopez",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Larry Elder",
            "Bernie Sanders",
            "Kamala",
            "Biden",
            "Elizabeth Warren",
            "Gavin Newsom",
            "Lou Barnett",
            "Geoff Palmer",
            "Saul Fox"
        ],
        "places": [
            "California",
            "East Coast"
        ],
        "organizations": [
            "Larry Elder Recall Newsom Ballot Committee"
        ],
        "products": [],
        "committee": "Larry Elder Ballot Measure Committee Recall Newsom",
        "name": "Larry Elder Recall Newsom",
        "email": "info@ourdefenseofamerica.com",
        "subject": "Bernie is campaigning for Newsom",
        "date": "2021-08-31T19:06:22Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "19",
        "minute": "6",
        "domain": "ourdefenseofamerica.com",
        "body": "Larry Elder Recall Newsom Ballot Committee Warren, Bernie, Kamala and evenBiden have all thrown their hats into the ring for Newsom because they knowhe’s in big trouble. Friend, Gavin Newsom just launched a new anti-recall addfeaturing Bernie Sanders, which has him pedaling radical policies andattacking the voters who are fed-up with Newsom’s oppressive and destructivereign over California. This is the second time Newsom has gotten a radicalleftist socialist U.S. Senator from the East Coast to appear in an ad for him–Elizabeth Warren being the first. This ad is now running all over Californiato motivate the Left to vote against the recall, and it’s working. Can wecount on you to rush in $25, $50, $100 or more today to help us fight backagainst the Left’s new ad blitz and ensure we can get our own pro-recallmessages in front of voters? HELP RECALL GAVIN NEWSOM → Warren, Bernie,Kamala and even Biden have all thrown their hats into the ring for Newsombecause they know he’s in big trouble. Polls still show this recall as neckand neck, but the Democrats’ ad blitz has them up in early mail-in ballotreturns. We must ramp up our voter turnout efforts and ensure recallsupporters turn in their mail-in ballots or vote on election day. With leftistelites flooding in from all over the country to save Newsom, we desperatelyneed your help top stop them.We only have TWO WEEKS left to make this happen,so can we count on you in crunch time? Will you send in $25, $50, $100 or moreto help us fend off this 11th hour Bernie ad blitz from the Left? We won’t beable to pull off a successful recall and run voter turnout messages of our ownwithout your help. Thank you, Lou Barnett Campaign Manager Larry Elder RecallNewsom Ballot Committee HELP RECALL GAVIN NEWSOM → PAID FOR BY LARRY ELDERBALLOT MEASURE COMMITTEE RECALL NEWSOM Committee major funding from: GeoffPalmer Saul Fox Don't want to receive any more of our emails? We hate to seeyou go, but you can unsubscribe here .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Joe Biden",
            "President Trump",
            "Donald Trump"
        ],
        "places": [],
        "organizations": [
            "NRSC",
            "Senate",
            "Democrats",
            "Republicans"
        ],
        "products": [],
        "committee": "the NRSC",
        "name": "Please respond before midnight",
        "email": "info@standingstrongamerica.com",
        "subject": "You’ve Been Selected",
        "date": "2021-08-31T17:31:43Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "17",
        "minute": "31",
        "domain": "standingstrongamerica.com",
        "body": "NRSC DON'T LET PRESIDENT TRUMP DOWN! 🔔 AUGUST DEADLINE 🔔 Peter, We’ll getstraight to the point. We have a MAJOR FUNDRAISING DEADLINE and we’re stillshort $21,422 to SAVE President Trump’s legacy. Here’s why this matters. JoeBiden has FAILED as President. He is a weak leader and last weekhe bowed toterrorists by taking orders from them. Yet, Democrats are still forcingBiden’s radical agenda through the Senate and President Trump needs YOUR helptoWIN BACK the majority and put America First. You’ve been personally selectedto help us BEAT THIS FUNDRAISING DEADLINE AND PROTECT PRESIDENT TRUMP’SLEGACY. You’ve seen what happens when Democrats try putting politics overpeople. Donate $25 or more RIGHT NOW and we’ll send your name to Trump so heknows he still has your support. August End Of Month Deadline Participant:dpwillis67@gmail.com Account Number: A-33712943 Status: PENDING Deadline:MIDNIGHT ACT NOW BEFORE TIME RUNS OUT! DONATE $25 NOW Peter, we need YOURhelp. Trump’s legacy AND the Senate majority are on the line. Will you step upand donate right now? Biden MUST GO and his radical agenda MUST GO with him.Help us WIN BACK the Senate now. If you donate $25 or more right now we’llsend YOUR NAME TO PRESIDENT TRUMP so he knows he still has your support.August End Of Month Deadline Participant: dpwillis67@gmail.com AccountNumber: A-33712943 Status: PENDING Deadline: MIDNIGHT ACT NOW BEFORE TIME RUNSOUT! DONATE $25 NOW Thanks, NRSC HQ If you want to help Republicans TAKE BACKTHE SENATE, text WIN to 55404 to receive mobile alerts! Message and data ratesmay apply. Text \"STOP\" to opt-out. T&C;/Privacy Policy. Paid for by the NRSC.Not authorized by any candidate or candidate's committee. www.NRSC.orgContributions to the NRSC are not deductible as charitable contributions forfederal income tax purposes. NRSC, 425 2nd Street NE, Washington D.C. 20002Don't want to receive any more of our emails? We hate to see you go, but youcan unsubscribe here .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Joe Biden",
            "Jarrin Jackson",
            "Kamala Harris",
            "Antony Blinken",
            "Lloyd Austin",
            "General Milley",
            "Marsha Blackburn",
            "Josh Hawley",
            "Donald Trump",
            "Nixon"
        ],
        "places": [
            "Afghanistan",
            "Tennessee",
            "Missouri",
            "Southern border"
        ],
        "organizations": [
            "Drain the DC Swamp PAC",
            "Federal Government",
            "Supreme Court"
        ],
        "products": [],
        "committee": "Drain the DC Swamp PAC",
        "name": "=?utf-8?Q?Jarrin=20Jackson?=",
        "email": "team@draindcswamppac.com",
        "subject": "Biden Must Go",
        "date": "2021-08-31T20:59:58Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "20",
        "minute": "59",
        "domain": "draindcswamppac.com",
        "body": "We need to get rid of this fraud https://secure.anedot.com/draintheswamp/st HiPeter, It's time to pull the plug on His Fraudulency, Joe Biden. The guy whonever should have been President in the first place, has messed everything upto the Nth degree. Afghanistan debacle. Border crisis. Inflation. We have hadenough of his lies and his radical, failed Socialist policies. It's time to#FIREBIDEN! That's where we come in.(https://secure.anedot.com/draintheswamp/st) My name is Jarrin Jackson, and Iam the chairman of Drain the DC Swamp PAC - I also served in Afghanistan as aninfantry officer. We are America First patriots supporting Trump and actuallyFIGHTING Biden - pressuring Congressmen and Senators to remove him fromoffice! At this point, is there any real doubt that His Fraudulency has been acomplete disaster? A wave of prominent Republican lawmakers on Thursday calledfor President Joe Biden to be impeached or to resign, arguing his decisionscreated an environment ripe for crisis that indicates he is not capable ofleadership. “Joe Biden, Kamala Harris, Antony Blinken, Lloyd Austin andGeneral Milley should all resign or face impeachment and removal from office,”Tennessee Sen. Marsha Blackburn tweeted. “This is the product of Joe Biden’scatastrophic failure of leadership. It is now painfully clear he has neitherthe will nor the capacity to lead. He must resign,” Missouri Sen. Josh Hawleysaid in a statement. They join a chorus of other Republicans calling forBiden’s resignation, impeachment, or removal by the 25th Amendment, as well asthe resignation of other top officials in his administration, as Talibanforces took control of the country amid a chaotic U.S. exit. Will you help uspressure lawmakers to #FIREBIDEN? (https://secure.anedot.com/draintheswamp/st)https://secure.anedot.com/draintheswamp/st Unfortunately, that's not all thisincompetent President has unleashed on us. Gas prices are at an 8 year highand spiking, thanks for Biden's anti-energy \"Green New Deal\" policies. It'spart of a general spike in prices- known as inflation, which is defined as toomany dollars chasing too few goods. In other words, the Federal Government isprinting money like crazy but the country isn't producing enough. Welcome toSocialism. And of course, we have all seen the grizzly images of thehumanitarian crisis at the Southern border. Tens of thousands of unaccompaniedchildren, criminals and gang members, and illegal immigrants streaming acrossour border. Not only has Biden refused to enforce Federal law, but he actuallySTOPPED construction on Trump's border wall, which was actually working tostop illegal immigration! He has refused to enforce Federal immigration law,for which the Supreme Court has already smacked him down. He is spending usinto oblivion and causing inflation, paying people NOT to work. It's time toend this nightmare. Time to use impeachment, or the 25th Amendment, to#FIREBIDEN. https://secure.anedot.com/draintheswamp/st Now, this won't beeasy. There are some weak-kneed \"Republicans\" who will resist. That's whyDrain the DC Swamp PAC needs to pressure those weak Republicans and soft Demsto impeach him and remove him! Who knows, maybe if he's impeached he mightresign like Nixon did. God knows he should. We cannot trust the politicians todo the right thing- many of them, anyway. They won't see the light until theyfeel the heat! It's time to block ALL of Biden's nominees to anything. It'stime to block ALL his legislation. It's time to remove this demented foolbefore he destroys the country. The 14 American soldiers killed in Afghanistandue to Biden's incompetence and lies deserve nothing less. He MUST be heldaccountable, and if the establishment politicians won't do it, we will makelife difficult for them! Help us pressure these guys into doing the rightthing for the country. (https://secure.anedot.com/draintheswamp/st) Swampersalways betray you the first chance they get, and every single time thereafter.They are good for nothing, and won't do the right thing until they are forcedto! (https://secure.anedot.com/draintheswamp/st) Time to ramp up the pressure!Your $35, $50, $100, $250, $500, or $1,000 donation is crucial so we can holdBiden and his cronies accountable!(https://secure.anedot.com/draintheswamp/st) It won't stop at Biden either. Weneed to impeach Harris and the rest of this failed Woke Socialist bunch. Helpme bust this cartel up! Donate now.(https://secure.anedot.com/draintheswamp/st) Thank you! Respectfully,https://secure.anedot.com/draintheswamp/st Jarrin Jackson Chairman of Drainthe DC Swamp PAC Combat Infantry Veteran P.S. We must defeat these enemies ofthe Republic!! Donate right now to help us defeat them.(https://secure.anedot.com/draintheswamp/st) DONATE NOW!(https://secure.anedot.com/draintheswamp/st)============================================================ Copyright © 2021Drain the DC Swamp PAC, All rights reserved. Our mailing address is: Drain theDC Swamp PAC 5 Halifax Ct Marlton, NJ 08053-2820 USA Want to change how youreceive these emails? You can ** update your preferences(https://draindcswamppac.us1.list-manage.com/profile?u=1a2dd064d65a7957a63c3a254&id;=da99fdd558&e;=ba6e67b849&c;=e2829435d4)or ** unsubscribe from this list (https://draindcswamppac.us1.list-manage.com/unsubscribe?u=1a2dd064d65a7957a63c3a254&id;=da99fdd558&e;=ba6e67b849&c;=e2829435d4). PAID FOR BY DRAIN THE DC SWAMP PAC. NOT AUTHORIZED BY ANY CANDIDATE ORCANDIDATE’S COMMITTEE. Use of the name and likeness of any candidate orofficeholder is for the purpose of this PACs political communication only andIN NO WAY indicates any authorization by, affiliation with, direction from, orendorsement by that person of any kind.",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Joe Biden",
            "Scott Fitzgerald"
        ],
        "places": [
            "Wisconsin"
        ],
        "organizations": [
            "Democrats",
            "Republicans",
            "Scott Fitzgerald for Congress"
        ],
        "products": [],
        "committee": "Scott Fitzgerald for Congress",
        "name": "Scott Fitzgerald",
        "email": "staff@scottfitzgeraldforcongress.com",
        "subject": "Everything Counts",
        "date": "2021-08-31T21:41:43Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "21",
        "minute": "41",
        "domain": "scottfitzgeraldforcongress.com",
        "body": "Peter I know it's getting late, but we have an important deadline at midnight tonight. Every minute counts, and every single one of us who steps up will have an impact on this next election. They're coming for Wisconsin – we already know our state is going to be one of their top targets in their desperate push to hold their majority! Will you step up – BEFORE MIDNIGHT TONIGHT, to help take back the majority from the Democrats who are failing our country? [https://secure.winred.com/scott-fitzgerald-for-congress/aug-21] Click Here – Join Us in the Fight! >>> [https://secure.winred.com/scott-fitzgerald-for-congress/aug-21] Joe Biden and the Democrats are failing our country on just about every measure. Overseas, they're abandoning our allies and empowering our enemies. On the border, they're allowing historic failure month after month. On inflation, debt, and our federal budget, it's affecting our families and our family budgets. Enough is enough. Republicans need to retake the House in 2022 to put an END to this failure! Will you step up and join us? Every single donor counts, and every dollar counts! I can give $20 NOW [https://secure.winred.com/scott-fitzgerald-for-congress/aug-21?amount=20] I can give $25 NOW [https://secure.winred.com/scott-fitzgerald-for-congress/aug-21?amount=25] I can give $45 NOW [https://secure.winred.com/scott-fitzgerald-for-congress/aug-21?amount=45] They're coming for Wisconsin. We need to fight them and take back the majority. Join us – DONATE NOW. [https://secure.winred.com/scott-fitzgerald-for-congress/aug-21] Thank you, Congressman Scott Fitzgerald Paid for by Scott Fitzgerald for Congress P.O. Box 5048, Elm Grove, WI 53122 Preferences https://scottfitzgerald.updatemyprofile.com/t-cjrlyky-62D8F9CE-ahkdjtlkr-d | Unsubscribe https://scottfitzgerald.cmail20.com/t/t-u-cjrlyky-ahkdjtlkr-h/",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "President Biden",
            "Senator Rick Scott"
        ],
        "places": [],
        "organizations": [
            "NRSC",
            "Republican Senate"
        ],
        "products": [],
        "committee": "NRSC",
        "name": "Chairman Rick Scott",
        "email": "info@ourdefenseofamerica.com",
        "subject": "$30k more is all we need",
        "date": "2021-08-31T23:04:55Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "23",
        "minute": "4",
        "domain": "ourdefenseofamerica.com",
        "body": "NRSC Unlike President Biden, I know where the buck stops. When the Senatemajority is the question at hand, for Republicans, the buck stops with me. Wecan Fellow American, I know my team has been emailing you frequently duringthe month of August, and now with less than one day left until the end ofAugust fundraising period, I wanted to reach out to you myself. UnlikePresident Biden, I know where the buck stops. When the Senate majority is thequestion at hand, for Republicans, the buck stops with me. We cannot fail todeliver a Republican Senate majority next November. Democrats have proven timeand again – most recently last month – that they’re determined to keep theirmajority so they can continue tearing apart the country bit by bit. Of course,I don’t want to have to deal with the repercussions of failing to win the oneseat that it will take to flip the chamber RED and put Democrats back into theminority where they belong. But let me tell you this now: even flipping oneseat isn’t going to be an easy task . That’s why I’m asking you to help meensure that the Senate Republicans meet our August goal. As it stands thismorning, we’re just $30k short. EMERGENCY END-OF-MONTH DONATION REQUEST FORWe need you to chip-in $5 right now if you can. Help us save the country byflipping the senate CHIP-IN $5→ Every Republican Senator is counting on youto help us reach our August fundraising goal,so I implore you one last time toplease pitch in whatever you can. August has shown all of us that Democratssimply aren’t fit to govern. Now, help us give them the boot. Senator RickScott Chairman, NRSC If you want to help Republicans TAKE BACK THE SENATE,text WIN to 55404 to receive mobile alerts! Message and data rates may apply.Text \"STOP\" to opt-out. T&C;/Privacy Policy. Paid for by the NRSC. Notauthorized by any candidate or candidate's committee. www.NRSC.orgContributions to the NRSC are not deductible as charitable contributions forfederal income tax purposes. NRSC, 425 2nd Street NE, Washington D.C. 20002Don't want to receive any more of our emails? We hate to see you go, but youcan unsubscribe here .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Ron Johnson",
            "Alex"
        ],
        "places": [
            "Wisconsin",
            "Congress",
            "Milwaukee",
            "United States"
        ],
        "organizations": [
            "Lasry for Wisconsin"
        ],
        "products": [],
        "committee": "Lasry for Wisconsin",
        "name": "Alex Lasry",
        "email": "info@alexlasry.com",
        "subject": "midnight",
        "date": "2021-08-31T23:15:54Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "23",
        "minute": "15",
        "domain": "alexlasry.com",
        "body": "Peter, You’re getting a ton of emails from every campaign asking to make one last donation before the monthly deadline tonight, so thank you for opening my last request. In my campaign, I am fighting for the people of Wisconsin -- not the special interests. This isn’t politics as usual, my campaign is about bringing fresh ideas to Congress so that we can help Wisconsinites. For too long, we’ve been represented by a Senator by the name of Ron Johnson who refuses to do anything to help everyday Wisconsinites. His inaction and obsession with blocking any progress from happening in this country have hurt Wisconsin workers, and it’s time to stand up and fight back. We have the power to defeat Ron Johnson, and I’m running a competitive campaign that can and will win next November. But I need your help today before midnight tonight to help close the $2,994 gap in our monthly fundraising budget. I wouldn’t be asking if it weren’t crucial to our campaign’s success, so can I count on you to chip in before midnight tonight? You can use this link to give $5 or more: https://secure.actblue.com/donate/lasry_aug2021?refcode=EM_FR_210831FRPM_N_AL_90DA_5_NG_N_l1 Thank you, Alex -------------------------------------------- | Paid for by Lasry for Wisconsin | -------------------------------------------- Lasry for Wisconsin P.O. Box 511549 Milwaukee, WI 53203 United States If you believe you received this message in error or wish to no longer receive email from us, please unsubscribe: https://email.ngpvan.com/unsubscribeUnique/f870c5bd-9e0a-ec11-981f-501ac57ba3ed/aec52846-b10a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMjEvMS84ODcxMSIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICJhZWM1Mjg0Ni1iMTBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=YM6UTSKAVJm2EuLswxFneJYLshQ7pMVObOk0PchWvqE=&id;=121241229 .",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Wilmot Collins",
            "Helena"
        ],
        "places": [
            "Helena"
        ],
        "organizations": [
            "A Whole Lot of Folks for Wilmot Collins",
            "ActBlue"
        ],
        "products": [],
        "committee": "A Whole Lot of Folks for Wilmot Collins",
        "name": "Helena HQ",
        "email": "info@wilmotcollins.com",
        "subject": "19 people",
        "date": "2021-08-31T21:46:35Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "21",
        "minute": "46",
        "domain": "wilmotcollins.com",
        "body": "We wanted to follow up on the goal Wilmot and the team set yesterday. Wewanted to raise $3,500 by midnight, and we’re just $645 away from our goal!Team! We wanted to follow up on the goal Wilmot and the team set yesterday. Wewanted to raise $3,500 by midnight, and we’re just $645 away from our goal! Ifjust 19 more people step up with our average online donation of $35, we’llblow past this goal in a matter of minutes. But if everyone reading this says“someone else will step up”, we’re going to fall short. Will you chip in $35or whatever you can afford to give right now to help us get there!? Thanks! -Helena HQ --- Forwarded Message --- Folks, My campaign is powered bygrassroots strength. And there’s no greater testament to that than my averageonline contribution of just $35. So, my team and I are setting a goal to raise$3,500 by tomorrow night to take on my extremist opponent, which means if 100people step up with our average donation of just $35, we’ll be able to blow bythis goal and have the resources we need to make sure I can keep fighting forthe city I love! Will you help us reach this important goal by donating $35right now so I can keep working for YOU!? Chip in $35 → I understand thatyou work hard for your money, and if you’re simply unable to make a $35contribution right now, I would greatly appreciate a donation of any amount,even if it’s just $5. So what do you say? Will you help me keep building onthe incredible progress we’ve already made for the city of Helena by donatingwhatever you can afford to give towards tomorrow’s $3,500 goal? If you'vesaved your payment information with ActBlue Express, your donation will gothrough immediately: Donate $10 >> Donate $25 >> Donate $50 >> Donate $100>> Donate $150 >> Another Amount >> Thank you for being on this team,Wilmot Paid for by A Whole Lot of Folks for Wilmot Collins This email was sentto dpwillis67@gmail.com . Don't want to receive these emailsanymore?Unsubscribe Wilmot Collins, PO Box 458, Helena, MT 59624",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Mike Braun"
        ],
        "places": [],
        "organizations": [
            "Mike Braun for Indiana",
            "Mike Braun for Senate"
        ],
        "products": [],
        "committee": "Mike Braun for Indiana",
        "name": "Grace, Mike Braun Finance",
        "email": "mikeb@mikebraunsenate.com",
        "subject": "LESS THAN 24 HOURS",
        "date": "2021-08-31T19:40:07Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "19",
        "minute": "40",
        "domain": "mikebraunsenate.com",
        "body": "Mike Braun for Indiana Mike asked me to email you                                                                                                                   Hi friends, Mike knows thatyou have been a loyal patriot to him and our team in the past, so he wanted meto reach out. We have LESS THAN 24 hours until our END ON MONTH DEADLINE, andwe are WAY BEHIND. So, Mike is relying on his closest friends and donors tostep up. We have gone through our lists and personally handpicked Conservativeallies who we are confident will step up. MIKE IS COUNTING ON YOU! SHOW YOURPATRIOTISM THIS IS IT! We know you want to take down the RADICAL LEFT justas much as we do. They are getting more “woke” by the day! Thank you for allthat you do, Grace Deputy Finance Director Mike Braun for Senate Paid for byMike Braun for Indiana Don't want to receive our emails anymore? Unsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Joe Biden",
            "Donald Trump"
        ],
        "places": [],
        "organizations": [
            "DCCC",
            "House Republicans"
        ],
        "products": [],
        "committee": "DCCC",
        "name": "8-hour-deadline@dccc.org",
        "email": "dccc@dccc.org",
        "subject": "President Biden: We can’t afford a midterm “shellacking”",
        "date": "2021-08-31T21:36:22Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "21",
        "minute": "36",
        "domain": "dccc.org",
        "body": "DON’T delete this email. DON’T close your computer. DON’T give Republicans thesatisfaction! Because President Biden is calling grassroots Democratseverywhere to action ahead of our critical eight-hour End of Month Deadline:President Biden: We can't afford a midterm \"shellacking.\" CHIP IN NOW >>https://links.e.dccc.org/els/v2/LERqs2LAvDQ2/WTluaUpXYi9xQWRScElyUEVuMGxER2tlWlZBVXVrWnJtT2lxZ20rc3YxSGpVMFdCVGZzZDlaRmZsYlRWMkUwUXduSEQ3QlNkcW5iNllzckhjeERZaTFVZFpLQXBNVVc2ajA3bWhMOGR3ajNjRFZjWGxIVWFJQT09S0/eTkvdWE5a1dlVUtvNHJJTml1d3dyODdoU0RaeGRhVnlWZmFjMGpXakk2L21CKy9iRDZpTSsvZ1dwUHVodGxvSVBXRlE0VlZ6RDNTZ1JqWTMyNWxBRXpGdzUwMURYSGp1UUhobXpQNU1oYVpMK3dZM2M2b1I2QVE4TzB1cWVqUXNLTGdncEdQUENNSHMwOW9RQTNwQ0t3aXNYQzF4aDg4TwS2We can’t afford to let President Biden down. Not when House Republicans haveblocked his bold agenda at every turn. And not when Donald Trump has stakedhis return to the White House on the complete destruction of our HouseMajority. So before our midnight End of Month Deadline, can we count on you tochip in $5 to answer President Biden’s call and defend our House Majority?https://links.e.dccc.org/els/v2/NaPAfrGVDRSW/WTluaUpXYi9xQWRScElyUEVuMGxER2tlWlZBVXVrWnJtT2lxZ20rc3YxSGpVMFdCVGZzZDlaRmZsYlRWMkUwUXduSEQ3QlNkcW5iNllzckhjeERZaTFVZFpLQXBNVVc2ajA3bWhMOGR3ajNjRFZjWGxIVWFJQT09S0/eTkvdWE5a1dlVUtvNHJJTml1d3dyODdoU0RaeGRhVnlWZmFjMGpXakk2L21CKy9iRDZpTSsvZ1dwUHVodGxvSVBXRlE0VlZ6RDNTZ1JqWTMyNWxBRXpGdzUwMURYSGp1UUhobXpQNU1oYVpMK3dZM2M2b1I2QVE4TzB1cWVqUXNLTGdncEdQUENNSHMwOW9RQTNwQ0t3aXNYQzF4aDg4TwS2Thank you, DCCC This message was emailed to: dpwillis67@gmail.com Tounsubscribe from this email list, please paste this URL into your browser:http://action.dccc.org/page/s/dccc-e-mail-options?m=45547207&r;=MTI3NTcwMTg1MDQyNQS2&j;=MjA4MDAwNTk2MQS2&l;=13870087&e;=dpwillis67@gmail.comPaid for by the DCCC. 430 South Capitol Street, S.E. Washington, D.C. 20003(202) 478-9477 http://www.dccc.org Not authorized by any candidate orcandidate's committee. Contributions or gifts to the DCCC are not taxdeductible.",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Joe Kent",
            "Loren Culp",
            "Nancy Pelosi",
            "Donald Trump"
        ],
        "places": [
            "Washington",
            "Olympia",
            "Washington State",
            "Las Vegas",
            "NV"
        ],
        "organizations": [
            "Culp for Congress"
        ],
        "products": [],
        "committee": "Culp for Congress",
        "name": "Culp for Congress",
        "email": "info@culpforcongress.com",
        "subject": "Endorsement Alert",
        "date": "2021-08-31T21:53:07Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "21",
        "minute": "53",
        "domain": "culpforcongress.com",
        "body": "View online[https://app.getresponse.com/view.html?x=a62b&m;=BwQrOU&mc;=Jm&s;=Bttw6dS&u;=Q96gS&z;=EwmxhiL&][https://m.gr-cdn-5.com/getresponse-Q96gS/photos/834a9029-70b4-43da-83ce-4214bce52fb9.jpg]Joe Kent Endorses Loren Culp for Congress Loren Culp receives the endorsementof America First candidate Joe Kent. The endorsement reads: I am honored toendorse Loren Culp in Washington's 4th Congressional District. Loren Culp isan icon in Washington politics. After exploding onto the political scene in2018 by refusing to comply with Olympia's unconstitutional gun ban, hishistoric Gubernatorial run last year sparked a wave of conservative grassrootsactivism across the State of Washington and garnered more votes than anyRepublican Gubernatorial candidate in Washington State history. Mr. Culp'sopponent is an America Last RINO that voted to impeach President Trump, sidedwith Nancy Pelosi to form the January 6th Commission--a move that would targetAmerica First Patriots as extremists, authored a bill to facilitate amnesty,and currently has one of the lowest conservative ratings in Congress. Ibelieve together we can remove the America Last RINOs from Washingtonpolitics, save our Republic, and restore our nation's future. Please join mein supporting Loren Culp for Congress in Washington's 4th CongressionalDistrict. - Joe Kent [https://m.gr-cdn-5.com/getresponse-Q96gS/photos/89b227d1-e78f-47fb-a111-c12f7d80bdb6.jpg] IWILL STEP UP AND DO $50![https://app.getresponse.com/click.html?x=a62b&lc;=SKSCmr&mc;=Jm&s;=Bttw6dS&u;=Q96gS&z;=EJraCI7&]THIS IS IMPORTANT. I CAN DO $100![https://app.getresponse.com/click.html?x=a62b&lc;=SKSCPn&mc;=Jm&s;=Bttw6dS&u;=Q96gS&z;=Ez6DVLI&]I CAN PLAY BIG LEAGUE AND DO $250![https://app.getresponse.com/click.html?x=a62b&lc;=SKSC8H&mc;=Jm&s;=Bttw6dS&u;=Q96gS&z;=E9iWMsc&]PAID FOR BY CULP FOR CONGRESS , 11035 Lavender Hill Drive, Suite 160, Box 194,Las vegas, NV 89135, United States You may unsubscribe[https://app.getresponse.com/unsubscribe.html?x=a62b&m;=BwQrOU&mc;=Jm&s;=Bttw6dS&u;=Q96gS&z;=ECe2pX&pt;=unsubscribe]or change your contact details[https://app.getresponse.com/change_details.html?x=a62b&m;=BwQrOU&s;=Bttw6dS&u;=Q96gS&z;=EIZVJPy&pt;=change_details]at any time. Powered by:https://app.getresponse.com/referral.html?x=a62b&c;=RDxFI&u;=Q96gS&z;=EBe2SOj&",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Laura Loomer"
        ],
        "places": [],
        "organizations": [
            "Laura Loomer for Congress Inc",
            "Congress",
            "Senate",
            "House",
            "White House",
            "Democrat",
            "Labor unions",
            "Laura Loomer for Congress IncContributions",
            "Lake Worth",
            "FL"
        ],
        "products": [],
        "committee": "Laura Loomer for Congress Inc",
        "name": "Laura Loomer",
        "email": "victory@lauraloomerforcongress.com",
        "subject": "Will you do this by midnight?",
        "date": "2021-08-31T18:28:54Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "18",
        "minute": "28",
        "domain": "lauraloomerforcongress.com",
        "body": "Our August campaign fundraising deadline hits tonight at midnight!| | | ![Laura Loomer for Congress](https://eimagesrv.com/email/lfc/llfc-email-header22.png)  Patriot,  Our August campaign fundraising deadline hits tonight at midnight!  **Will you make a contribution before the clock strikes?**  ![](http://gen.sendtric.com/countdown/1dubsgkzj0)  | | DONATE $20 ---  | DONATE $50 ---  | DONATE $100 ---  | DONATE NOW ---  The last eight months have proven without a doubt that our nation has taken asharp dive since Democrats took control of the Senate, House and White House.  Do you want to turn things around?  Then we have to take back Congress and elect leaders who will DO SOMETHING!  I'm a few thousand dollars away from hitting my fundraising goal for August,**and every dollar you can donate will get me one step closer to my goal, andone step closer to Washington**.  **Donate $20, $50, $100 or more as soon as you can.**  The future depends on electing fighters to Congress before it's too late.  Thanks again for all that you do.  Respectfully,  ![](https://eimagesrv.com/email/lfc/Loomer-Sig.jpg) Laura Loomer    Paid for by Laura Loomer for Congress IncContributions to Laura Loomer for Congress Inc are not tax deductible forfederal income tax purposes. Contributions from corporations, labor unions,federal contractors, and foreign nationals are prohibited.  Laura Loomer for Congress Inc 720 Lucerne Ave, #1465 LAKE WORTH, FL. 33460 Unsubscribe Web Version  --- ![](https://libersend.lauraloomerforcongress.com/t/Kzx1isXhdxtctRiY2PrPew/jaHkxHkvgw3mMH3vyc0Hsw)",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [],
        "places": [
            "Olympia",
            "Washington DC",
            "Las Vegas",
            "NV",
            "United States"
        ],
        "organizations": [
            "CULP FOR CONGRESS"
        ],
        "products": [],
        "committee": "CULP FOR CONGRESS",
        "name": "Culp for Congress",
        "email": "info@culpforcongress.com",
        "subject": "Almost there...",
        "date": "2021-08-31T18:51:38Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "18",
        "minute": "51",
        "domain": "culpforcongress.com",
        "body": "View online[https://app.getresponse.com/view.html?x=a62b&m;=BwQhRp&mc;=Jj&s;=Bttw6dS&u;=Q96gS&z;=EBohhJM&][https://m.gr-cdn-5.com/getresponse-Q96gS/photos/373f3086-3d2b-4d5c-81c6-fe2e9dafe423.png]You never let me down--not even once... ...and I just wanted to stop and saythank you.Thank you for standing up against the left and the RINOs who partnerwith them to destroy our nation. Thank you for joining me in the streets toprotest against the radical policies in Olympia and Washington DC. Thank youfor standing tall to be seen and making your voice heard. And your voices AREbeing heard. CLEARLY. Our opponents in this race are freaking out over howmuch support we have on the ground. One of them even tried to come over to mybooth and crash my event--and it backfired on him. This month our campaignworked on three major events across the 4th Congressional District over 10days and we heard from HUNDREDSof voters who supported us in the past andsupport us now as we move forward to take out the RINO Dan Newhouse.[https://m.gr-cdn-5.com/getresponse-Q96gS/photos/b7a04470-f6f7-4793-aa3c-1dfe9b6f4210.jpg]Today is the last day of August reporting and we need to keep up the momentumas we head into the final month of the reporting quarter. One of my opponentsgave himself $251,000 because he doesn't have any support from voters.Anotheropponent has been crisscrossing the country pulling in money from specialinterests, donors with deep pockets, and corporations that own his seat inCongress. We are on track to have a strong 3rd quarter, but I need to closeout August strong to put us in a good position heading into September. We areabout $5,200 short of our target--which is easily doable with your help.If twodonors gave the max contribution of $2,900 we'd be there. Or 10 folkscontributing $500. I understand not everyone has that type of money tocontribute and I am honored by ANY contribution you can make. Together we canreach our goal if everyone does their part according to their resources. Iappreciate you all more than you know. OUR DEADLINE IS TONIGHT AT 11:59 PMPST!!! Can I count on you?[https://app.getresponse.com/click.html?x=a62b&lc;=SKBOsU&mc;=Jj&s;=Bttw6dS&u;=Q96gS&z;=EhQZS9z&]Loren PS: Don't be surprised if I give you a phone call and thank youpersonally for your contribution! I WILL STEP UP AND DO $50![https://app.getresponse.com/click.html?x=a62b&lc;=SKBObJ&mc;=Jj&s;=Bttw6dS&u;=Q96gS&z;=EQtAyTE&]THIS IS IMPORTANT. I CAN DO $100![https://app.getresponse.com/click.html?x=a62b&lc;=SKBO37&mc;=Jj&s;=Bttw6dS&u;=Q96gS&z;=EtMSylp&]I CAN PLAY BIG LEAGUE AND DO $250![https://app.getresponse.com/click.html?x=a62b&lc;=SKBO7Z&mc;=Jj&s;=Bttw6dS&u;=Q96gS&z;=EwFeBUA&]I WANT TO BE ON CULP'S ADVISORY TEAM AND DO $2,900![https://app.getresponse.com/click.html?x=a62b&lc;=SKBOqz&mc;=Jj&s;=Bttw6dS&u;=Q96gS&z;=ESFLy2M&]PAID FOR BY CULP FOR CONGRESS , 11035 Lavender Hill Drive, Suite 160, Box 194,Las vegas, NV 89135, United States You may unsubscribe[https://app.getresponse.com/unsubscribe.html?x=a62b&m;=BwQhRp&mc;=Jj&s;=Bttw6dS&u;=Q96gS&z;=EGIZVSH&pt;=unsubscribe]or change your contact details[https://app.getresponse.com/change_details.html?x=a62b&m;=BwQhRp&s;=Bttw6dS&u;=Q96gS&z;=EQJstZn&pt;=change_details]at any time. Powered by:https://app.getresponse.com/referral.html?x=a62b&c;=RDxFI&u;=Q96gS&z;=EMphCMe&",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Larry Elder",
            "Peter",
            "Tony Cárdenas"
        ],
        "places": [
            "California"
        ],
        "organizations": [
            "GOP",
            "ActBlue",
            "Tony Cárdenas For Congress"
        ],
        "products": [],
        "committee": "Tony Cárdenas For Congress",
        "name": "stop the recall (via campaign@tonycardenas.com)",
        "email": "campaign@tonycardenas.com",
        "subject": "Larry Elder is unfit for California",
        "date": "2021-08-31T21:45:50Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "21",
        "minute": "45",
        "domain": "tonycardenas.com",
        "body": "LOOK WHAT GOP FRONTRUNNER LARRY ELDER ADMITTED: Larry Elder: 'I don't have thetemperament or drive to be Governor of California'https://secure.actblue.com/donate/mc_cardenas_q32021_df-newsom[https://secure.actblue.com/donate/mc_cardenas_q32021_df-newsom] For the firsttime EVER, Peter, we AGREE with Larry Elder. Larry Elder would be an AWFULgovernor whose delusional policies would RUIN California. Peter, if we want tomake sure this man is NEVER near our government, we cannot falter in thispivotal moment. Please financially support our operation to prevent the GOP’sMAGA California takeover. We’re counting on 897 Democrats to step up bymidnight » [https://secure.actblue.com/donate/mc_cardenas_q32021_df-newsom][https://secure.actblue.com/donate/mc_cardenas_q32021_df-newsom] Team Cárdenas------------------------ Paid for by Tony Cárdenas For Congress P.O. Box15320, Washington, DC 20003 www.tonycardenas.com Click here to request feweremails: https://secure.ngpvan.com/JfkqRwf8bEiYRTiNHpoChQ2 Click here to updateyour information: https://secure.ngpvan.com/qu5wjQhJLkW0z-8W5Stv3A2 Click hereto unsubscribe:https://email.ngpvan.com/unsubscribeUnique/d4983e86-8f0a-ec11-981f-501ac57ba3ed/b169d2b5-a40a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMjEvMS84OTE2MSIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICJiMTY5ZDJiNS1hNDBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=SP0vY5ogorz6MAHcedptBCr6tOEd1QZBpEMWryEvQ7k=&id;=122585698.",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Nancy Pelosi",
            "Mitch McConnell",
            "Kevin McCarthy"
        ],
        "places": [
            "Washington, DC"
        ],
        "organizations": [
            "Nancy Pelosi for Congress",
            "U.S. House of Representatives"
        ],
        "products": [],
        "committee": "Nancy Pelosi for Congress",
        "name": "Nancy Pelosi",
        "email": "info@pelosiforcongress.org",
        "subject": "please",
        "date": "2021-08-31T19:04:43Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "19",
        "minute": "4",
        "domain": "pelosiforcongress.org",
        "body": "I can't overstate the importance: I only need 2 more Democrats from 18326 topitch in before midnight to OUTRAISE Republicans before my End of MonthDeadline. Will you be the gift that puts me over the top? >>[https://secure.actblue.com/donate/npem2021?refcode=20210831_em_fr_b1_pelosi_30_rs&amount;=15]I need you in these final hours. -- We can either let Republicans break theirFIFTH fundraising record in a row. -- Or we can rise up, close this last gap,and hand them an embarrassing defeat before the End of Month Deadline.[https://secure.actblue.com/donate/npem2021?refcode=20210831_em_fr_b1_pelosi_30_rs&amount;=15]I only need 2 more Democrats from 18326 to step up before tonight’s End ofMonth deadline. I’m asking: Can I count on your kind $15 before midnight? >>[https://secure.actblue.com/donate/npem2021?refcode=20210831_em_fr_b1_pelosi_30_rs&amount;=15]Chip in $5 >>[https://secure.actblue.com/donate/npem2021?refcode=20210831_em_fr_b1_pelosi_30_rs&amount;=5]Chip in $15 >>[https://secure.actblue.com/donate/npem2021?refcode=20210831_em_fr_b1_pelosi_30_rs&amount;=15]Chip in $25 >>[https://secure.actblue.com/donate/npem2021?refcode=20210831_em_fr_b1_pelosi_30_rs&amount;=25]Chip in $100 >>[https://secure.actblue.com/donate/npem2021?refcode=20210831_em_fr_b1_pelosi_30_rs&amount;=100]Chip in another amount now >>[https://secure.actblue.com/donate/npem2021?refcode=20210831_em_fr_b1_pelosi_30_rs&amount;=25]Thank you, Nancy Nancy Pelosi is the Speaker of the U.S. House ofRepresentatives. As the top Democrat in the House, she's fighting to helpworking families and protect America from the dangerous agenda of MitchMcConnell and Kevin McCarthy. We know you're getting a lot of emails -- butit's only because what we're facing right now as a country is so important.Nancy is committed to doing whatever it takes to elect a record-breakingnumber of Democrats in the next election and beyond. Can we count on yoursupport? DONATE[https://secure.actblue.com/donate/npem2021?refcode=footer&amount;=25] SHOP[https://store.pelosiforcongress.org/] Nancy isn't one to back down from afight, and we're in this for the long haul. We'd hate to see you leave ourmovement completely, but if you must, please click unsubscribe:https://email.ngpvan.com/unsubscribeUnique/690814d7-5207-ec11-981f-501ac57ba3ed/b5977da7-8d0a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQNDIvMS84ODQ2NiIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICJiNTk3N2RhNy04ZDBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=h2VgxfiGD4mMVZssre2k8CSuq_6zjInDNqwC6tGJl8o=&id;=117907000. Nancy Pelosi for Congress 700 13TH STREET NW Suite 800 Washington, DC 20005United States Paid for by Nancy Pelosi for Congress",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Charlie Crist",
            "Ron DeSantis"
        ],
        "places": [
            "Florida"
        ],
        "organizations": [
            "Ron Be Gone",
            "ActBlue Express"
        ],
        "products": [],
        "committee": "Ron Be Gone, Inc.",
        "name": "Charlie Crist",
        "email": "info@e.ronbegone.com",
        "subject": "Let’s replace DeSantis with a Democrat",
        "date": "2021-08-31T18:12:04Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "18",
        "minute": "12",
        "domain": "e.ronbegone.com",
        "body": "A Message From Rep. Charlie Crist (https://act.ronbegone.com/go/2322?t=1002&akid;=482%2E564421%2EyeH4Qc ) HeyTeam, Everytime I reach out to you, things seem to deteriorate further here inFlorida. In his latest affront, MAGA Gov. DeSantis has threatened to withholdthe salaries of our brave and wonderful educators for daring to try and savethe lives of Florida students. DeSantis is an immediate and direct threat toour safety, health, and welfare. That’s why I’m running to replace DeSantis.Will you help? Split a $10 donation between my campaign and the Ron Be Goneteam now? We're trying to raise $10,500 today. » (https://act.ronbegone.com/go/2323?t=1003&akid;=482%2E564421%2EyeH4Qc ) Ifyou've saved your payment information with ActBlue Express, your donation willgo through immediately: $10 » (https://act.ronbegone.com/go/2324?t=1004&akid;=482%2E564421%2EyeH4Qc ) $25 » (https://act.ronbegone.com/go/2325?t=1005&akid;=482%2E564421%2EyeH4Qc ) $50 » (https://act.ronbegone.com/go/2326?t=1006&akid;=482%2E564421%2EyeH4Qc ) $100 »( https://act.ronbegone.com/go/2327?t=1007&akid;=482%2E564421%2EyeH4Qc ) $250» ( https://act.ronbegone.com/go/2328?t=1008&akid;=482%2E564421%2EyeH4Qc )Custom » (https://act.ronbegone.com/go/2329?t=1009&akid;=482%2E564421%2EyeH4Qc ) Team,with a Democrat like me in the Governor’s Mansion, we can turn Florida around.I’ll always put science and fact-based solutions FIRST instead of spreadingdivision and conspiracy theories. I’ll take the climate change threatseriously and take real action instead of twiddling my thumbs. I’ll ensure ALLFloridians are heard and taken care of instead of furthering hatred andignoring marginalized communities. The good news is, we’re not far off. Pollsshow we’re within striking distance of overtaking Ron DeSantis — the latestpolls even show me BEATING DeSantis! Team, can I count on you to be thedifference between winning and losing? Split a $10 donation between mycampaign and Ron Be Gone now, so that we can reach more Florida voterstogether! » (https://act.ronbegone.com/go/2323?t=1010&akid;=482%2E564421%2EyeH4Qc ) Ifyou've saved your payment information with ActBlue Express, your donation willgo through immediately: CHIP IN $10 » (https://act.ronbegone.com/go/2324?t=1011&akid;=482%2E564421%2EyeH4Qc ) CHIP IN$25 » ( https://act.ronbegone.com/go/2325?t=1012&akid;=482%2E564421%2EyeH4Qc )CHIP IN $50 » (https://act.ronbegone.com/go/2326?t=1013&akid;=482%2E564421%2EyeH4Qc ) CHIP IN$100 » ( https://act.ronbegone.com/go/2327?t=1014&akid;=482%2E564421%2EyeH4Qc) CHIP IN ANY DONATION » (https://act.ronbegone.com/go/2329?t=1015&akid;=482%2E564421%2EyeH4Qc ) Team,thank you so much. Your friend, Charlie Crist Democratic Candidate forGovernor of Florida P.S. The work Ron Be Gone is doing is critical -- they'resolely focused on defeating Ron DeSantis with powerful ads, billboards, andvoter registration. I’m standing with them and I hope you will too. Rush $10if you can! » (https://act.ronbegone.com/go/2323?t=1016&akid;=482%2E564421%2EyeH4Qc )------------------ Paid for by Ron Be Gone, Inc. www.ronbegone.com Notauthorized by any candidate or candidate's committee. P.O. Box 30295, FortLauderdale, FL 33303 Click here to request fewer emails:https://act.ronbegone.com/signup/fewer-emails/?t=1001&akid;=482%2E564421%2EyeH4Qc Click here to unsubscribe:https://act.ronbegone.com/unsubscribe/unsubscribe/?akid=482%2E564421%2EyeH4Qc",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "John Fetterman",
            "Joe Biden",
            "Mitch McConnell",
            "Joe Manchin",
            "Kyrsten Sinema",
            "Peter"
        ],
        "places": [
            "Pennsylvania"
        ],
        "organizations": [
            "Fetterman for PA",
            "Democratic"
        ],
        "products": [],
        "committee": "Fetterman for PA",
        "name": "John Fetterman",
        "email": "info@e.johnfetterman.com",
        "subject": "I can *guarantee* you I will NOT be a Joe Manchin or Kyrsten Sinema-type senator",
        "date": "2021-08-31T19:33:32Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "19",
        "minute": "33",
        "domain": "e.johnfetterman.com",
        "body": "[2]John Fetterman I hate to sound alarmist, Peter,but I need to be totally honest with yinz: Flipping this seat blue + defendingour slim Democratic majority will mean EVERYTHING in 2022. Our success willdetermine if we can deliver on Joe Biden's agenda for working families — or ifMitch McConnell will regain his stranglehold on the Senate and block anyprogress for working people and their families. I *swear* I'm not saying thisto scare you. But this is how high the stakes are. It's why I joined this raceto represent PA in the Senate and gain that 51st vote that will unlock so muchprogress in our country. It's also why my campaign and I set a criticallyimportant goal to raise another $84,172 directly into the Flip PennsylvaniaFund before the month ends. [https://act.johnfetterman.com/go/28777?refcode=em20210831-2465&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1001&akid;=2465%2E434096%2E-wD5Fb]Flip PA Fund: 91% to Goal As of now, we're still not where we need to be. Andaccording to the records we have on file for you, Peter, you have yet to makeyour first contribution to our campaign. That's why, with just a few hoursleft to close this pretty sizable gap on our goal, I've just got to ask you: [https://act.johnfetterman.com/go/28777?refcode=em20210831-2465&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1002&akid;=2465%2E434096%2E-wD5Fb]Will you donate your first-ever $5 to the Flip Pennsylvania Fund beforetonight's deadline? This special fund is all about building the strong, honest+ inclusive campaign we'll need to flip this Senate seat in 2022. [https://act.johnfetterman.com/go/28777?refcode=em20210831-2465&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1021&akid;=2465%2E434096%2E-wD5Fb]Contribute $5 I know I may joke around sometimes, but I take public serviceincredibly seriously. I believe it's a solemn responsibility to serve thepeople + families who built this country. But right now, Republicans — andeven a few Democrats — are failing to deliver on that promise. If you trust mewith your support today, I can offer you this: I will fight relentlessly toflip this seat in 2022. And when we pull it off, I guarantee you I will NOT bea Joe Manchin or Kyrsten Sinema-type senator. Instead, I would proudly castthat 51st vote Democrats need in the Senate to pass common-sense legislationand deliver President Biden’s agenda to the American people. 💪 [https://act.johnfetterman.com/go/28777?refcode=em20210831-2465&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1022&akid;=2465%2E434096%2E-wD5Fb]But we can't get there without your initial support, Peter. Will you pleasedonate your first $5 or more right now to help reach our goal for the FlipPennsylvania Fund before it's too late? [https://act.johnfetterman.com/go/28777?refcode=em20210831-2465&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1041&akid;=2465%2E434096%2E-wD5Fb]Contribute $5 Thank you for all you do, John John Fetterman LieutenantGovernor of Pennsylvania P.S. We're about 91% of the way to our urgent goalfor the Flip Pennsylvania Fund — and coming up short this month would make itthat much easier for Republicans to hold this seat and obstruct our Democraticpolicies. [https://act.johnfetterman.com/go/28777?refcode=em20210831-2465&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1042&akid;=2465%2E434096%2E-wD5Fb]If you're with me, will you chip in anything you can before midnight tonightto help close the gap on our goal? Thank you in advance for your support. Thisemail was sent to dpwillis67@gmail.com. Email is the most important way for usto reach you about opportunities to get involved. If you need to removeyourself from our email list, click here to unsubscribe:https://act.johnfetterman.com/unsubscribe/unsubscribe?t=1043&akid;=2465%2E434096%2E-wD5FbPaid for by Fetterman for PA.",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Lillie Catlin",
            "Biden"
        ],
        "places": [],
        "organizations": [
            "NextGen",
            "Congress",
            "NextGen America",
            "NextGen Climate Action Committee"
        ],
        "products": [],
        "committee": "NextGen Climate Action Committee",
        "name": "Lillie Catlin",
        "email": "feedback@nextgenamerica.org",
        "subject": "Help us drive voter turnout!",
        "date": "2021-08-31T16:01:08Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "16",
        "minute": "1",
        "domain": "nextgenamerica.org",
        "body": "Team — we’re less than a month away from National Voter Registration Day, and we need your help. Since 2013, NextGen has registered more than 1.4 million young voters. In 2020, those young voters made the difference in electing President Biden and the Democratic majority in Congress. In honor of National Voter Registration Day on September 28, we’re setting a goal of receiving 75 grassroots donations to elect progressive leaders who will prioritize the needs of young voters and drive up voter turnout in key battleground states. Will you stand with us in the fight for youth representation and help us surpass our goal of 75 grassroots donations this month by donating $25, $50, or whatever you can afford today? DONATE TODAY! https://secure.actblue.com/donate/nga-nvrd-em?refcode=em_fr_210831NVRD_n_ng_90do_6_ng_testa_pt Our future depends on the voices of young voters and action from leaders who will prioritize progressive policies to: -Protect the environment. -End the burden of student debt. -Ensure a more equitable future for all of us. Donate whatever you can today to help us reach our goal of 75 grassroots donations this month and help elect the progressive leaders we need. Thank you, Lillie Catlin Vice President, Programs NextGen America ---------------------- NextGen America 268 Bush St. #2919 San Francisco CA 94104-3503 This email was sent to dpwillis67@gmail.com | unsubscribe: https://email.everyaction.com/unsubscribeUnique/81fdefde-d209-ec11-981f-501ac57ba3ed/bc169b85-740a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9UU00vVFNNTkcvMS81NjE1OSIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICJiYzE2OWI4NS03NDBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=5EpKEjlqvHF_jZluITHEL6sAyOJ9RYVi_Z_Ho_Iswf0=&id;=109799863 Paid for by NextGen Climate Action Committee; https://nextgenamerica.org; not authorized by any candidate or candidate's committee.",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Stephanie Murphy",
            "Nancy Pelosi",
            "Kevin McCarthy",
            "Donald Trump"
        ],
        "places": [
            "Florida",
            "Winter Park",
            "United States"
        ],
        "organizations": [
            "House of Representatives",
            "Congress",
            "Stephanie Murphy for Congress"
        ],
        "products": [],
        "committee": "Stephanie Murphy for Congress",
        "name": "Team Murphy",
        "email": "info@stephaniemurphyforcongress.com",
        "subject": "This doesn’t look good, friend",
        "date": "2021-08-31T15:31:10Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "15",
        "minute": "31",
        "domain": "stephaniemurphyforcongress.com",
        "body": "Hey friend, We just took a look at our numbers from over the weekend and, tobe completely honest, they’re not great. If something doesn’t change rightnow, we’re definitely going to fall short of our end-of-month fundraisinggoal. We really need your help -- will you rush a quick contribution now tohelp reelect Stephanie? >>> https://secure.actblue.com/donate/murphy-midnight?refcode=ris_20210830_E_F_US_NA_NA_8B&amount;=10 This is exactly thewrong time to be falling behind. Republicans have been trying to take downStephanie ever since she flipped this seat back in 2016. Since the maps arebeing redrawn this year, they’re convinced that 2022 is finally their chanceto do it. We can’t let that happen. With such a slim majority in the House ofRepresentatives, it’s no exaggeration to say that whether or not we reelectStephanie could mean the difference between Speaker Nancy Pelosi and SpeakerKevin McCarthy (or worse -- Speaker Donald Trump!). With stakes this high, wecan’t afford to have our fundraising slow down. So please, give whatever youcan now to help us keep Stephanie in Congress. >>>https://secure.actblue.com/donate/murphy-midnight?refcode=ris_20210830_E_F_US_NA_NA_8B&amount;=10 We’re counting onyou! -- Team Murphy DONATE >>> https://secure.actblue.com/donate/murphy-midnight?refcode=ris_20210830_E_F_US_NA_NA_8B&amount;=10 ---- Paid for byStephanie Murphy for Congress Stephanie Murphy for Congress PO Box 205 WinterPark, FL 32790 United States We believe that emails are a crucial way for ourcampaign to stay in touch with supporters like you. However, if you'd justlike to receive fewer emails, you can click here. Your grassroots support iscritical to helping Stephanie become a strong voice for all of Florida. Ifyou'd still like to unsubscribe from our emails, go to: unsubscribe:https://email.ngpvan.com/unsubscribeUnique/7d37d893-c809-ec11-981f-501ac57ba3ed/448b2a4f-700a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMjEvMS84ODk3MiIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICI0NDhiMmE0Zi03MDBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=GywPPtBXlTNm0V_XRJvyX2DN8rZ7Yzb2GKnaI9DGGBU=&id;=123047019.",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Maggie Hassan",
            "Mike Pence",
            "Betsy DeVos",
            "Trump"
        ],
        "places": [
            "New Hampshire",
            "Granite State",
            "Saint Anselm College"
        ],
        "organizations": [
            "ActBlue",
            "Maggie for NH",
            "GOP"
        ],
        "products": [],
        "committee": "Maggie for NH",
        "name": "Maggie Hassan",
        "email": "info@maggiehassan.com",
        "subject": "A brand new poll shows me down by single digits",
        "date": "2021-08-31T23:55:02Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "23",
        "minute": "55",
        "domain": "maggiehassan.com",
        "body": "Sorry for the late email team, but this couldn’t wait. Saint Anselm Collegejust released a poll showing me down by single digits. With just hours leftbefore our August fundraising deadline, I need your help to close the gap.Mike Pence and the Trump network have already started campaigning in NewHampshire. Just today, Trump's former Secretary of Education, Betsy DeVos,visited the Granite State to rally the GOP's far-right base. With control ofthe Senate hinging on my seat, this is going to be the most expensive andconsequential race of the cycle. In 2016, I won by only 1,017 votes, making itthe closest in the country, so coming up even a dollar short could cost usthis race -- and the Senate majority. I need your help: Please rush $5 or asmuch as you can to help us hit our goal. Anything helps and I promise Iwouldn’t ask if it weren’t important. [https://secure.actblue.com/donate/mwh-em-aug21?refcode=e20210831_mwh-midnight&amounts;=5,25,50,100,250] If you'vesaved your payment information with ActBlue Express, your donation will gothrough immediately: Contribute $5[https://secure.actblue.com/donate/mwh-em-aug21?refcode=e20210831_mwh-midnight&amounts;=5,25,50,100,250] Contribute$25[https://secure.actblue.com/donate/mwh-em-aug21?refcode=e20210831_mwh-midnight&amounts;=5,25,50,100,250] Contribute$50[https://secure.actblue.com/donate/mwh-em-aug21?refcode=e20210831_mwh-midnight&amounts;=5,25,50,100,250] Another amount[https://secure.actblue.com/donate/mwh-em-aug21?refcode=e20210831_mwh-midnight&amounts;=5,25,50,100,250] Thank you so much. With every good wish, –Maggie Hassan ––––––––––––––––––––––––––––––––––––––––––––––––––– This emailwas sent to dpwillis67@gmail.com. unsubscribe:https://email.ngpvan.com/unsubscribeUnique/86ae0a36-9b0a-ec11-981f-501ac57ba3ed/b60a4570-b60a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQNDAvMS84ODg1OCIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICJiNjBhNDU3MC1iNjBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=cqKuF_IKfSb8C7SoAq8wDJCCF_cnwnaRq8S8o2LFa5I=&id;=107963931Maggie for NH PO Box 298 Concord, NH 03302 United States To receive feweremails, click here https://secure.ngpvan.com/8cYQZbLOE06eYQYJmhDy4g2Contributions or gifts to Maggie for NH are not tax deductible. Paid for byMaggie for NH",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Greg Abbott",
            "Peter"
        ],
        "places": [
            "Texas",
            "Austin"
        ],
        "organizations": [
            "Texans for Greg Abbott"
        ],
        "products": [],
        "committee": "Texans for Greg Abbott",
        "name": "Greg Abbott",
        "email": "info@bestamericanow.com",
        "subject": "Our deadline is TODAY",
        "date": "2021-08-31T22:02:53Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "22",
        "minute": "2",
        "domain": "bestamericanow.com",
        "body": "Our end-of-month deadline is just HOURS away, and we MUST reach our goal inorder to ensure we have the resources we NEED to fight back against theradical left.                                                                                                                                                         Peter, I need you to know how IMPORTANT today is. Our end-of-month deadline is just HOURS away, and we MUST reach our goal in order toensure we have the resources we NEED to fight back against the radical left.The truth is, this race could decide the future of Texas for YEARS to come,Peter,which is why it’s so important we meet MILESTONE fundraising goals likeTHIS one. With your help, I KNOW we can do it. All you have to do iscontribute by 11:59 PM TONIGHT, Peter. EXPRESS DONATE NOW The clock isticking, Peter. Your support is URGENTLY needed, so please, don’t wait to act.EXPRESS DONATE NOW Thank you, Governor Greg Abbott POLITICAL AD PAID FOR BYTEXANS FOR GREG ABBOTT PO BOX 308, AUSTIN, TEXAS 78767 This message reflectsthe opinions and representations of Texans for Greg Abbott. You are receivingthis email because you signed up as a member of Texans for Greg Abbott'sonline community. By providing your cell phone or mobile phone number you areconsenting to receive calls and texts, including autodialed and automatedcalls and texts, to that number with campaign notifications from Texans forGreg Abbott. Team Abbott is happy to help at 1-512-477-2002. Reply HELP forhelp, STOP to end. Message frequency may vary. Msg&DataRatesMayApply.; Messagefrequency may vary. Terms and Conditions/Privacy PolicyHERE . Don't want toreceive any more of our emails?Click here to unsubscribe .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Jay Inslee"
        ],
        "places": [
            "Louisiana",
            "New Orleans",
            "Washington"
        ],
        "organizations": [
            "UN",
            "JAY INSLEE FOR WASHINGTON (D)",
            "ActBlue"
        ],
        "products": [],
        "committee": "JAY INSLEE FOR WASHINGTON (D)",
        "name": "Jay Inslee",
        "email": "hello@jayinslee.com",
        "subject": "In just a few hours",
        "date": "2021-08-31T18:21:13Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "18",
        "minute": "21",
        "domain": "jayinslee.com",
        "body": "Friend, In just a few hours, we'll be closing the books on our Augustfundraising. It's been quite a month for our climate: This weekend, HurricaneIda made landfall in Louisiana, devastating huge swaths of the state,including New Orleans. We just lived through the hottest summer on record. Andthe UN just released a report on the state of the climate crisis, calling it\"code red for humanity.\" If you've been thinking about investing in climateaction, now is a great time to do it. Will you chip in $5 or another amountbefore midnight so we can finish the month strong? If you've saved yourpayment information with ActBlue Express, your donation will go throughimmediately:https://links.e.jayinslee.com/els/v2/-YkqHq3EYgMm/U2dlMkhQWVFQekdSeERmTTlBU2NPR3lZZThEaWpFbkJlRnBsbW5MSmdJTnBEc08rczQwWjgxbkRSWUF5eUwrZHFQclJSa3piak5EWVV5ZlRuZ2s5SmVtWWdGaE9BMDZNQytUVlV1bTgyOE09S0/akQyTzE1dFZNek8vZDM2N2tFZ1VUMTlhYlVTd05na3plSHhoYVpRMkFYMD0S1This legislative session, we passed the Climate Commitment Act and otherhistoric laws to bring down emissions and reverse the course of this crisis.I'm proud that Washington state is serving as a model for the rest of the U.S.on what bold climate action looks like. As a supporter of this movement, youshould be proud, too. But there's so much more urgent work to do, and ourability to do it swiftly and decisively is only as strong as the movementbehind us. So with our official deadline just hours away, I'm humbly asking:Will you chip in $5 before midnight to invest in the next phase of climateaction? As always, thank you for staying committed to the fight for our sharedfuture. I couldn't do this without you. Very truly yours, Jay DONATE:https://links.e.jayinslee.com/els/v2/-YkqHq3EYgMm/U2dlMkhQWVFQekdSeERmTTlBU2NPR3lZZThEaWpFbkJlRnBsbW5MSmdJTnBEc08rczQwWjgxbkRSWUF5eUwrZHFQclJSa3piak5EWVV5ZlRuZ2s5SmVtWWdGaE9BMDZNQytUVlV1bTgyOE09S0/akQyTzE1dFZNek8vZDM2N2tFZ1VUMTlhYlVTd05na3plSHhoYVpRMkFYMD0S1This email was sent to dpwillis67@gmail.com. Click here to unsubscribe:https://links.e.jayinslee.com/els/v2/yr7KJRxV39hZ/U2dlMkhQWVFQekdSeERmTTlBU2NPR3lZZThEaWpFbkJlRnBsbW5MSmdJTnBEc08rczQwWjgxbkRSWUF5eUwrZHFQclJSa3piak5EWVV5ZlRuZ2s5SmVtWWdGaE9BMDZNQytUVlV1bTgyOE09S0/akQyTzE1dFZNek8vZDM2N2tFZ1VUMTlhYlVTd05na3plSHhoYVpRMkFYMD0S1Contributions or gifts to JAY INSLEE FOR WASHINGTON (D) are not taxdeductible. All content (c) 2021 JAY INSLEE FOR WASHINGTON (D), All RightsReserved Privacy Policy:https://links.e.jayinslee.com/els/v2/78V3hwE27Gs8/U2dlMkhQWVFQekdSeERmTTlBU2NPR3lZZThEaWpFbkJlRnBsbW5MSmdJTnBEc08rczQwWjgxbkRSWUF5eUwrZHFQclJSa3piak5EWVV5ZlRuZ2s5SmVtWWdGaE9BMDZNQytUVlV1bTgyOE09S0/akQyTzE1dFZNek8vZDM2N2tFZ1VUMTlhYlVTd05na3plSHhoYVpRMkFYMD0S1PAID FOR BY JAY INSLEE FOR WASHINGTON (D) PO BOX 21067 SEATTLE, WA 98111",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Biden",
            "Rick Scott"
        ],
        "places": [],
        "organizations": [
            "NRSC",
            "Senate",
            "Republican Senate"
        ],
        "products": [],
        "committee": "NRSC",
        "name": "Chairman Rick Scott",
        "email": "info@makingamericathegreatest.com",
        "subject": "We’ve got one day to raise $30k",
        "date": "2021-08-31T20:31:56Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "20",
        "minute": "31",
        "domain": "makingamericathegreatest.com",
        "body": "NRSC Unlike President Biden, I know where the buck stops. When the Senatemajority is the question at hand, for Republicans, the buck stops with me. Wecan Fellow American, I know my team has been emailing you frequently duringthe month of August, and now with less than one day left until the end ofAugust fundraising period, I wanted to reach out to you myself. UnlikePresident Biden, I know where the buck stops. When the Senate majority is thequestion at hand, for Republicans, the buck stops with me. We cannot fail todeliver a Republican Senate majority next November. Democrats have proven timeand again – most recently last month – that they’re determined to keep theirmajority so they can continue tearing apart the country bit by bit. Of course,I don’t want to have to deal with the repercussions of failing to win the oneseat that it will take to flip the chamber RED and put Democrats back into theminority where they belong. But let me tell you this now: even flipping oneseat isn’t going to be an easy task . That’s why I’m asking you to help meensure that the Senate Republicans meet our August goal. As it stands thismorning, we’re just $30k short. EMERGENCY END-OF-MONTH DONATION REQUEST FORWe need you to chip-in $5 right now if you can. Help us save the country byflipping the senate CHIP-IN $5→ Every Republican Senator is counting on youto help us reach our August fundraising goal,so I implore you one last time toplease pitch in whatever you can. August has shown all of us that Democratssimply aren’t fit to govern. Now, help us give them the boot. Senator RickScott Chairman, NRSC If you want to help Republicans TAKE BACK THE SENATE,text WIN to 55404 to receive mobile alerts! Message and data rates may apply.Text \"STOP\" to opt-out. T&C;/Privacy Policy. Paid for by the NRSC. Notauthorized by any candidate or candidate's committee. www.NRSC.orgContributions to the NRSC are not deductible as charitable contributions forfederal income tax purposes. NRSC, 425 2nd Street NE, Washington D.C. 20002Don't want to receive any more of our emails? We hate to see you go, but youcan unsubscribe here .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Mark Herring"
        ],
        "places": [
            "Virginia",
            "Richmond"
        ],
        "organizations": [
            "One Commonwealth PAC",
            "ActBlue"
        ],
        "products": [],
        "committee": "One Commonwealth PAC",
        "name": "Mark Herring",
        "email": "info@herringforag.com",
        "subject": "152 to go!",
        "date": "2021-08-31T16:14:31Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "16",
        "minute": "14",
        "domain": "herringforag.com",
        "body": "Hey there, Quick email before we reach our fundraising deadline tonight! Myteam just let me know we only need ❗❗ 152 ❗❗ more contributions of $20 toraise the last $3,040 we need before our fundraising report goes public. Ithink we can make it, but only if you chip in right now![https://secure.actblue.com/donate/MHVA-AG-Email-Aug2021-FR-EOM?refcode=E11048-20210831-EOM7-SL-DeadlineEOM-RegTemplate-NA-NA&amount;=20]Thank you so much, Mark Herring --- Attorney General Mark Herring is fightingevery day for justice, equality, and opportunity for ALL Virginians. \"Servingas your Attorney General has been the honor of my life. I've proudly worked onyour behalf to expand and secure the rights of our fellow Virginians, and toshow Virginians a new vision for what their Attorney General can do for them.The progress we’ve made has been historic, but the work isn’t done.\" Will youcontribute now to help Mark win re-election and get back to work?[https://secure.actblue.com/donate/mhva-ag-email-june2021-fr-june?refcode=Efooter-SL] DONATE NOW [https://secure.actblue.com/donate/mhva-ag-email-june2021-fr-june?refcode=Efooter-SB] Mark has been the mostprogressive Attorney General in the history of Virginia and we need your helpto keep him in office working for us. But if you'd like to receive feweremails, we understand. You can click here[https://secure.ngpvan.com/jzQEMVNH4U-wdMlDZtPd5w2] to only get our mostimportant messages, or you can unsubscribe:https://email.ngpvan.com/unsubscribeUnique/2543958f-750a-ec11-981f-501ac57ba3ed/b47b0a2e-760a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMTMvMS84NzM2MCIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICJiNDdiMGEyZS03NjBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=UarKXU_PNj1z5U1pEZCkyxOFjuMY9kxEmjCwYgihN3Q=&id;=110637861. PAID FOR AND AUTHORIZED BY ONE COMMONWEALTH PAC One Commonwealth PAC P.O.Box 1753 Richmond, VA 23218 United States",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Kirsten",
            "Michael Toppen"
        ],
        "places": [
            "Arizona",
            "Tucson"
        ],
        "organizations": [
            "Engel for Arizona",
            "ActBlue"
        ],
        "products": [],
        "committee": "Engel for Arizona",
        "name": "Team Engel",
        "email": "info@kirstenengel.com",
        "subject": "We are so close to this goal",
        "date": "2021-08-31T21:11:59Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "21",
        "minute": "11",
        "domain": "kirstenengel.com",
        "body": "https://www.engelforarizona.com/ [https://www.engelforarizona.com/] Friend,Being Kirsten’s Finance Director, it’s my responsibility to have a finger onthe pulse of our campaign’s financial health. That’s why I track ourfundraising numbers so closely. Here’s my current takeaway: We’re still verywell-positioned in this race, but we do have some ground to make up. Runningfor Congress is a Herculean task, and we need to let Kirsten know that we’vegot her back. Our campaign depends on building forward momentum amonggrassroots supporters like you. So here’s my request to you: contribute whatyou can, and let’s ensure that Kirsten can focus on the issues at hand ratherthan the dollars and cents that make a campaign tick.[http://secure.actblue.com/donate/engel-for-arizona-1?refcode=X_03021_EOM_C&amount;=25] If you've saved your payment information withActBlue Express, your donation will go through immediately:http://secure.actblue.com/donate/engel-for-arizona-1?express_lane=true&amount;=5&refcode;=X_03021_EOM_C[http://secure.actblue.com/donate/engel-for-arizona-1?express_lane=true&amount;=5&refcode;=X_03021_EOM_C]http://secure.actblue.com/donate/engel-for-arizona-1?express_lane=true&amount;=25&refcode;=X_03021_EOM_C[http://secure.actblue.com/donate/engel-for-arizona-1?express_lane=true&amount;=25&refcode;=X_03021_EOM_C]http://secure.actblue.com/donate/engel-for-arizona-1?express_lane=true&amount;=50&refcode;=X_03021_EOM_C[http://secure.actblue.com/donate/engel-for-arizona-1?express_lane=true&amount;=50&refcode;=X_03021_EOM_C]http://secure.actblue.com/donate/engel-for-arizona-1?express_lane=true&amount;=100&refcode;=X_03021_EOM_C[http://secure.actblue.com/donate/engel-for-arizona-1?express_lane=true&amount;=100&refcode;=X_03021_EOM_C]http://secure.actblue.com/donate/engel-for-arizona-1?express_lane=true&amount;=&refcode;=X_03021_EOM_C[http://secure.actblue.com/donate/engel-for-arizona-1?express_lane=true&amount;=&refcode;=X_03021_EOM_C] Thank you,Michael Toppen Finance Director Paid for by Engel for Arizona Engel forArizona PO Box 40721 Tucson, AZ 85717 United States If you believe youreceived this message in error or wish to no longer receive email from us,please unsubscribe:https://email.ngpvan.com/unsubscribeUnique/18773852-d109-ec11-981f-501ac57ba3ed/6ca7d9ca-9f0a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMDEvMS82MjcwOSIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICI2Y2E3ZDljYS05ZjBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=Is8vD5XIohT5ZDXbP07-UGmmMSfqAln2QbAz3d-G5FM=&id;=117059901.",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Mark Warner"
        ],
        "places": [
            "Virginia",
            "Williamsburg"
        ],
        "organizations": [
            "U.S. Senate",
            "GOP",
            "Friends of Mark Warner",
            "ActBlue"
        ],
        "products": [],
        "committee": "Friends of Mark Warner",
        "name": "Blue Virginia",
        "email": "info@markwarnerva.com",
        "subject": "A critical moment for our Commonwealth",
        "date": "2021-08-31T17:31:21Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "17",
        "minute": "31",
        "domain": "markwarnerva.com",
        "body": "Derek, Thanks in part to Senator Warner’s leadership, the Senate passedhistoric, bipartisan legislation to put Virginians and Americans back to workand rebuild and renew our aging infrastructure. This is a critical moment forthe Commonwealth of Virginia -- and this is the kind of progress andleadership that we voted for when we reelected Mark Warner in 2020. But as wewrite this, Republicans are not only plotting to take back Virginia, but toflip the U.S. Senate in 2022. We can’t afford to let the GOP roll back ourprogress, Derek. Pitch in $5 now.https://secure.actblue.com/donate/mw-210830-eom?refcode=mw_em_210831_1 Rightnow, we have a very important fundraising deadline and we’re racing to meetour goal. Team Warner still needs to raise another $7,188 before the midnightdeadline -- and the only way we’re going to get there is for supporters likeyou to dig deep and join this fight today. The end-of-month deadline istonight at midnight. Will you donate $5 right now?https://secure.actblue.com/donate/mw-210830-eom?refcode=mw_em_210831_1 Thanks,Team Warner CONTRIBUTE:https://secure.actblue.com/donate/mw-210830-eom?refcode=mw_em_210831_1 ----Friends of Mark Warner 1490-5A Quarterpath Road #213 Williamsburg, VA 23185United States To unsubscribe, go to: unsubscribe:https://email.ngpvan.com/unsubscribeUnique/71cc1d1d-e709-ec11-981f-501ac57ba3ed/30dd660d-810a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQNDAvMS84ODY1NCIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICIzMGRkNjYwZC04MTBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=KS8iO7NhpBIWXeGbP-d8tQAyTo2uBV_ix34kROhENyQ=&id;=106350877Paid for by Friends of Mark Warner",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Mike Garcia",
            "Christy Smith",
            "Peter"
        ],
        "places": [
            "CA-25",
            "Valencia",
            "CA",
            "United States"
        ],
        "organizations": [
            "Congress",
            "ActBlue"
        ],
        "products": [],
        "committee": "Christy Smith for Congress",
        "name": "Team Christy",
        "email": "info@christyforcongress.org",
        "subject": "He voted against what?",
        "date": "2021-08-31T21:03:26Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "21",
        "minute": "3",
        "domain": "christyforcongress.org",
        "body": "Peter, Here's something we know without a shadow of a doubt: Mike Garcia isnot a leader. He's the problem, not a problem solver. And if you're ready tokick him out of Congress, chip in $25 or more right now. DONATE >>https://secure.actblue.com/donate/2108_email_christy?refcode=em21_210831_eom4-s2Mike has shown us at every turn that he isn't going to show up for us -- notnow, not ever. Mike has voted against expanding health care through theAffordable Care Act. He's voted against extending housing assistance during apublic health and economic crisis unlike anything we've seen in a century.It's clear that there is only one candidate in this race who is ready to leadCA-25 through its toughest challenges -- affordable education, accessiblehousing, and so much more. And that's Christy. There's just too much on theline for Mike Garcia to represent this district for another two years, Peter.We need to elect Christy Smith to represent our district and flip the 25thonce and for all, and we're counting on you to show your support. Click hereto chip in $25 -- or whatever you can -- to send him packing. DONATE >>https://secure.actblue.com/donate/2108_email_christy?refcode=em21_210831_eom4-s2Thank you for your support. Let’s finally send Mike packing, Team ChristyChristy Smith is only soliciting funds that comply with federal campaignfinance laws. This email was sent to: dpwillis67@gmail.com. If you no longerwish to hear from us you can unsubscribe here[https://email.ngpvan.com/unsubscribeUnique/5590e9fb-950a-ec11-981f-501ac57ba3ed/66075ca5-9e0a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMjEvMS84OTI1MSIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICI2NjA3NWNhNS05ZTBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=cuIzWs9ssDE9sw_ZBd0hL-nmpgu__hb2aZA8VBWTfG8=&id;=113000550] . Paid for by Christy Smith for CongressChristy Smith for Congress PO BOX 301 24307 Magic Mountain Pkwy Valencia, CA91355 United States",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Jeff Bartos",
            "Joe Biden"
        ],
        "places": [
            "PA",
            "USA"
        ],
        "organizations": [
            "Bartos for US Senate"
        ],
        "products": [],
        "committee": "Bartos for US Senate",
        "name": "Deadline Alert (Bartos Finance Team)",
        "email": "info@bartosforsenate.com",
        "subject": "can you make sure this is correct?",
        "date": "2021-08-31T15:51:00Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "15",
        "minute": "51",
        "domain": "bartosforsenate.com",
        "body": "We just crunched the numbers and… 🚨 AUGUST END OF MONTH DEADLINE 🚨 Jeff’sAugust Deadline is MIDNIGHT and he must reach it if we’re going to win in PAand Save the USA! 🇺🇸 Help Jeff Win in PA ➡ Save the USA 🇺🇸 Hey friend, Thisis the finance team for the Jeff Bartos for U.S. Senate campaign; we justcrunched the numbers and… Jeff is still $422.68 shy of his August End of MonthGoal! If Jeff is going to have any shot at holding Joe Biden accountable, wemust help Jeff win this senate seat, and to do that; we’re going to need yourhelp. Friend, will you commit a few dollars to help Jeff reach his End ofMonth goal and Take Back the Senate? If we're going to save our country fromJoe Biden and the radical Left, it’s crucial that Jeff makes it to the Senateto defeat them,which means helping him reach this crucial deadline. It’s timeto take our country back from Joe, and the radical Leftーif you’re ready to dothat, then rush a few dollars to help Jeff lead the fight >> Thank you,Bartos Finance Team 🇺🇸 Win in PA ➡ Save the USA 🇺🇸 Paid for by Bartos for USSenate 1152 Mae Street #129, Hummelstown, PA, 17036 This email was sent todpwillis67@gmail.com Unsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Ras Smith"
        ],
        "places": [
            "Iowa",
            "United States",
            "Waterloo"
        ],
        "organizations": [
            "ActBlue",
            "Ras Smith for Governor"
        ],
        "products": [],
        "committee": "Ras Smith for Governor",
        "name": "Ras Smith",
        "email": "info@rasforiowa.com",
        "subject": "Last email",
        "date": "2021-08-31T19:43:17Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "19",
        "minute": "43",
        "domain": "rasforiowa.com",
        "body": "Hey, friend, I'll make this quick. It’s the last day of August, which meansour end-of-month deadline is rapidly approaching at midnight tonight! As ofright now, my digital team tells me we’re still $2,194 away from reaching ourgoal. If you can, will you chip in $10 or more right now to support ourcampaign for governor and help ensure we hit our goal before the clock strikesmidnight? https://secure.actblue.com/donate/ras-email-aug2021?refcode=fl_email_fr_20210831eom4_rs_active_xx_pt From the bottom of myheart, thanks for all you do to power this movement! — Ras Paid for by RasSmith for Governor Ras Smith for Governor P. O. Box 1651 Waterloo, IA 50704United States If you believe you received this message in error or wish to nolonger receive email from us, please unsubscribe:https://email.ngpvan.com/unsubscribeUnique/cbb1fa9f-930a-ec11-981f-501ac57ba3ed/0d3738a6-930a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMjEvMS84ODg5NCIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICIwZDM3MzhhNi05MzBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=ts-LFLQ_rKncSM6S-wcXDSCajKpLZXJ3-HcYdigbTbg=&id;=123790384 .",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Marcy Kaptur"
        ],
        "places": [
            "Ohio"
        ],
        "organizations": [
            "Marcy Kaptur for Congress",
            "ActBlue Express",
            "ActionNetwork.org"
        ],
        "products": [],
        "committee": "Marcy Kaptur for Congress",
        "name": "Team Kaptur",
        "email": "info@marcykaptur.com",
        "subject": "This is a critical deadline",
        "date": "2021-08-31T17:22:06Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "17",
        "minute": "22",
        "domain": "marcykaptur.com",
        "body": "National Republicans are putting everything they have into taking our House Majority. |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    Marcy Kaptur | |  --- ![MarcyKaptur](http://can2-prod.s3.amazonaws.com/email_templates/logos/000/008/372/original/Blue_MK_logo.png)   | | Team,   It’s important that we **end the month of August with strong financialsupport.** Congresswoman Marcy Kaptur is focused on fighting for the people ofOhio, and **it’s critical that we send results-oriented leaders back toCongress.**  **Can you chip in $15 today to help us finish the month of August strong andsend Congresswoman Marcy Kaptur back to Congress?**  | **Donate $15 »** ---  Marcy Kaptur understands what issues matter most to the people of theHeartland. Her **top priorities in Congress are _informed by Ohioans,_** notby mega-corporations or the top 1%. It’s critical that we protect a relentlessadvocate for all the people of Ohio.  This is a critical deadline. National Republicans are putting everything theyhave into taking our House Majority.  **In moments like this, we desperately need our grassroots supporters to stepup. Will you chip in $15 to send Congresswoman Marcy Kaptur back toCongress?**_If you've saved your payment information with ActBlue Express, your donationwill go through immediately:_**Donate $10 »** ---   **Donate $20 »** ---   **Donate $50 »** ---  **Donate $100 »** ---  **Other Amount »** ---   Thank you for your support,  \\-- Team Kaptur  Congresswoman Marcy Kaptur is a champion for the Midwest in Congress. She isfocused on getting big money out of politics, holding Wall Street accountable,fighting against bad trade deals that harm workers, ensuring access to healthcare for all, and restoring our Great Lakes. **Can you help us send MarcyKaptur back to Congress?**  ******** | **Donate»** --- **************** **************** ********  ****************  --- | | Paid for by Marcy Kaptur for Congress ---  MarcyKaptur.com   Checks may be mailed to: P.O. Box 899, Toledo, OH 43697, United States | |  ---   | | Sent via ActionNetwork.org. To update your email address, change your name or address, or to stop receiving emails from Marcy Kaptur for Congress, please click here.  ---  ![](https://u1584542.ct.sendgrid.net/ss/o/sKxQ9Tusut-gXiwfMaIEaQ/3ex/LtcEYFRvS_mnIGq0HjSjdQ/ho.gif)",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Mike Lee",
            "Lindsey Graham"
        ],
        "places": [],
        "organizations": [
            "Friends of Mike Lee, Inc.",
            "Senate GOP"
        ],
        "products": [],
        "committee": "Friends of Mike Lee, Inc.",
        "name": "Lindsey Graham",
        "email": "info@ourdefenseofamerica.com",
        "subject": "$5",
        "date": "2021-08-31T16:56:18Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "16",
        "minute": "56",
        "domain": "ourdefenseofamerica.com",
        "body": "Mike Lee Please consider contributing even $5 before 11:59 PM TONIGHT so wecan stay on track and end the Democrats’ control of Washington. Hey FellowAmerican, Right now, Democrats are attempting to force through the mostradical and progressive agenda our country has ever seen. Make no mistake –their vision would fundamentally change America forever. We need your help tostop the Left, so I’ll get straight to the point. Senator Mike Lee (R-UT) andI have a major end-of-month fundraising deadline, and we need your help toensure we have the resources needed to take back the Senate. Your support iscritical. We’re counting on you to chip in $5, $10 or $25 BEFORE 11:59 PMTONIGHT so we can pick up the pace and win back our Senate majority. WIN BACKTHE MAJORITY » It’s hard to believe but 2022 is right around the corner, andevery single dollar will make a difference in this critical election. Yourdonation will directly impact whether Senator Lee wins re-election and whetherwe can reclaim the Senate GOP majority. Fellow American, please considercontributing even $5 before 11:59 PM TONIGHT so we can stay on track and endthe Democrats’ control of Washington. Sincerely, Lindsey Graham P.S. Anydonation made today will benefit both Senator Lee and my efforts to Reclaimthe Senate Majority, so I hope you’ll stand with us at this important time.Paid for by Friends of Mike Lee, Inc. Don't want to receive our emails?Unsubscribe here. Please consider contributing even $5 before 11:59 PMTONIGHT so we can stay on track and end the Democrats’ control of Washington.",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Roy Cooper"
        ],
        "places": [
            "North Carolina"
        ],
        "organizations": [
            "Cooper for North Carolina",
            "Team Cooper"
        ],
        "products": [],
        "committee": "Cooper for North Carolina",
        "name": "Roy Cooper",
        "email": "info@roycooper.com",
        "subject": "a personal request",
        "date": "2021-08-31T21:30:46Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "21",
        "minute": "30",
        "domain": "roycooper.com",
        "body": "Hi Peter, Reaching out quickly because we’re just a few donations away from hitting our $25,000 August online fundraising goal. Can you help close the gap? Here’s your personal link to chip in: https://secure.actblue.com/donate/rc_email?refcode=em_RC_FR_EOM4_083121_l1_D_HPC_25&amount;=25 I’m so proud that each and every time our campaign asks for support, people like you step up to give. That’s because you know just how important our continued work for North Carolina is: from our work keeping communities safe during the COVID-19 pandemic to the continued fight for voting rights and fair representation, there’s always more that we can do to improve our state. If you believe that North Carolinians deserve the best leadership in these difficult times, please, help Team Cooper reach our August fundraising goal by donating $25, or any amount that’s right for you, right now: https://secure.actblue.com/donate/rc_email?refcode=em_RC_FR_EOM4_083121_l2_D_HPC_25&amount;=25 Thank you very much, Roy info@roycooper.com [info@roycooper.com] | Privacy Policy [https://roycooper.com/privacy-policy/] Cooper for North Carolina PO Box 1190 Raleigh, NC 27602 United States Paid for by Cooper for North Carolina Any donor history information in this email reflects what we have on file for this specific email address. If you have donated with a different email address, with a check, or with a spouse -- thank you so much! We have that on file and cannot thank you enough for supporting this campaign. By clicking the links above, you certify that you are responsible for paying all charges incurred in using the debit or credit card to be charged, and that your personal funds will be the true source of the contribution. This email was sent to dpwillis67@gmail.com . If you wish to no longer receive these messages, please unsubscribe. [https://email.ngpvan.com/unsubscribeUnique/e26080d9-970a-ec11-981f-501ac57ba3ed/ed5f899a-a20a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQNDAvMS84ODE3NiIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICJlZDVmODk5YS1hMjBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=WYY_35epQlx4IWxY02HVMmM7PXmTb57NVkwtczAOhWo=&id;=102650613]",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Roy Cooper"
        ],
        "places": [
            "North Carolina",
            "Raleigh"
        ],
        "organizations": [
            "Cooper for North Carolina",
            "Team Cooper",
            "ActBlue"
        ],
        "products": [],
        "committee": "Cooper for North Carolina",
        "name": "Roy Cooper",
        "email": "info@roycooper.com",
        "subject": "a personal request",
        "date": "2021-08-31T19:30:45Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "19",
        "minute": "30",
        "domain": "roycooper.com",
        "body": "Hi Peter, Reaching out quickly because we’re just a few donations away from hitting our $25,000 August online fundraising goal. Can you help close the gap? Here’s your personal link to chip in: https://secure.actblue.com/donate/rc_email?refcode=em_RC_FR_EOM4_083121_l1 I’m so proud that each and every time our campaign asks for support, people like you step up to give. That’s because you know just how important our continued work for North Carolina is: from our work keeping communities safe during the COVID-19 pandemic to the continued fight for voting rights and fair representation, there’s always more that we can do to improve our state. If you believe that North Carolinians deserve the best leadership in these difficult times, please, help Team Cooper reach our August fundraising goal by donating $25, or any amount that’s right for you, right now: https://secure.actblue.com/donate/rc_email?refcode=em_RC_FR_EOM4_083121_l2 Thank you very much, Roy info@roycooper.com [info@roycooper.com] | Privacy Policy [https://roycooper.com/privacy-policy/] Cooper for North Carolina PO Box 1190 Raleigh, NC 27602 United States Paid for by Cooper for North Carolina Any donor history information in this email reflects what we have on file for this specific email address. If you have donated with a different email address, with a check, or with a spouse -- thank you so much! We have that on file and cannot thank you enough for supporting this campaign. By clicking the links above, you certify that you are responsible for paying all charges incurred in using the debit or credit card to be charged, and that your personal funds will be the true source of the contribution. This email was sent to dpwillis67@gmail.com . If you wish to no longer receive these messages, please unsubscribe. [https://email.ngpvan.com/unsubscribeUnique/16e31f43-810a-ec11-981f-501ac57ba3ed/2c3acad5-910a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQNDAvMS84ODE3NiIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICIyYzNhY2FkNS05MTBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=TrxFOFgWLiISB3upXI3N4NpVDwveoBLfkXzOoTC8Ud4=&id;=102650613]",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Rand Paul"
        ],
        "places": [
            "Alexandria",
            "America"
        ],
        "organizations": [
            "Rand Paul for Senate"
        ],
        "products": [],
        "committee": "Rand Paul for Senate",
        "name": "Rand Paul",
        "email": "action@greatamericaupdate.com",
        "subject": "the video they suspended me for",
        "date": "2021-08-31T22:31:19Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "22",
        "minute": "31",
        "domain": "greatamericaupdate.com",
        "body": "http://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65366%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=6qWI7m%2fgCNxw4D5RIAs5uA&sysid;=1Friend, here’s the video Youtube BANNED and has the mainstream media in afrenzyー watch the video >>http://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65366%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=6qWI7m%2fgCNxw4D5RIAs5uA&sysid;=1http://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65366%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=6qWI7m%2fgCNxw4D5RIAs5uA&sysid;=1WATCH THE VIDEO YOUTUBE BANNEDhttp://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65366%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=6qWI7m%2fgCNxw4D5RIAs5uA&sysid;=1Here’s the message that Big Tech, Youtube, and the Media were so desperate tocensor: → They can’t arrest all of us or keep us locked down indefinitely. →They can’t force masks onto our children or follow their anti-sciencemandates. → They can’t require us to carry a vaccine passport or comply withtheir mandates. Why? We can say NOーbecause Americans are a free people. Thisnation by the people, for the people, and of the people was created to protectfreedom and liberty in moments just like this, when politicians andbureaucrats use fear and lies to usher in tyranny on the American people. I’mnot going to let their fear tactics win, I'll continue being the champion forliberty and freedom, but it’s not a fight I or anyone can do alone. That’s whyI’m setting a BIG goal of raising $25,000 before 11:59 PM on August 31st tocontinue funding the fight for liberty. Will you help me reach it by chippingin now?http://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65366%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=6qWI7m%2fgCNxw4D5RIAs5uA&sysid;=1By donating below, you are making an immediate contribution: ANNOUNCEMENT: ENDOF MONTH FUNDRAISING GOAL $25,000 BY 11:59 PM ON AUGUST 31ST ONE CLICK DONATE:$100http://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65366%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=6qWI7m%2fgCNxw4D5RIAs5uA&sysid;=1?email={{email}}&oc;=true&amount;=100 ONE CLICK DONATE: $75http://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65366%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=6qWI7m%2fgCNxw4D5RIAs5uA&sysid;=1?email={{email}}&oc;=true&amount;=75 ONE CLICK DONATE: $50http://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65366%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=6qWI7m%2fgCNxw4D5RIAs5uA&sysid;=1?email={{email}}&oc;=true&amount;=50 ONE CLICK DONATE: $25http://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65366%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=6qWI7m%2fgCNxw4D5RIAs5uA&sysid;=1?email={{email}}&oc;=true&amount;=25 If you've saved payment information withWinRed, your donation will go through automatically. I’ve stood consistentlyfor freedom regardless of which party had power. And I’m not going to stopnow. But this isn’t a fight any American can win alone. That’s why I need youon my side. Please, chip in what you can before our end of month deadline atthis link:http://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65367%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=zGglp2RTPvFE7Nnthl%2fI2w&sysid;=1http://click.greatamericaupdate.com/Pages/Click.aspx?ghff34ghj=41%7c65366%7c612934%7c1%7cqcjvyyvf12%40tznvy.pbz&wdmdk;=6qWI7m%2fgCNxw4D5RIAs5uA&sysid;=1Thank you in advance. In liberty, Rand Paul Paid for by Rand Paul for SenateContribution rules: I am a U.S. citizen or lawfully admitted permanentresident (i.e., green card holder). This contribution is made from my ownfunds, and funds are not being provided to me by another person or entity forthe purpose of making this contribution. I am making this contribution with myown personal credit card and not with a corporate or business credit card or acard issued to another person. I am at least eighteen years old. I am not, noram I making this contribution on behalf of, a corporation, labor organization,national bank, foreign national without a green card, a federal contractor, orany other federally impermissible source. 107 S West St. #826, Alexandria VA22314http://click.greatamericaupdate.com/Pages/OptOut.aspx?ghff34ghj=41%7c612934%7c318%7c6%7cqcjvyyvf12%40tznvy.pbz%7c1&wdmdk;=lp%2fwpPmBc3q9J2sjHhicLg&sysid;=1Unsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Tim Ryan",
            "Derek",
            "Donald Trump",
            "Mitch McConnell",
            "Terry McAuliffe"
        ],
        "places": [
            "Ohio"
        ],
        "organizations": [
            "Common Good Virginia",
            "U.S. Senate"
        ],
        "products": [],
        "committee": "Common Good Virginia",
        "name": "Tim Ryan",
        "email": "info@mcauliffeoffice.org",
        "subject": "a",
        "date": "2021-08-31T19:32:39Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "19",
        "minute": "32",
        "domain": "mcauliffeoffice.org",
        "body": "| | |                                                                                                                                                                                          ![](https://can2-prod.s3.amazonaws.com/uploads/data/000/558/779/original/timryanheadpic.jpg) Derek --  Some folks think we have a snowball’s chance in hell of winning this U.S.Senate race and flipping Ohio’s open seat blue. They just go on and on (andon) about how Donald Trump won this state.  **You know what I think? NEVER bet against Ohio.**  There’s no secret sauce to winning tough elections beyond hard work andstaying focused on what matters most to the people you hope to serve. Nomatter where you live, everyone wants their representatives to fight forliving wages, affordable health care, and good-paying jobs in our communities.  But Mitch McConnell and his big-money donors have no interest in that. For toolong, they’ve run rampant in Washington, allowing special interests to pullthe strings behind closed-door meetings.  **Well, I am sick and tired of special interests calling the shots whileeveryday folks get ignored. And if you’re with me, I need your help to flipOhio’s Senate seat blue.**  **National Republicans will spend MILLIONS to buy this race and retake the Senate majority. We need to raise another $7,902 to stay on track for the month to win. Can you split a donation of $25 right now between my campaign and Common Good VA?** | **DONATE »** ---  We got this,  Tim   Paid for by Common Good Virginia ---     | | Sent via ActionNetwork.org. To update your email address, change your name or address, or to stop receiving emails from Terry McAuliffe, please click here.  ---  ![](https://u1584542.ct.sendgrid.net/ss/o/sKxQ9Tusut-gXiwfMaIEaQ/3ex/ca13l_FhS8mihJF4LYhWTQ/ho.gif)",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Mondaire"
        ],
        "places": [
            "United States",
            "Washington, DC"
        ],
        "organizations": [
            "Mondaire for Congress",
            "Blue Wave Political Partners",
            "ActBlue"
        ],
        "products": [],
        "committee": "Mondaire for Congress",
        "name": "Mondaire Jones",
        "email": "info@mondaireforcongress.com",
        "subject": "97 more contributions",
        "date": "2021-08-31T16:03:10Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "16",
        "minute": "3",
        "domain": "mondaireforcongress.com",
        "body": "Hi there, it's Mondaire. I’m reaching out one last time before our end-of-month deadline tonight at midnight. We have just 97 donations left to go untilwe reach our goal of 500 contributions, so any amount you can pitch in,whether it’s $3 or $30, will truly go a long way — the donation itself is muchmore important than the amount. If you are able to make a contribution, youcan do that using this link: secure.actblue.com/donate/mj-em-aug-2021?refcode2=b9b733e0-740a-ec11-981f-501ac57ba3ed. I couldn’t be moregrateful to have you fighting alongside me. - Mondaire Paid for by Mondairefor Congress Mondaire For Congress c/o Blue Wave Political Partners 499 S.Capitol St. SW Suite 407 Washington, DC 20003 United States This email wassent to dpwillis67@gmail.com. Click here[https://email.ngpvan.com/unsubscribeUnique/b8b733e0-740a-ec11-981f-501ac57ba3ed/b9b733e0-740a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMDcvMS83ODAzNSIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICJiOWI3MzNlMC03NDBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=opQ2TpuXwMkkyJRsz5FP0NZacxUzCAKC6hC5RzZeaPY=&id;=130822988]if you'd like to unsubscribe. We try to send only the most importantinformation and opportunities to participate via email. To support Mondairewith a contribution, click here[https://secure.actblue.com/donate/mondaire?refcode=em_footer] .",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Mark Finchem",
            "Merrick Garland"
        ],
        "places": [
            "America",
            "Arizona",
            "Maricopa",
            "Oro Valley"
        ],
        "organizations": [
            "Election Integrity",
            "Department of Justice",
            "National Association of Bank Robbers",
            "Mark Finchem for Secretary of State",
            "Arizona House of Representatives",
            "NASS Task Force on Vote Verification"
        ],
        "products": [],
        "committee": "Finchem for Secretary of State",
        "name": "=?utf-8?Q?Mark=20Finchem?=",
        "email": "team@votefinchem.com",
        "subject": "Beware of the Mockingbird Media",
        "date": "2021-08-31T17:00:08Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "17",
        "minute": "0",
        "domain": "votefinchem.com",
        "body": "Stay strong https://secure.anedot.com/mark-finchem-for-secretary-of-state/stDear , My name is Mark Finchem. I am the voice of the grassroots movementsweeping America in every state – Election Integrity. >From the start, Ifought for election integrity paying for critical hearings out of pocket, Ihave fought to put America’s Audit on the map, and I have fought to keep itsafe from personal, political, and legal attacks going all the way up toMerrick Garland and the Department of Justice. And now I am running forSecretary of State of Arizona. And one by one, they have been defeated andAmerica’s Audit has prevailed, one foot in front of the other. And this couldnot happen without you and me working together. This is why once again I mustask for your help. Right now, we are busy fighting the latest challenge,something fairly innocuously called: NASS Task Force on Vote Verification:Post-election Audit Recommendations. Before I dive into this particularlynasty piece of propaganda, I need you to understand something. We are upagainst a critical deadline by September first. While we have raised atremendous amount of support over the last few days, we are still $8,400 shyof reaching our fundraising goal. We are THIS close.(https://secure.anedot.com/mark-finchem-for-secretary-of-state/st)https://secure.anedot.com/mark-finchem-for-secretary-of-state/st We need toraise this money to mobilize support, promote America’s Audit and resultswhile we are being silenced by mainstream media, and to make sure our campaignhas the infrastructure to weather the attacks that WILL come from all sides –everyone who opposes the sanctity of American Election Integrity! And this iswhy I must again ask for your help. Please make a contribution today to ensurethat the Election Integrity movement stays strong!(https://secure.anedot.com/mark-finchem-for-secretary-of-state/st) First, letme make clear exactly what the responsibilities of Secretary of State are.Here are a few: * Act as “Chief Election Officer” * Certify statewide electionresults * Record campaign finances of candidates You might notice that theposition is centered around keeping elections free and fair. Well, as future“Chief Election Officer” of Arizona, let me tell you what the Secretary ofStates are trying to do, in almost unison, to squash election integrity. Theexplicit goal of the NASS Task Force on Vote Verification was to ensure thatnothing like “a Maricopa-Style Forensic Audit would ever happen again.” Why? Iwill continue to challenge this: Why is a third-party independent auditoverseen by the legislative such a bad thing? This is an explicit duty of thelegislative. Nonetheless, one thing is clear. It is the job of the Secretaryof State to protect elections, not prevent them from falling under thescrutiny of the people. This is America. This is a Democracy. This is not thetyranny of a cabal of partisan Secretary of States too scared to have thepeople take a second look at how shoddily they are running their elections!Preventing Maricopa-style audits does one thing really well: it obscures thefact that there are several really good measures to reduce the need for auditsto begin with: * Defect elimination * Multi-factor authentication * Ballotfraud countermeasures. Instead, the executive Secretaries of State decidedthat it was their prerogative to override the duty of the Legislative and theright of the People to oversee the elections. This joint statement reads: TheNASS Task Force on Vote Verification encourages states to consider thefollowing recommendations for all types of post-election audits: ● Statesshould have a requirement and timeframe, ideally in state statute, for post-election audits in place prior to an election. These defined requirementsshould include conducting the audit as soon as reasonably possible after anelection, as well as a process to recertify election results based on theresults of the audit. ● Ensuring chain of custody procedures throughout thepost-election audit process is paramount. Election officials should be able totrack the movement and transport of ballots, voting machines, and otherelection materials through witnesses, signature logs, security seals, video,etc. A break in the chain of custody increases the risk that the integrity orreliability of the asset cannot be restored. The EAC Chain of Custody BestPractices document and CISA Chain of Custody and Critical InfrastructureSystems document should be used as a reference when establishing theseprocedures. ● Have state and/or local election officials be an integral partof the post-election audit process, including in the selection of theprecincts or equipment to be audited. The involvement of any third-partyentities, like a CPA firm, should be determined by the Chief State ElectionOfficial or state legislative act prior to an election, and those entitiesmust work closely with election officials. ● The post-election audit methodsand processes must be transparent. This includes identifying who may observethe audit, which should include members of the public, media, political partyand/or candidate representatives. Once the results of the post-election auditare completed and certified, they should be made publicly accessibleconsistent with state law. ● To avert the possibility of voting systemsbecoming unusable, states should have criteria in place prior to an electionfor the use of a federally or a state accredited test lab to perform any auditof voting machine hardware or software. ● States should make every effort toeducate the public on their post-election audit process, as well as otherprocesses and procedures in place to ensure the accuracy and public trust ofthe results. In effect, what these recommendations do is force the People andthe Legislative to let the government try and hold itself accountable. Thismeans that in the event of fraud, the expectation of the people should be thatthe people who are trying to STEAL the election are the same ones who shouldhold themselves accountable. This is ridiculous. This is like the NationalAssociation of Bank Robbers coming together to claim that Bank Robbersshouldn’t be arrested, they should hold each other accountable to not rob anymore banks. This is on its face absurd, and this is why I am running forSecretary of State of Arizona. The Secretaries of State agreed on this almostunanimously, which means that almost every Secretary of State in Americathinks it is the prerogative of the Secretary of State to take power from thepeople. I want to represent the people and give power back to the people,which is what I have been fighting for every single day! But nevertheless, weare under attack once again in Maricopa and the Left is trying to squash allpossibilities of a nationwide audit in every state. We need to get the wordout on the Audit, and fast. (https://secure.anedot.com/mark-finchem-for-secretary-of-state/st) We need resources to protect our campaign from outsideattacks. We need to mobilize volunteers. And this takes your continuedsupport. Please donate GENEROUSLY today to support the Election Integritymovement and fight off this next attack. Help us reach our goal of $8,400 bythe end of the month! (https://secure.anedot.com/mark-finchem-for-secretary-of-state/st) Thank you for your support! (https://secure.anedot.com/mark-finchem-for-secretary-of-state/st) God Bless You,https://secure.anedot.com/mark-finchem-for-secretary-of-state/st Mark FinchemArizona House of Representatives – District 11 Republican for ArizonaSecretary of State Conservative Election Integrity Patriot PAID FOR BY FINCHEMFOR SECRETARY OF STATE============================================================ Copyright © 2021Mark Finchem for Secretary of State, All rights reserved. Our mailing addressis: Mark Finchem for Secretary of State PO Box 69344 Oro Valley, AZ 85737 USAWant to change how you receive these emails? You can ** update yourpreferences (https://votefinchem.us1.list-manage.com/profile?u=a653829701c13e4a704cb19bf&id;=7ec8888fbb&e;=44b8c466b0&c;=a416b27b26)or ** unsubscribe from this list (https://votefinchem.us1.list-manage.com/unsubscribe?u=a653829701c13e4a704cb19bf&id;=7ec8888fbb&e;=44b8c466b0&c;=a416b27b26).",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Ron DeSantis"
        ],
        "places": [
            "Florida",
            "Broward County",
            "Leon County",
            "Sarasota County",
            "Fort Lauderdale"
        ],
        "organizations": [
            "Ron Be Gone, Inc.",
            "ActBlue Express"
        ],
        "products": [],
        "committee": "Ron Be Gone, Inc.",
        "name": "Florida Schools (via ronbegone.com)",
        "email": "info@e.ronbegone.com",
        "subject": "DeSantis attacking our SCHOOLS",
        "date": "2021-08-31T22:04:44Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "22",
        "minute": "4",
        "domain": "e.ronbegone.com",
        "body": "Team -- This last week has been a WHIRLWIND!! FIRST: MAGA Gov. Ron DeSantisSTUPIDLY banned mask requirements in schools, putting the lives of children atrisk. BUT THEN: Broward County defied DeSantis by requiring masks. And thenLeon County joined in. And Sarasota County became the first Trump county todefy DeSantis on masks. NOW: SEVEN counties have bravely fought back againstDeSantis’ deranged ban on mask mandates. We have the momentum to stop Ron\"DeathSantis,\" {{ user.first_name|default:\"friend\" }}! School officials,parents, and students throughout Florida are standing up to DictatorDeathSantis. Will you join this collective fight to stop MAGA Gov. RonDeSantis by chipping in $3 NOW? We need your support to keep our billboardsand ads up that will RUIN DeSantis' chances of winning! » (https://act.ronbegone.com/go/2287?t=1003&akid;=483%2E564421%2EtnKZU2 ) Ifyou've saved your payment information with ActBlue Express, your donation willgo through immediately: CONTRIBUTE $3 » (https://act.ronbegone.com/go/2293?t=1009&akid;=483%2E564421%2EtnKZU2 )CONTRIBUTE $7 » (https://act.ronbegone.com/go/2294?t=1010&akid;=483%2E564421%2EtnKZU2 ) Or acustom donation » (https://act.ronbegone.com/go/2295?t=1011&akid;=483%2E564421%2EtnKZU2 ) Butdon't be fooled -- DeSantis isn't just going to let schools get away withrequiring masks. DeSantis is fighting back. He’s already threatened towithhold employee salaries, remove school officials, and NOW he’s threateningto WITHHOLD SCHOOL FUNDING!! It's like he's DETERMINED to send as many Floridachildren to hospitals as possible!! It’s clear, dictator DeSantis has GOT. TO.GO!!! That's why we're putting up billboards and running ads across the stateto RUIN his chances of winning. But it's expensive. Please, chip in $3 toretire Ron DeSantis NOW » (https://act.ronbegone.com/go/2287?t=1013&akid;=483%2E564421%2EtnKZU2 ) Ifyou've saved your payment information with ActBlue Express, your donation willgo through immediately: CONTRIBUTE $3 » (https://act.ronbegone.com/go/2293?t=1019&akid;=483%2E564421%2EtnKZU2 )CONTRIBUTE $7 » (https://act.ronbegone.com/go/2294?t=1020&akid;=483%2E564421%2EtnKZU2 ) Or acustom donation » (https://act.ronbegone.com/go/2295?t=1021&akid;=483%2E564421%2EtnKZU2 )Everyone’s counting on us. -- Team Ron Be Gone ------------------ Paid for byRon Be Gone, Inc. www.ronbegone.com Not authorized by any candidate orcandidate's committee. P.O. Box 30295, Fort Lauderdale, FL 33303 Click here torequest fewer emails: https://act.ronbegone.com/signup/fewer-emails/?t=1001&akid;=483%2E564421%2EtnKZU2 Click here to unsubscribe:https://act.ronbegone.com/unsubscribe/unsubscribe/?akid=483%2E564421%2EtnKZU2",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Carli",
            "Susie Lee"
        ],
        "places": [
            "Las Vegas"
        ],
        "organizations": [
            "Susie Lee for Congress"
        ],
        "products": [],
        "committee": "Susie Lee for Congress",
        "name": "Carli F.",
        "email": "info@susieleeforcongress.com",
        "subject": "fwd: did you see this?",
        "date": "2021-08-31T16:52:47Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "16",
        "minute": "52",
        "domain": "susieleeforcongress.com",
        "body": "Folks -- I wanted to re-up last night’s email. It’s early here in Las Vegas,but there’s no time to waste because today is the last day of August. We’restill behind our monthly goal and we’re counting on you to help us get there.Can you give $25, $15, or even $5 as soon as you finish this email so we canmeet tonight’s deadline?[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=25]Thanks, Carli ---------- Forwarded message ---------From: Team Lee Subject:Tomorrow’s deadline Team -- tomorrow is the last day of August, which meanstomorrow is our critical fundraising deadline. We’re still behind our end-of-month goal, and that’s not good. We still need to raise $2,578 by tomorrownight. Susie asked us to reach out to her top donors and that’s you. We wantto give her some good news, so can you give $25, $15, or even $5 beforemidnight tonight?[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=25]Chip in $5 >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=5]Chip in $15 >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=15]Chip in $25 >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=25]Chip in $50 >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=50]Chip in $100 >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=100]Other Amount >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1]NV-03 is a battleground district, which means all eyes will be on us in 2022.The delicate Democratic House Majority hangs in the balance. For Congress toget critical legislation passed, we need the majority. That’s where you comein. With your donation, we’ll be able to fund essential on-the-ground workthat wins NV-03, and keeps our House Majority. As we reach this criticalfundraising deadline, we need your help. Can we count on you to chip in $20,$10, or $5 before midnight tonight?[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=20]Chip in $5 >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=5]Chip in $10 >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=10]Chip in $20 >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=20]Chip in $50 >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=50]Chip in $100 >>[https://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1&amount;=100]Other Amount >>[hhttps://secure.actblue.com/donate/bs_sl_q32021_fr?refcode=EM_BS_LEE_210831_FR_EOM8_A0_NA_U1_X1_M1]Thank you, Team Lee We believe that emails are the best way for our campaignto stay in touch with supporters like you. But if you'd like to removeyourself from our list, click unsubscribe:https://email.ngpvan.com/unsubscribeUnique/51462f0d-a809-ec11-981f-501ac57ba3ed/cef355c3-7b0a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMDEvMS82MjA5NCIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICJjZWYzNTVjMy03YjBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=zRvNGh-h8QiHrz2yeeuO4pJEwt-MDizhYNmJb1pKAiU=&id;=114776266 Paid for by Susie Lee for Congress Susie Leefor Congress 5130 S Fort Apache Rd Ste 215-382 Las Vegas, NV 89148info@susieleeforcongress.com [info@susieleeforcongress.com]",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Matt Gaetz",
            "President Trump",
            "Nancy Pelosi"
        ],
        "places": [
            "America",
            "DC",
            "DC Swamp"
        ],
        "organizations": [
            "CNN"
        ],
        "products": [],
        "committee": "FRIENDS OF MATT GAETZ",
        "name": "Gaetz Finance Team",
        "email": "info@mattgaetzforflorida.com",
        "subject": "Only a few hours remain…",
        "date": "2021-08-31T22:51:00Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "22",
        "minute": "51",
        "domain": "mattgaetzforflorida.com",
        "body": "Peter, Thank you for being an invested member in the mission to get America First leadership in our nation’s capital - the Deep State continues to murk up the DC Swamp, but your support helps us combat their greedy schemes in order to make OUR interests the priority! Leaders like Congressman Matt Gaetz and President Trump are writing the playbook on how to buck the agenda of CNN talking heads and Deep State actors in order to advance bold America First policies. But in order to see more leadership like this, and less corrupt politicians like Nancy Pelosi ushering in the decline of America while enriching themselves, we need to stand firm before key deadlines. The Establishment wants no borders, no Constitutional rights (especially for Trump supporters…), no Law and Order, and no opinions other than what is deemed acceptable by the Big Tech tyrants and Fake News media shills. If you want leadership that looks out for your priorities instead, we hope you’ll join the fight ASAP before the End-of-August deadline! RUSH IN $25 RUSH IN $50 RUSH IN $100 RUSH IN ANY AMOUNT Gaetz Finance Team  PAID FOR BY FRIENDS OF MATT GAETZ Copyright © 2021 Friends of Matt Gaetz, All rights reserved. You are receiving this email because you opted in at our website. Friends of Matt Gaetz | MattGaetz.com Friends of Matt Gaetz | PO Box 168, Mary Ester, FL 32569 Unsubscribe dpwillis67@gmail.com Update Profile | Constant Contact Data Notice Sent by info@mattgaetzforflorida.com",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "John Cranley",
            "Dena Cranley"
        ],
        "places": [
            "Ohio",
            "Cincinnati"
        ],
        "organizations": [
            "Ohio’s Innocence Project",
            "John Cranley Committee",
            "ActBlue"
        ],
        "products": [],
        "committee": "John Cranley Committee",
        "name": "John (personal)",
        "email": "info@johncranley.com",
        "subject": "Quick note – open before midnight",
        "date": "2021-08-31T17:02:32Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "17",
        "minute": "2",
        "domain": "johncranley.com",
        "body": "John Cranley for Governor Hi there, I’m reaching out one last time beforeAugust ends to ask if you can contribute to our campaign’s end-of-monthfundraising goal. Here’s your individual link to give:[https://secure.actblue.com/donate/em_jc_fr_eom_aug21?refcode=em_JC_FR_EOM5_083121_l1&amount;=10&refcode2;=aa1f5511-7d0a-ec11-981f-501ac57ba3ed]My commitment to serving Ohio starts and ends with this: I will always bestraight with you. I believe that we can flip Ohio blue — I wouldn’t berunning if I didn’t think we could win. But our success depends on you,friend. I’m proud that our campaign is funded by folks like you who are readyto flip Ohio blue and write a comeback story with us. And I’m grateful that somany of you have stepped up to chip in already. It goes to show that thepeople of our community are invested in Ohio’s future and in building agovernment that we can be proud of. We’ll be an administration that serves themiddle class, not just the wealthiest among us. One that follows the sciencewhen it comes to COVID-19 and climate change, so we can end this pandemic andprotect our planet for future generations. This is what we’ve done forCincinnati, and it’s what we can do for Ohio — if we have your help. Please,if you haven’t given yet this month, or if you’re able to donate just a littlemore, use your personal donation link before midnight. Here it is one lasttime:[https://secure.actblue.com/donate/em_jc_fr_eom_aug21?refcode=em_JC_FR_EOM5_083121_l2&amount;=10&refcode2;=aa1f5511-7d0a-ec11-981f-501ac57ba3ed]I appreciate it, John DONATE[https://secure.actblue.com/donate/em_jc_fr_eom_aug21?refcode=em_JC_FR_EOM5_083121_eb&amount;=10]John Cranley has spent his career working towards creating a fairer, more justworld. It's why he founded Ohio’s Innocence Project back in 2003, why he ranfor mayor of Cincinnati — the town where he grew up – and why he and his wife,Dena are raising their son to respect the principles of justice, equality, andcompassion. Now, he's running for governor. He's already led a comeback forCincinnati, and he's ready to lead a comeback for Ohio, too. Please make adonation today, and join Mayor Cranley's campaign to build an Ohio that worksfor everyone >>> [https://secure.actblue.com/donate/jc-em-launch?refcode=em_jc_fr_footer_link Instagram[https://www.instagram.com/john.cranley/] Facebook[https://www.facebook.com/mayor.cranley/] Twitter[https://twitter.com/JohnCranley] Paid for by the John Cranley Committee JOHNCRANLEY COMMITTEE 30 GARFIELD PLACE SUITE 900 CINCINNATI, OH 45202 UnitedStates Click here to unsubscribe:https://email.ngpvan.com/unsubscribeUnique/4276750a-7d0a-ec11-981f-501ac57ba3ed/aa1f5511-7d0a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMjEvMS84ODc0NiIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICJhYTFmNTUxMS03ZDBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=xxcAv-fk9fz6vbBZiQnYvn1bkEmAtFLmsPKBHi460q8=&id;=125433337",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Joe Biden",
            "Peter",
            "Patrick Morrisey"
        ],
        "places": [
            "Afghanistan",
            "West Virginia",
            "United States",
            "Beverly",
            "Charleston"
        ],
        "organizations": [
            "Morrisey for Attorney General",
            "Morrisey for West Virginia, Inc.",
            "Morrisey 2020",
            "Blue and Gold Fund",
            "West Virginia Republican Party, Inc.",
            "Red Curve Solutions",
            "Team Morrisey",
            "Taliban",
            "Biden Administration"
        ],
        "products": [],
        "committee": "TEAM MORRISEY",
        "name": "Patrick Morrisey",
        "email": "patrick@teammorrisey.com",
        "subject": "President Biden's Disastrous Presidency",
        "date": "2021-08-31T15:47:21Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "15",
        "minute": "47",
        "domain": "teammorrisey.com",
        "body": "Joe Biden's presidency has been MORE DISASTROUS than any of us could haveimagined. Dear Peter, Joe Biden's presidency has been MORE DISASTROUS than anyof us could have imagined. Now, President Biden's bad judgment has caused theU.S. to leave many billions worth of guns, assault vehicles, helicopters, andother advanced military equipment behind In Afghanistan — falling right intothe hands of the Taliban! *Can this guy get any more RECKLESS?* This is why Iam fighting back, Peter. President Biden, and those influencing his decisions,must be stopped before more damage is done. If you want to help Defend Americafrom Biden's horrific decision making, then I need you to *STEP UP TONIGHT* tohelp us meet our important *End-of-Month* fundraising deadline. *YOUR HELP NOWwould allow us to CRUSH our End-of-Month fundraising goals and PREVAIL in ourfights against the Biden Administration. ARE YOU IN?* (https://secure.anedot.com/team-morrisey/end-of-august ) CHIP IN $5 (https://secure.anedot.com/team-morrisey/end-of-august?amounts=5 ) CHIP IN $10( https://secure.anedot.com/team-morrisey/end-of-august?amounts=10 ) CHIP IN$25 ( https://secure.anedot.com/team-morrisey/end-of-august?amounts=25 ) CHIPIN $50 ( https://secure.anedot.com/team-morrisey/end-of-august?amounts=50 )CHIP IN ANY AMOUNT ( https://secure.anedot.com/team-morrisey/end-of-august )Sincerely, Patrick Morrisey Attorney General of West Virginia CHIP IN ANYAMOUNT ( https://secure.anedot.com/team-morrisey/end-of-august ) Paid for byTEAM MORRISEY, a joint fundraising committee authorized by and to benefit ofMorrisey for Attorney General, Morrisey for West Virginia, Inc., Morrisey2020, Blue and Gold Fund, and West Virginia Republican Party, Inc. c/o RedCurve Solutions 138 Conant Street, 2nd Floor Beverly, MA 01915. Copyright (C)2021 Team Morrisey. All rights reserved. *Mailing Address* Team Morrisey P.O.Box 11903 Charleston, WV 25339-1903 Unsubscribe (http://url8766.teammorrisey.com/asm/unsubscribe/?user_id=16993234&data;=puWUeCajZeRAvQ7wRlMUX4zWEphXDwC3nVrSWatgB1JQoUp1t5j0JZuqAXrBTr4c97-M4fSsER2IgAjoOuuHrEoWgR-lo88JNTIIylOtjaZKfVpIIpB_pDpEefNBc-_GoCKrlWjVGXDXWZwPjP-I4BPx-OZ99ykf6ojyg4YdjvlHnE9t6XFoe27PshW1mZU87ueamcZPX3T3DsxAlsPWI-tXWUZMotQAtO9dHTbtFTEv7yWhjxekEfTlaPdqWITqhoVUzcpVlw__dcWXJzX28oTuicco-a-Mb4RWoSBwMdjn99LLE93UQDd3ZsF90aDXi0FNOL2YkRqr-28n4AoTHckVnftp5PpDYSRlg9-gQ8jmj2rolaGO1fPtxZelkvw13xail4QfZ7Ec7YZfxxbFcIxRkKDZjULK0qZfIQyqNgj35IyTabU9qe4zz1gTTkynHJPXYpqRgx_Nme5ICeMBV_N7mj1gwSy-EhTnTwNUHW-o__Y3h2UccIm2k2F_5hY3DqjG6IBgMQcdz1l8T0ApPlDnZd18qImjKntdkYah_GNQBsVrTIXC43MlXtEXb1_muqqMIeQtdUY8Eff3al2AB5OaJzFMbuPeOqIbZl6_z3KsGvT8QgnO-KYD2AzDSGep2hwomfmxzFcvf5iYh1qLjE1ELmw0HkWre_vgAqFO2I3FtyuU5LbZkEUAodlZ6NmTuPTb8SHxfRgtYb7xas6uX6NBx9zIYKonvIn46zIfr3IB_mWqTQ6kcTlMgNKkiL9n-q5sVvNKiMRlBC1hbPqlZNcgw-2w2xy3jVznhhUvTEykLCZCFPfuzr1v-MXZ630Jk9axGJwaHVNvTFKp4FQ0ISX7b0mcTncSVX--dva1Q4U9zdQsozfQSmkR35cbF-vUy-dOxJr-1bLuknkuCVfSP8AnzLGsPA193Q47n4vo9wYyW5rffwWZ3FDDYTJcBRuPooSDtzVOinrr0vdQxZZchNMmkDQKF79kkrNpxDGr7G8eRhylS7VeeMP3-acVHtATHu-ZsWI55k8XWT-SA8lHAmGzrLpFAeOhwAu-5bjx5CuBrt7qcJFz_zzOITQZWHOOVCt5Sb2QnQBTQTKzmHKYAvE7IGRoif8zDMmwQdY2ylaS4JTxxgLJd61jbw-A6Ccby1z1vpEC3qmeDv5Tof3Pwg==) - Unsubscribe Preferences (http://url8766.teammorrisey.com/asm/?user_id=16993234&data;=apLQfmj-hdhiFPAUmhyYsmZ6k1Ml-m4Y2R-1H5f5O02k-unTvIX-jCps8XZpacKm5XhUH42TMVANZu2OwJsJIJH8BCdF8VzhJ3RZG2NMkNREUas2uxj3mVDFAiBCYgnxpMdvAe1GoWuRkVs5f0Lfq-ZbVhdSjSaTdWrtdU6ucX5C84akhPMLyi-x-QHFUg_qUn0vvtpaKV3P_lwRdLP6J-mlG-igTXCRika_Ls1Hizg5pHBnkeFh4Zt6KaXl3u3XsmyT8bEeNtgaSkGq4mMT1-ydpz_5RiBhoa3zS_mHGNs7R0xNTkWrY9kNT44pScdsk_LX-tIxEDOzc8fzf1otAV9A4YXQtEkiJlaeMjJVjCFpYB1hh9q0p2EsAAJrPxe2j0-ViEBfw6g7p4lTu6DerFkiajTle82bbCjJtdHLFkN4PtyHcVoHn7aw-SH50CTeZfZ8mmaZ6-AJ3hRmT3_E6jI34lD9pE71QT1vS-H5Y9XRD3J3XA0rRt1rOTk262DiQt8EniKgJluo1yB3Xvg5x6-oa5yrqbHn50AjgbWvLCuGmQvtnGo7EhG1ro7quybXu1oexl-__XEDYayAH5XH8lWMQn0ywscMQCBYHe4JXYI5q-uiG703tIFbqfcM5RXvYze18k5OVJ0kkccIFrZa7T-XQzNs0U3C-Dmf0tdd-frhHaEN63dJATmhmyQhQmSYn7-fzcgUabRBuGNJaAQNSfF0UqpeffgnRBMHmciuXRqKHvIasJZy406s9MNdZwAjY126wLuCmPDwp4hZJNtB9wwLhKpbhY7CEefme7Pf9R_govAyi34nzmQTNgwa5M2cxYQCJFH1PA6jJ4ltqRaUMLvn_zjUgVUuhMvWzD-BWRbK6KGyip5uPKtQN0RUQf2O_hMhM2kuDYcDFKWtpRq-bKW2WPonLgLUe0ksQSPkJG1k3cnV3UAozqOpB82w1hJ_uQhA5_et0tqcLiyEQ690Qbn6-Aj42lhTbpFFdeHOa1gnlCTGwSw9t7nZKi_lfJE3DAM5Wj9rVzCyOBx53c-66o3reg1WCWigA_Sza7g4wqUQJPUfXjL0jErPTbcnDo1ImgL9jiWE4MXWhksFgEJ6HCdwmJ4Zf-yMljyNUOib7UPxpmLuVbh2obYuFm6PnxQkx0OmySin4Yg-kFr7BM06rA== )",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Abigail Spanberger",
            "Peter",
            "Whitney"
        ],
        "places": [
            "Virginia",
            "Central Virginia",
            "Glen Allen"
        ],
        "organizations": [
            "Spanberger for Congress",
            "House Democrats",
            "CIA",
            "Congress"
        ],
        "products": [],
        "committee": "Spanberger for Congress",
        "name": "Whitney Holt",
        "email": "info2@abigailspanberger.com",
        "subject": "just a few reasons",
        "date": "2021-08-31T19:56:27Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "19",
        "minute": "56",
        "domain": "abigailspanberger.com",
        "body": "Peter — today is the last day to fundraise before the end-of-month deadline. I hope you’ll consider contributing to Abigail’s re-election campaign today so we can meet our August goal. CONTRIBUTE (https://secure.actblue.com/donate/BLU-SPAN-Q3-2021-donate?refcode=BLU-SPAN-20210831-1-EM&amount;=25) There are many reasons our campaign needs sufficient resources, but here are just a few: 1. Multiple opponents have already declared their candidacy to challenge Abigail in Virginia’s 7th District. They know how competitive this seat is and will do everything in their power to defeat her. 2. Outside groups have already launched ad campaigns to discredit her work in Congress. As we get closer to the election, there will be more attacks. 3. House Democrats know that this seat is vulnerable — that’s why they added Abigail to the Frontline list, which names House Democrats who must win in 2022. 4. Abigail is working every single day to serve the hard-working people of Central Virginia. She needs to win this race to continue advocating for the expansion of rural broadband, to lower prescription drug prices, and to keep fighting for the kitchen table issues that Central Virginians care about. Peter, the stakes of this race are high, but we have a team strong enough to weather any of the challenges that we face. I am confident that with your support, we can hold this seat in 2022. Can I count on you for a contribution before our August deadline? CONTRIBUTE (https://secure.actblue.com/donate/BLU-SPAN-Q3-2021-donate?refcode=BLU-SPAN-20210831-1-EM&amount;=25) Thank you for your support, Whitney ------------------------------------------------------------ --------------------------------------------- | Paid for by Spanberger for Congress | --------------------------------------------- Spanberger for Congress PO Box 3121 Glen Allen VA 23058 United States Abigail Spanberger is a proud Democrat, former CIA officer, and representative for Virginia's 7th Congressional District. She believes in leadership that flows from our shared American values of integrity, responsibility, and decency, and she wants to work to move this country forward together. To learn more, please visit AbigailSpanberger.com (https://abigailspanberger.com) . DONATE (https://secure.actblue.com/donate/BLU-SPAN-Q3-2021-donate?refcode=BLU-SPAN-20210831-1-EM&amount;=25) If you wish to receive fewer emails, click here (https://act.myngp.com/Forms/8176082879426464512) . https://act.myngp.com/el/V532FjGk8dzsXm4TmY2Mum_ewpF31DvjnCUZjEIhWyk=/ODDpxKjbGSrkASeiuNXtQ_-kWKWARqHQCCA8yTk0R6I= This message was sent to dpwillis67@gmail.com",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Madison Cawthorn",
            "Peter",
            "Jasmine Beach-Ferrara",
            "Trump"
        ],
        "places": [
            "NC-11",
            "Asheville",
            "NC",
            "United States"
        ],
        "organizations": [
            "The Washington Post",
            "CNN",
            "Insider",
            "Jasmine Beach-Ferrara for Congress"
        ],
        "products": [],
        "committee": "Jasmine Beach-Ferrara for Congress",
        "name": "Team Jasmine",
        "email": "info@jasmineforcongress.com",
        "subject": "Everyone is talking. This is a critical moment.",
        "date": "2021-08-31T20:12:42Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "20",
        "minute": "12",
        "domain": "jasmineforcongress.com",
        "body": "Our Republican opponent Madison Cawthorn was just caught calling for anotherJanuary 6th-style insurrection and warning about bloodshed. This is a pivotalmoment in this campaign, and we need you to help us make sure that Cawthorn’sextremist threats lead to his defeat. Can we count on you to chip in $25?Donate >>http://secure.actblue.com/donate/jas_monthly_aug21?refcode=EM_BS_JAS_210831_FR_CawthornCoverage_A0_na_U1_X1This is critical, Peter. The Washington Post Rep. Madison Cawthorn falselysuggests elections are ‘rigged,’ says there will be ‘bloodshed’ if systemcontinues on its path CNN Rep. Cawthorn talks of 'bloodshed' over futureelections as he pushes voting lies Insider Rep. Madison Cawthorn calls Jan. 6rioters 'political prisoners,' suggests he wants to 'try and bust them out' ofjail Not even Trump invoked bloodshed or taking up arms against fellowAmericans. Cawthorn has shown us his true character, and we need to make sureevery voter in NC-11 knows what he stands for. We only have one chance todefeat Cawthorn. We can’t afford to lose. Will you chip in today and helpdefeat this dangerous insurrectionist? Donate >>http://secure.actblue.com/donate/jas_monthly_aug21?refcode=EM_BS_JAS_210831_FR_CawthornCoverage_A0_na_U1_X1&amount;=25-- Team Jasmine unsubscribe:https://email.ngpvan.com/unsubscribeUnique/bfa3e973-8e0a-ec11-981f-501ac57ba3ed/2b79868b-970a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMjEvMS84ODg4MiIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICIyYjc5ODY4Yi05NzBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=MxUtMIXZfcWM7RL30ZHTpiXSbbJ6dETB40ddJP8OZwA=&id;=124830791Paid for by Jasmine Beach-Ferrara for Congress Jasmine Beach-Ferrara forCongress PO Box 7553 Asheville, NC 28802 United States Email:info@jasmineforcongress.com Twitter: https://twitter.com/jbeachferraraFacebook: https://www.facebook.com/beachferrara",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Patrick Clark"
        ],
        "places": [
            "Pennsylvania",
            "Harrisburg"
        ],
        "organizations": [
            "Keystone Progress Education Fund",
            "ActBlue",
            "Facebook",
            "PA Legislature"
        ],
        "products": [],
        "committee": "Keystone Progress Education Fund",
        "name": "Patrick Clark, Keystone Progress Education Fund",
        "email": "info@keystoneprogress.org",
        "subject": "Like other urgent email deadlines, only with 3x urgency!",
        "date": "2021-08-31T23:32:26Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "23",
        "minute": "32",
        "domain": "keystoneprogress.org",
        "body": "https://secure.actblue.com/donate/keystone-progress-now?refcode=083121c[https://secure.actblue.com/donate/keystone-progress-now?refcode=083121c] DearFriend, If we don’t get 12 more contributions by midnight, the Trumpy/Jan 6th-ers of the PA Legislature will turn into progressive-eating zombies , devourlegislative aides to replace their dissolved brains, munch away at our votingand reproductive rights, and we’ll wind up with similarly infected judges thisNovember. While this may be a touch of satirical hyperbole, there’s nothingfunny about what is happening in PA politics right now. The attack on ourvalues is real, and it IS urgent. And we’d really like at least 12 more peopleto click here and contribute by midnight.[https://secure.actblue.com/donate/keystone-progress-now?refcode=083121c](It’s not that our Finance Director gets summarily thrown off a cliff in themorning if you donate tomorrow. It just looks better on the chart if it is inAugust.) https://secure.actblue.com/donate/keystone-progress-now?refcode=083121c [https://secure.actblue.com/donate/keystone-progress-now?refcode=083121c] This organization is sick and &#%! tired of progressivecircular firing squads, we're trying to focus all energies (and all PAprogressives) on the incoming hordes of voters trying to sustain the Big Lieabout the election with judges who believe the same. We need to expand andreach out to more of our own and not just mobilize - we need to fight. We needmore communications to combat the infectious lies coming out of thesenefarious nitwits. We need 12 more donations of any size. Donate $3 or$30,000. But please do something. They’re coming .[https://secure.actblue.com/donate/keystone-progress-now?refcode=083121c]Thanks, Patrick Clark Board Member Keystone Progresshttps://secure.actblue.com/donate/keystone-progress-now?refcode=083121c[https://secure.actblue.com/donate/keystone-progress-now?refcode=083121c]https://www.facebook.com/KPEdFund/[https://www.facebook.com/KPEdFund/] Paid for by Keystone Progress EducationFund, www.kpef.info. Not affiliated with any candidate or candidate'scommittees. Keystone Progress Education Fund PO Box 1206 Harrisburg, PA 17108United States If you believe you received this message in error or wish to nolonger receive email from us, please unsubscribe:https://email.everyaction.com/unsubscribeUnique/3a683476-b30a-ec11-981f-501ac57ba3ed/3e683476-b30a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9FQS9FQTAxNS8xLzkxNjI4IiwNCiAgIkRpc3RyaWJ1dGlvblVuaXF1ZUlkIjogIjNlNjgzNDc2LWIzMGEtZWMxMS05ODFmLTUwMWFjNTdiYTNlZCIsDQogICJFbWFpbEFkZHJlc3MiOiAiZHB3aWxsaXM2N0BnbWFpbC5jb20iDQp9&hmac=CEOzuN3FUze7u0VW7VCLBsTLzwk3jbkDZC4_SRJ-aWc=&id=111098838 .",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Andrew Garbarino",
            "Nancy Pelosi",
            "Peter"
        ],
        "places": [
            "America",
            "Long Island",
            "Bayport, NY"
        ],
        "organizations": [
            "GOP"
        ],
        "products": [],
        "committee": "Garbarino for Congress",
        "name": "Andrew Garbarino",
        "email": "info@garbarinoforny.com",
        "subject": "URGENT: Need your help...",
        "date": "2021-08-31T23:03:25Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "23",
        "minute": "3",
        "domain": "garbarinoforny.com",
        "body": "Dems to end the filibuster? JUST $3,452 TO GO... HELP ANDREW GARBARINO FIGHTFOR ELECTION SECURITY Donate to Andrew’s End-of-Month Goal RUSH A DONATION TOANDREW TODAY Peter ー it’s Andrew. I wanted to just send you a quick reminderabout my campaign and explain to you why it’s so crucial that we outraise ourDemocratic opponents. The Democrats want to pass the infamous HR4 -- whichdenigrates the American voting process -- in the Senate. But to do that, theyneed to end the filibuster… And Peter, I have to admit… I’m very concernedabout this. My colleagues on the other side of the aisle, and especially NancyPelosi, have proven how shameless they can be over this past year. If the Demsstrike down the filibuster… we could see America radically transformed. RUSH ADONATION TO SAVE VOTER LAWS But that’s not what we want. And it sure isn’twhat hard-working Americans need. Americans are looking for leadership thatactually represents their will. So why are Nancy Pelosi and the Democratsgoverning like this is a socialist country? It all comes down to power andcontrol for the leftists. But as your Congressman, I’ve co-sponsored over 70pieces of legislation in just half a year, bringing jobs and prosperitydirectly to the Long Island area… leaving the partisan games to Pelosi. Peter,I need your help to keep doing my work here. I want to continue standing upfor YOU in Congress… but right now, I’m counting on your support. We’re JUST$3,452 away from our goal… will you rush a $5, $25, or $50 donation to mycampaign today? Your backing in this fight is so crucial, Peter. The GOP mustretake the House in 2022… our American institutions depend on it. RUSH ADONATION Thank you, Andrew Garbarino PAID FOR BY GARBARINO FOR CONGRESS P.O.Box 101, Bayport, NY 11705 This email was sent to dpwillis67@gmail.comUnsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Susan Wild"
        ],
        "places": [
            "Lehigh Valley",
            "Congress",
            "United States",
            "Allentown",
            "PA"
        ],
        "organizations": [
            "Democratic",
            "House",
            "Susan Wild for Congress"
        ],
        "products": [],
        "committee": "Susan Wild for Congress",
        "name": "Susan (personal)",
        "email": "info@wildforcongress.com",
        "subject": "quick question",
        "date": "2021-08-31T20:11:17Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "20",
        "minute": "11",
        "domain": "wildforcongress.com",
        "body": "Hi Peter, I hate to bother you, so I’ll keep this quick. Our end-of-monthdeadline is just hours away, but we’re still $1,297 short of our Augustfundraising goal. Can you chip in today to get us there? Here’s a secure linkto donate now: (https://secure.actblue.com/donate/BLU-SWC-Q3-2021-donate?refcode=BLU-SWC-20210831-2-EM&amount;=25) I so enjoyedbeing home in the Lehigh Valley this month — but I’m even more excited to beback in Congress fighting for key issues like voting rights, loweringprescription drug costs, and securing good jobs. The kind of work I’ve beendoing is only possible with a Democratic majority in the House. And if we’regoing to keep the House blue in 2022, we can’t afford to lose a single seat,including mine. To keep me in Congress and keep the House blue, pleaseconsider contributing to my re-election campaign before our deadline tonight.Here’s that link again: (https://secure.actblue.com/donate/BLU-SWC-Q3-2021-donate?refcode=BLU-SWC-20210831-2-EM&amount;=25) Thank you forinvesting in our movement, Susan Wild------------------------------------------------------------ Paid for by SusanWild for Congress Susan Wild for Congress 636 N Cedar Crest Blvd. #183Allentown, PA 18104 United States DONATE TO SUSAN(https://secure.actblue.com/donate/BLU-SWC-Q3-2021-donate?refcode=BLU-SWC-20210831-2-EM&amount;=25) If you would like to receive fewer emails, clickhere (https://secure.ngpvan.com/6M6CoITLs0uiXKXiPh-8bQ2) . If you believe youreceived this message in error or wish to no longer receive email from us,please unsubscribe:https://email.ngpvan.com/unsubscribeUnique/bd014b00-dc09-ec11-981f-501ac57ba3ed/1a7b346e-970a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMjEvMS84ODczMCIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICIxYTdiMzQ2ZS05NzBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=zVk7XSlrKh8m3jI2XXxBu42rAHC9GGbJi6J-VD9K_1w=&id;=106636404This message was sent to dpwillis67@gmail.com",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Hala Ayala",
            "Peter"
        ],
        "places": [
            "Virginia",
            "Woodbridge"
        ],
        "organizations": [
            "Hala For Virginia",
            "ActBlue",
            "Democratic"
        ],
        "products": [],
        "committee": "Hala For Virginia",
        "name": "HalaForVirginia.com",
        "email": "info@halaforvirginia.com",
        "subject": "Let us explain, Peter:",
        "date": "2021-08-31T15:31:06Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "15",
        "minute": "31",
        "domain": "halaforvirginia.com",
        "body": "Peter — In a moment, we’re going to ask you to chip in $3 to elect DemocratHala Ayala as Virginia’s first woman and first Afro-Latina Lt. Governor. Butfirst, let us explain why it's important at this very moment. We’re a littleover two months away from Election Day, and this race is heating up. But thesummer months are typically the worst for fundraising -- and this reallyhinders Hala’s ability to reach voters like you. And with a race that will beas close as this one, every vote and every dollar counts! There is so much onthe line: Voting rights, gun safety reforms, accessible health care, andstopping an extreme Republican takeover of our Commonwealth. So we’ll beblunt, Peter: If we can’t raise $8,500 by the end of the month, it’ll be thatmuch harder to stay ahead in this race. Chip in $3 today to help Hala keep upthe fight and WIN. »https://secure.actblue.com/donate/mc_hala_q32021_df?amount=3 Together, TeamHala ----------------------------------- Paid for by Hala For Virginia P.O.Box 7434, Woodbridge, VA 22195 www.halaforvirginia.com Hala Ayala is theDemocratic nominee running for Virginia Lt. Governor. As a lifelong Virginian,Hala understands where we've come from and embodies the diversity of ourfuture. She's running for Lt. Governor because she knows we have the power tomove forward together, and she knows what it'll take to get it done. Clickhere to receive fewer emails:https://secure.ngpvan.com/yrRgaDKQzUG8oNf61VhOYA2 Click here to unsubscribe:https://email.ngpvan.com/unsubscribeUnique/a234528a-c209-ec11-981f-501ac57ba3ed/458b2a4f-700a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMjEvMS84ODk2MyIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICI0NThiMmE0Zi03MDBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=3liKSHQCNLRGPUb7bjBdC0iAf7ztab73KcMruSUNelg=&id;=121252662.",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Erica Smith",
            "Richard Burr"
        ],
        "places": [
            "North Carolina",
            "Tar Heel State"
        ],
        "organizations": [
            "Erica for Us",
            "AmERICA Fund"
        ],
        "products": [],
        "committee": "Erica Smith for US Senate 2022",
        "name": "Erica Smith HQ",
        "email": "info@email.ericaforus.com",
        "subject": "re: The AmERICA Fund",
        "date": "2021-08-31T18:51:16Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "18",
        "minute": "51",
        "domain": "email.ericaforus.com",
        "body": "[1]Erica Smith Everything could change With Richard Burr retiring We deserve asenator who Is honest and inspiring. The moment is upon us [https://act.ericaforus.com/go/13097?refcode=em20210831-400&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1001&akid;=400%2E3698%2EXefqf6]To flip North Carolina blue, And elect a bold progressive In November 2022.Erica Smith has what it takes To build a coalition. A more inclusive Tar HeelState Has always been her mission. The only problem, friends? [https://act.ericaforus.com/go/13097?refcode=em20210831-400&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1002&akid;=400%2E3698%2EXefqf6]Fundraising is behind. To catch up before midnight Would bring some peace ofmind. And so the AmERICA Fund began! In people lies the power. We must raise$10,000 In less than 24 hours. Please help us reach our goal Let's leave thenay-sayers stunned — [https://act.ericaforus.com/go/13097?refcode=em20210831-400&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1003&akid;=400%2E3698%2EXefqf6]Will you rush $5 directly to [https://act.ericaforus.com/go/13097?refcode=em20210831-400&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1004&akid;=400%2E3698%2EXefqf6]The emergency AmERICA Fund? [https://act.ericaforus.com/go/13040?refcode=em20210831-400&amounts;=5%2C20%2C50%2C100%2C250%2C500%2C1000&t;=1005&akid;=400%2E3698%2EXefqf6]Donate Now » Contribute to Erica'scampaign:https://secure.actblue.com/donate/es-emails?refcode=em20210831-400-footer&t;=1006&refcode2;=400_3698_Xefqf6&akid;=400%2E3698%2EXefqf6This email was sent to dpwillis67@gmail.com. Email is the most important waywe keep in touch with people like you, so thank you for reading to the end.Small donors like you keep us going. To contribute via check, please addressto Erica for Us, P.O. Box 1236, Gaston, NC 27832. You can unsubscribe fromthis mailing list at any time:http://act.ericaforus.com/cms/unsubscribe/unsubscribe/?akid=400%2E3698%2EXefqf6PAID FOR BY Erica Smith for US Senate 2022",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Ron DeSantis",
            "Charlie Crist"
        ],
        "places": [
            "Florida"
        ],
        "organizations": [
            "Orlando Sentinel"
        ],
        "products": [],
        "committee": "Charlie Crist for Governor",
        "name": "Charlie Crist",
        "email": "info@charliecrist.com",
        "subject": "momentum",
        "date": "2021-08-31T20:18:07Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "20",
        "minute": "18",
        "domain": "charliecrist.com",
        "body": "What a month it’s been, friend! Multiple polls have shown us either beatingGov. Ron DeSantis or closing in on him, and our momentum has skyrocketed.Folks like you are powering this campaign to build a Florida for All, and Ireally can’t thank you enough. But now is when we need to dig in and keep thismomentum going. My finance team has set a lofty end-of-month goal to finishAugust strong, so can you chip in? It’d mean an awful lot to me. >>>https://secure.actblue.com/donate/cc-momentumeom?refcode=20210831_f_1_fl_nd&amount;=5 I know full well beating Gov.DeSantis won’t be a walk in the park. He has a huge money advantage over us,fueled by his right-wing billionaire backers: “DeSantis slips in some pollsbut still has a massive money advantage over Crist ...” - Orlando Sentinel Yetmy campaign has something all the dark money in the world can’t buy: peoplelike you. You know that every little bit adds up -- and you know that’s howwe’ll defeat Gov. DeSantis and his billionaire-funded war chest. Friend, can Icount on you today? Your first gift will help push us over the top and hit ourambitious end-of-month goal. If you can make a contribution, it’ll honestlymake all the difference! >>> https://secure.actblue.com/donate/cc-momentumeom?refcode=20210831_f_1_fl_nd&amount;=5 Thank you and God bless,Charlie DONATE >>> https://secure.actblue.com/donate/cc-momentumeom?refcode=20210831_f_1_fl_nd&amount;=5 Any contribution historyinformation in this email is based on our digital contribution recordsassociated with this email address. If you have donated with a different emailaddress, via mail or in another way -- thank you so much! Your contribution isreflected in our files and we truly appreciate your support. ---- Paid for andapproved by Charlie Crist, Democrat for Governor Charlie Crist for GovernorP.O. Box 1547 St. Petersburg, FL 33731 United States To unsubscribe, go to:unsubscribe:https://email.ngpvan.com/unsubscribeUnique/970dbd47-7307-ec11-981f-501ac57ba3ed/4fe27e1f-980a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMTIvMS85MTYxOSIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICI0ZmUyN2UxZi05ODBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=ggNjL4I-faRo4dvVw703xWKiJWLD0CH1NlGtyLBeYnE=&id;=109925474",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Joe Biden",
            "Nancy Pelosi",
            "Liz Cheney",
            "Marjorie Taylor Greene",
            "Donald Trump",
            "Kamala Harris",
            "dpwillis"
        ],
        "places": [
            "Afghanistan",
            "China",
            "America"
        ],
        "organizations": [
            "January 6 Witch Hunt Committee",
            "Democrat takeover",
            "Republicans",
            "Border Patrol",
            "Taliban"
        ],
        "products": [],
        "committee": "Greene for Congress",
        "name": "MTG & Nancy Pelosi",
        "email": "info@greene2020.com",
        "subject": "my phone number",
        "date": "2021-08-31T21:48:19Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "21",
        "minute": "48",
        "domain": "greene2020.com",
        "body": "Peter -- Joe Biden left Americans behind in Afghanistan to be taken hostage bythe Taliban. Now, to distract from his failure, the Democrats along with NancyPelosi, and Liz Cheney are demanding I hand over my phone records to theirJanuary 6 Witch Hunt Committee! Why? Because they're coming after members likeme who stood up for President Trump and against the Democrat takeover of ourelections. Make no mistake: this is nothing more than an attempt to hide ChinaJoe's impeachable activity like the Afghanistan debacle. But I'm not backingdown. JOE BIDEN MUST BE IMPEACHED. Not tomorrow. Not next week. Not next year.NOW! SIGN YOUR IMPEACH JOE BIDEN PETITION RIGHT AWAY After you sign, I'masking you to please consider going the extra mile by chipping in $100, $50,$25, $15 -- whatever you can most afford -- to help me \"Impeach Joe Biden\" andhelp me build momentum across America to IMPEACH JOE BIDEN. Joe Biden refusesto resign. Republicans must impeach him before China Joe can do any moredamage to America. SIGN YOUR IMPEACH JOE BIDEN PETITION RIGHT AWAY There is notime to delay. We must move swiftly to ensure that Joe Biden can no longerhurt our country and destroy it piece by piece. The case against Joe Biden inSTRONG. Consider President Biden's: Dereliction of duty in Afghanistan; andViolations of immigration law that has caused a national security crisis onour Southern border; In seven short months, Joe Biden has caused America tolose the respect of the entire world. The evidence is clear and his actionsare so egregious that he must be impeached. Joe Biden DISHONORED thesacrifices made by every American soldier who fought in the 20-year war,especially those who gave their life for the cause. Joe Biden LEFT BEHIND over10,000 American citizens to face the terrifying rule of the Taliban as theyimpose Sharia law across the country. No commander-in-chief should ever leaveAmericans behind! Joe Biden (along with Kamala Harris) VIOLATED ourimmigration laws, deprived our Border Patrol of manpower and resources, andcreated a national security crisis by allowing unknown foreign nationals intoour country who wish to do harm to Americans. That is why I am draftingArticles of Impeachment against President Joe Biden. Will you become a CitizenCoSponsor to urge your Representatives and Senators to get on board? TheTaliban have made a fool of Joe Biden. America's southern border is beingoverrun with hordes of illegal aliens. Our economy is crippled because of theChinese Covid bioweapon. The world is laughing at us and Joe Biden has fledinto hiding! China Joe must go. 75 million Americans are fed up with inaction.Will you join and become a citizen co-sponsor? I need you to join this fight:become a Citizen Co-Sponsor by signing your \"Impeach Joe Biden\" petition!After you sign, I'm asking you to please consider going the extra mile bychipping in $100, $50, $25, $15 -- whatever you can most afford -- to the\"Impeach Joe Biden Fund\" and help me build momentum across America to IMPEACHJOE BIDEN. The Biden Crime Family must be held accountable. So please, afteryou become a citizen co-sponsor to impeach Joe Biden, consider donating beforethe deadline. I'll keep you updated. -- Marjorie Taylor Greene Congresswoman(R-GA) Paid for by Greene for Congress This message was intended for:dpwillis67@gmail.com You were added to the system January 17, 2021. For moreinformation please follow the URL below:http://paracom.paramountcommunication.com/p/isP9SUqdNJ Follow the URL below toupdate your preferences or opt-out:http://paracom.paramountcommunication.com/p/osP9SUqdNJ To unsubscribe fromfuture mailings, send an email tomailto:unsub-66334947410-echo3-E2240AC653DEC38BD282404A7CA72CB0@emailsendr.net?Subject=Unsubscribe&body;=Please%20remove%20me%20from%20further%20mailingswith \"Unsubscribe\" as the subject line.",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Tom Nelson",
            "Donald Trump",
            "Ron Johnson"
        ],
        "places": [
            "Wisconsin",
            "Outagamie",
            "Washington",
            "Kaukauna"
        ],
        "organizations": [
            "Nelson for Wisconsin"
        ],
        "products": [],
        "committee": "Nelson for Wisconsin",
        "name": "Tom",
        "email": "info@nelsonforwi.com",
        "subject": "our people-powered campaign",
        "date": "2021-08-31T22:40:42Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "22",
        "minute": "40",
        "domain": "nelsonforwi.com",
        "body": "Iam running a campaign that I can be proud of. We are an unabashedly populistcampaign that supports policies that will benefit all Wisconsinites — and Iwouldn’t have it any other way. My campaign is people-powered, as it should bebecause I don’t want to owe anybody but voters when I win. That is why I needyour help. We still need to raise just over $1,200 in the next few hours. CanI count on you to chip in? [https://secure.actblue.com/donate/nelson-aug-eom?amount=10] https://secure.actblue.com/donate/nelson-aug-eom?amount=10[https://secure.actblue.com/donate/nelson-aug-eom?amount=10] Thank you forsupporting my campaign, Tom VOLUNTEER » [https://go.nelsonforwi.com/a/pledge-to-volunteer] DONATE » [https://secure.actblue.com/donate/nelson-footer?refcode=footer_button&amount;=25] Tom Nelson serves as County Executivefor Outagamie, one of the worst-hit COVID areas in the nation. Local officialshave been leading our country through the pandemic because Donald Trump andRon Johnson have failed. Tom is running for U.S. Senate because we need realleaders in Washington who will take COVID seriously. And if we can take on apandemic, we can take on anything. And if you can win in a red county sixtimes, you can win anywhere. If you’d like to unsubscribe, click here.[https://email.ngpvan.com/unsubscribeUnique/2a779680-ce09-ec11-981f-501ac57ba3ed/8b2bfb60-ac0a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMDYvMS84Njk2MCIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICI4YjJiZmI2MC1hYzBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=Z3vXWTIk_5AuN_a8Y0_pT8SWigt57yt766zVkADzHkk=&id;=117942571]https://twitter.com/NelsonforWI [https://twitter.com/NelsonforWI]https://www.instagram.com/nelsonforwi/[https://www.instagram.com/nelsonforwi/] https://www.facebook.com/NelsonForWI/[https://www.facebook.com/NelsonForWI/]https://secure.actblue.com/donate/nelson-footer?refcode=footer_image&amount;=25[https://secure.actblue.com/donate/nelson-footer?refcode=footer_image&amount;=25] Paid for by Nelson for Wisconsin Clickhere to unsubscribe from Tom Nelson's email list.[https://email.ngpvan.com/unsubscribeUnique/2a779680-ce09-ec11-981f-501ac57ba3ed/8b2bfb60-ac0a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMDYvMS84Njk2MCIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICI4YjJiZmI2MC1hYzBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=Z3vXWTIk_5AuN_a8Y0_pT8SWigt57yt766zVkADzHkk=&id;=117942571]Nelson for Wisconsin PO Box 361 Kaukauna, WI 54130 United States",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Tamara Bates",
            "Carol V. Abney"
        ],
        "places": [
            "Tennessee",
            "Nashville"
        ],
        "organizations": [
            "Tennessee Democratic Party",
            "DNC",
            "ASDC Best Practices Institute"
        ],
        "products": [],
        "committee": "Tennessee Democratic Party",
        "name": "Tamara Bates",
        "email": "tamara@tndp.org",
        "subject": "👀 Don't Miss Out",
        "date": "2021-08-31T21:04:14Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "21",
        "minute": "4",
        "domain": "tndp.org",
        "body": "https://www.mobilize.us/tndp/event/408597/[https://www.mobilize.us/tndp/event/408597/] Peter, TOMORROW, September 1st at7 pm CT, is our first Project Build Blue Academy training for candidates,campaign operatives, and anyone who wants to learn about community organizing.Representatives from the DNC and the ASDC Best Practices Institute will bejoining to teach attendees how to improve their ground game by learning aboutcampaign strategy, the basics of voter contact, GOTV, building local party andcommunity infrastructure, how to organize, and more. RSVP here 👇https://www.mobilize.us/tndp/event/408597/[https://www.mobilize.us/tndp/event/408597/] After you sign up, you'll receiveZoom instructions for this virtual event. We won't turn Tennessee blue if wedon't organize like hell, and this event is a great way to get trained upbefore 2022. Look forward to seeing you there, Tamara Bates PoliticalDirector, Tennessee Democratic Partyhttps://secure.actblue.com/donate/tndpemailgeneral[https://secure.actblue.com/donate/tndpemailgeneral]https://secure.actblue.com/donate/tndpemailgeneral[https://secure.actblue.com/donate/tndpemailgeneral]https://www.facebook.com/tndem [https://www.facebook.com/tndem]https://twitter.com/tndp [https://twitter.com/tndp]https://www.instagram.com/tndems/ [https://www.instagram.com/tndems/]https://secure.actblue.com/donate/tndpemailgeneral[https://secure.actblue.com/donate/tndpemailgeneral] Paid for by the TennesseeDemocratic Party, Carol V. Abney, Treasurer. Not authorized by any candidateor candidate's committee. Contributions or gifts to Tennessee Democratic Partyare not tax deductible. Tennessee Democratic Party 319 Plus Park BlvdNashville, TN 37217 United States unsubscribe:https://email.ngpvan.com/unsubscribeUnique/0b91239e-990a-ec11-981f-501ac57ba3ed/27d1f0e0-9e0a-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMDcvMS83NzEzNCIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICIyN2QxZjBlMC05ZTBhLWVjMTEtOTgxZi01MDFhYzU3YmEzZWQiLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=f-miS8PmmCXUHkUBQGb20B7cMqKJ1l6lYSuZ0hvpetc=&id;=109157879",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Miller-Meeks",
            "Biden",
            "Joe Biden",
            "Miller-Meeks"
        ],
        "places": [
            "Afghanistan",
            "Ottumwa",
            "IA"
        ],
        "organizations": [
            "Miller-Meeks for Congress",
            "Taliban"
        ],
        "products": [],
        "committee": "Miller-Meeks for Congress",
        "name": "Team Miller-Meeks",
        "email": "info@drmillermeeks.com",
        "subject": "Get him out!",
        "date": "2021-08-30T23:30:30Z",
        "year": "2021",
        "month": "8",
        "day": "30",
        "hour": "23",
        "minute": "30",
        "domain": "drmillermeeks.com",
        "body": "Miller-Meeks for Congress His time is done                                                                                                                   Friend, Biden’s incompetence inAfghanistan has led the Taliban back into power. How much more chaos has toensue before power is stripped from the very people who allowed thiscatastrophe to happen? PRESIDENT BIDEN NEEDS TO RESIGN President Biden and hisentire administration have chosen to trust a TERRORIST ORGANIZATION over ourown service members and intelligence experts. He has blood on his hands. I amDEMANDING ACCOUNTABILITY and calling on President Biden to resign asCommander-in-Chief. IMMEDIATELY.Are you with me? HOLD BIDEN ACCOUNTABLE Weneed a leader who takes responsibility and protects his citizens. We CANNOTkeep paying for the mistakes of an unequipped leader. Joe Biden’s time inoffice is done. God bless you, Congresswoman Miller-Meeks Paid for by Miller-Meeks for Congress Miller-Meeks for Congress P.O. Box 33 Ottumwa, IA 52501 Ifyou would like to send donation by mail, click here Don't want to receive ouremails anymore? Unsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Mike Braun",
            "Grace"
        ],
        "places": [],
        "organizations": [
            "Mike Braun for Indiana",
            "Mike Braun for Senate"
        ],
        "products": [],
        "committee": "Mike Braun for Indiana",
        "name": "Grace, Mike Braun Finance",
        "email": "mikeb@mikebraunsenate.com",
        "subject": "T-MINUS 24 HOURS",
        "date": "2021-08-30T22:08:13Z",
        "year": "2021",
        "month": "8",
        "day": "30",
        "hour": "22",
        "minute": "8",
        "domain": "mikebraunsenate.com",
        "body": "Mike Braun for Indiana Mike asked me to email you                                                                                                                   Hi friends, Mike knows thatyou have been a loyal patriot to him and our team in the past, so he wanted meto reach out. We only have 24 hours until our END ON MONTH GOAL, and we areWAY BEHIND. So, Mike is relying on his closest friends and donors to step up.We have gone through our lists and personally handpicked Conservative allieswho we are confident will step up. MIKE IS COUNTING ON YOU! SHOW YOURPATRIOTISM THIS IS IT! We know you want to take down the RADICAL LEFT justas much as we do. They are getting more “woke” by the day! Thank you for allthat you do, Grace Deputy Finance Director Mike Braun for Senate Paid for byMike Braun for Indiana Don't want to receive our emails anymore? Unsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Donald Trump",
            "Kevin McCarthy"
        ],
        "places": [
            "United States",
            "Purcellville",
            "VA"
        ],
        "organizations": [
            "Never Again PAC",
            "Treason Caucus",
            "Republicans"
        ],
        "products": [],
        "committee": "Never Again PAC",
        "name": "NeverAgainPAC.com",
        "email": "info@neveragainpac.com",
        "subject": "Drumroll please🥁",
        "date": "2021-08-29T20:02:43Z",
        "year": "2021",
        "month": "8",
        "day": "29",
        "hour": "20",
        "minute": "2",
        "domain": "neveragainpac.com",
        "body": "Earlier this month, we asked you to participate in a series of flash pollsabout the January 6 investigation. Well the results are in! Drumroll please…Thousands of you participated in our polls and the results were overwhelming.99% of respondents agree: Donald Trump, Kevin McCarthy, and Republicans whohad contact with Trump on January 6 must be subpoenaed. We agree. But we knowTrump and the Treason Caucus will do whatever it takes to escapeaccountability. We need your help to keep the pressure on and ensure theycomply with Pelosi's investigation. Chip in before our end-of-month deadlineto help us do it >> https://secure.actblue.com/donate/neveragain-aug21-eomPAID FOR BY NEVER AGAIN PAC Never Again PAC PO Box 2153 Purcellville, VA 20134United States If you no longer wish to receive emails from us, you canunsubscribe:https://email.everyaction.com/unsubscribeUnique/47624e15-7407-ec11-981f-501ac57ba3ed/1e2dc4b6-0309-ec11-981f-501ac57ba3ed?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9FQS9FQTAwNy8xLzkwMTkwIiwNCiAgIkRpc3RyaWJ1dGlvblVuaXF1ZUlkIjogIjFlMmRjNGI2LTAzMDktZWMxMS05ODFmLTUwMWFjNTdiYTNlZCIsDQogICJFbWFpbEFkZHJlc3MiOiAiZHB3aWxsaXM2N0BnbWFpbC5jb20iDQp9&hmac;=ujV525fFx7mcp9J4tZZg4WjtrZQ339rpOrUaw0P64yw=&id;=117934094.",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Miller-Meeks",
            "Mariannette",
            "CONGRESSWOMAN MILLER-MEEKS"
        ],
        "places": [],
        "organizations": [],
        "products": [],
        "committee": "Miller-Meeks for Congress",
        "name": "Team Miller-Meeks",
        "email": "info@drmillermeeks.com",
        "subject": "Hey there",
        "date": "2021-08-28T18:02:40Z",
        "year": "2021",
        "month": "8",
        "day": "28",
        "hour": "18",
        "minute": "2",
        "domain": "drmillermeeks.com",
        "body": "Miller-Meeks for Congress Please read                                                                                                                   FROM THE DESK OF CONGRESSWOMAN MILLER-MEEKS: Friend, you have (1) One Message on hold for you. This can't wait…It’spersonal and needs your attention! Please read Mariannette’s message. READTHE MESSAGE NOW Paid for by Miller-Meeks for Congress Miller-Meeks forCongress P.O. Box 33 Ottumwa, IA 52501 If you would like to send donation bymail, click here Don't want to receive our emails anymore? Unsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Marjorie Taylor Greene"
        ],
        "places": [],
        "organizations": [
            "Save America Stop Socialism PAC",
            "Democrats"
        ],
        "products": [],
        "committee": "Save America Stop Socialism PAC",
        "name": "Marjorie Taylor Greene",
        "email": "info@greene2020.com",
        "subject": "Your pressure is working!",
        "date": "2021-08-25T22:47:25Z",
        "year": "2021",
        "month": "8",
        "day": "25",
        "hour": "22",
        "minute": "47",
        "domain": "greene2020.com",
        "body": "Peter -- I just wanted to give you a quick update and let you know: yourpressure is working! We are going to keep fighting this every step of the wayagainst these Marxist bills that will destroy America. Be on the lookout formy updates so you can take immediate action against the Democrats and hold theline! Save America! Stop Communism! DEFEAT THE DEMOCRATS! -- Marjorie TaylorGreene Congresswoman (R-GA) P.S. Help me hold the line. I need patriots likeyou to stand with me. PAID FOR BY SAVE AMERICA STOP SOCIALISM PAC This messagewas intended for: dpwillis67@gmail.com You were added to the system January17, 2021. For more information please follow the URL below:http://paracom.paramountcommunication.com/p/iWqqRPedN0 Follow the URL below toupdate your preferences or opt-out:http://paracom.paramountcommunication.com/p/oWqqRPedN0 To unsubscribe fromfuture mailings, send an email tomailto:unsub-66258459761-echo3-7387908FA77C997B4F851215DCE1B220@emailsendr.net?Subject=Unsubscribe&body;=Please%20remove%20me%20from%20further%20mailingswith \"Unsubscribe\" as the subject line.",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Josh Hawley",
            "Joe Biden",
            "Peter"
        ],
        "places": [
            "Washington, D.C."
        ],
        "organizations": [
            "Josh Hawley for Senate"
        ],
        "products": [],
        "committee": "Josh Hawley for Senate",
        "name": "Team Hawley",
        "email": "josh@hawleyformo.com",
        "subject": "⏰DEADLINE TONIGHT",
        "date": "2021-08-31T15:32:40Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "15",
        "minute": "32",
        "domain": "hawleyformo.com",
        "body": "Peter, We are reaching out to you because we can’t win this battle withoutyou! Right now, we still need to raise $1,239 today! You can help stop JoeBiden’s failing agenda and take back the Senate with a contribution today!Josh continues to push an America First agenda in Washington, D.C. and heneeds your help! - Team Hawley Help us WIN the battle Paid for by Josh Hawleyfor Senate Click here to unsubscribe.",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Kevin Hern",
            "Joe Biden",
            "Peter",
            "Pelosi"
        ],
        "places": [],
        "organizations": [],
        "products": [],
        "committee": "Hern For Congress",
        "name": "Kevin Hern",
        "email": "info@hernforcongress.com",
        "subject": "CRITICAL UPDATE",
        "date": "2021-08-31T13:47:42Z",
        "year": "2021",
        "month": "8",
        "day": "31",
        "hour": "13",
        "minute": "47",
        "domain": "hernforcongress.com",
        "body": "96 Hey Peter, it's Kevin. We’re just a few hours away from the end of August,and what a month it’s been... From Joe Biden’s gross mismanagement of theAfghanistan withdrawal to Pelosi’s budget-busting $3.5 trillion“infrastructure” plan, one thing has become crystal clear – the Democrats mustbe stopped. Will you help us take back the House next year by making agenerous donation right now? You can use this safe and secure link tocontribute:https://secure.winred.com/kevinhern/e-b02c8f6c6defa0ee?utm_source=Link&u;tm_campaign=kh&utm;_medium=Email&utm;_content=e_eom_aug_deadline_iphone&ut;m_agency=alpha https://secure.winred.com/kevinhern/e-b02c8f6c6defa0ee Our End-of-the-Month deadline is at midnight tonight, and this is the last time I’llreach out to remind you. So please, don’t hesitate. Time’s almost up! Thanks,Kevin Hern Sent from my iPhone https://www.facebook.com/KevinRHern/https://twitter.com/krhern id:2021-08-25-13:31:07:087t Paid For By Hern ForCongressUnsubscribe:http://ci.criticalimpact.com/unsubscribe1.cfm?eid=282e4263e04f74c17c94c760ea83e7c0&c;=34143&jid;=a375191a23a100e1",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [],
        "places": [
            "Washington, DC",
            "US"
        ],
        "organizations": [
            "Republican National Committee",
            "GOP"
        ],
        "products": [],
        "committee": "Republican National Committee",
        "name": "Trump Member Services (via GOP)",
        "email": "info@theredmajority.com",
        "subject": "Here’s why we’re reaching out →",
        "date": "2021-08-29T22:45:24Z",
        "year": "2021",
        "month": "8",
        "day": "29",
        "hour": "22",
        "minute": "45",
        "domain": "theredmajority.com",
        "body": "We’re waiting for you, Friend. | Please don't share. Join the top 1% of all supporters and become a Trump Life Member! Friend, URGENT! This message is for your eyes only, Friend. Please don't share. Join the top 1% of all supporters and become a Trump Life Member! Please contribute $45 or more by 11:59 PM TONIGHT to become an Official 2021 Trump Life Member. >> CONTRIBUTE $250 >> CONTRIBUTE $100 >> CONTRIBUTE $50 >> CONTRIBUTE $45 >> CONTRIBUTE ANY AMOUNT >> Thank you, GOP CONTRIBUTE NOW >> Paid for by the Republican National Committee Not authorized by any candidate or candidate's committee. www.GOP.com Republican National Committee (RNC), 310 1st Street SE Washington, DC, 20003-1885, US Privacy Policy Unsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Ted Budd"
        ],
        "places": [
            "Afghanistan",
            "Raleigh, NC"
        ],
        "organizations": [],
        "products": [],
        "committee": "Ted Budd for Senate",
        "name": "Ted Budd",
        "email": "info@tedbudd.com",
        "subject": "Join Me In Prayer For Afghanistan",
        "date": "2021-08-21T14:25:14Z",
        "year": "2021",
        "month": "8",
        "day": "21",
        "hour": "14",
        "minute": "25",
        "domain": "tedbudd.com",
        "body": "Peter, I am asking a favor from everyone on Team Budd. Will you please join mein prayer for the people of Afghanistan? What is happening is a devastatingsituation. Thousands of innocent men, women, and children are being trappedand brutally beaten by the Taliban. We need God to intervene and heal thistragedy. Join me in asking God to put an end to these Islamic extremists andbring all Americans and our allies to safety. Matthew 18:19-20 says, “Again Isay to you, if two of you agree on earth about anything they ask, it will bedone for them by my Father in heaven. For where two or three are gathered inmy name, there am I among them.” Let's join together and make our requestsknown to God right now. Please forward this to your family and friends, andhave them join us as well. God Bless, Ted Budd Paid for by Ted Budd for SenatePO Box 97127, Raleigh, NC 27624 UNSUBSCRIBE https://tedbudd.cmail20.com/t/r-u-tlukkyil-blhlumhlr-t/",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Joe Biden",
            "President Trump",
            "Peter",
            "President Donald J. Trump",
            "dpwillis67@gmail.com"
        ],
        "places": [],
        "organizations": [
            "NRSC",
            "WIN"
        ],
        "products": [],
        "committee": "the NRSC",
        "name": "Trump Alert (via NRSC)",
        "email": "info@standingstrongamerica.com",
        "subject": "We agree.",
        "date": "2021-08-21T21:04:27Z",
        "year": "2021",
        "month": "8",
        "day": "21",
        "hour": "21",
        "minute": "4",
        "domain": "standingstrongamerica.com",
        "body": "NRSC Under Joe Biden, all of President Trump’s accomplishments for theAmerican People are being DISMANTLED. Peter, Did you see what President Trumpsaid? He’s right. Under Joe Biden, all of President Trump’s accomplishmentsfor the American People are being DISMANTLED. We’re calling on YOU to step upand show our FAVORITE PRESIDENT that REAL America First Patriots will NEVERFORGET. Please add your name IMMEDIATELY to the official list of patriots whowill ALWAYS stand with President Donald J. Trump. >> STAND WITH PRESIDENTTRUMP SUPPORTER: dpwillis67@gmail.com DEADLINE: RIGHT NOW ADD YOUR NAME >>Thank you, NRSC If you want to help Republicans TAKE BACK THE SENATE, text WINto 55404 to receive mobile alerts! Message and data rates may apply. Text\"STOP\" to opt-out. T&C;/Privacy Policy. Paid for by the NRSC. Not authorizedby any candidate or candidate's committee. www.NRSC.org Contributions to theNRSC are not deductible as charitable contributions for federal income taxpurposes. NRSC, 425 2nd Street NE, Washington D.C. 20002 Don't want to receiveany more of our emails? We hate to see you go, but you can unsubscribe here .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Tim Scott"
        ],
        "places": [
            "Charleston",
            "South Carolina"
        ],
        "organizations": [
            "Senate GOP",
            "Fox News",
            "Democrats"
        ],
        "products": [],
        "committee": "Tim Scott for Senate",
        "name": "Senate GOP Alerts",
        "email": "info@makingamericathegreatest.com",
        "subject": "Did you see what Fox News said?",
        "date": "2021-08-19T19:07:45Z",
        "year": "2021",
        "month": "8",
        "day": "19",
        "hour": "19",
        "minute": "7",
        "domain": "makingamericathegreatest.com",
        "body": "This is our best chance to stop the Democrats                                                                             Friend Did you see what Fox Newssaid? The Senate GOP has successfully pressured the Democrats on some oftheir most radical policies. We forced their hand on Critical Race Theory, theGreen New Deal, and even using your tax dollars on abortions. STOP THE RADICALDEMOCRAT AGENDA >>> CHIP IN NOW Now, the Democrats are scrambling. This isour chance to keep the pressure up and stop them from passing theirprogressive wish list.Will you chip in $5, $10, $25, or anything you can tohelp us stop their radical left-wing agenda? Senate GOP Alerts STOP THERADICAL DEMOCRAT AGENDA >>> CHIP IN NOW PAID FOR BY TIM SCOTT FOR SENATE 1405ASHLEY RIVER ROAD CHARLESTON, SC 29407 Don't want to receive any more of ouremails? Click here to unsubscribe .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Biden",
            "Trump"
        ],
        "places": [
            "Afghanistan"
        ],
        "organizations": [
            "NRSC"
        ],
        "products": [],
        "committee": "the NRSC",
        "name": "Trump Alert (via NRSC)",
        "email": "info@makingamericathegreatest.com",
        "subject": "Trump to speak TONIGHT!",
        "date": "2021-08-18T01:05:43Z",
        "year": "2021",
        "month": "8",
        "day": "18",
        "hour": "1",
        "minute": "5",
        "domain": "makingamericathegreatest.com",
        "body": "NRSC President Trump will be on TV TONIGHT to discuss Biden’s DISASTER inAfghanistan? Friend, President Trump will be on TV TONIGHT to discuss Biden’sDISASTER in Afghanistan? Will you watch President Trump TONIGHT on TV? YES ➞NO ➞ Thank you, NRSC ANSWER NOW >> If you want to help Republicans TAKE BACKTHE SENATE, text WIN to 55404 to receive mobile alerts! Message and data ratesmay apply. Text \"STOP\" to opt-out. T&C;/Privacy Policy. Paid for by the NRSC.Not authorized by any candidate or candidate's committee. www.NRSC.orgContributions to the NRSC are not deductible as charitable contributions forfederal income tax purposes. NRSC, 425 2nd Street NE, Washington D.C. 20002Don't want to receive any more of our emails? We hate to see you go, but youcan unsubscribe here .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [],
        "places": [
            "Washington, DC",
            "US"
        ],
        "organizations": [
            "Republican National Committee",
            "GOP"
        ],
        "products": [],
        "committee": "Republican National Committee",
        "name": "Trump Member Services (via GOP)",
        "email": "info@theredmajority.com",
        "subject": "Here’s why we’re reaching out →",
        "date": "2021-08-18T22:15:48Z",
        "year": "2021",
        "month": "8",
        "day": "18",
        "hour": "22",
        "minute": "15",
        "domain": "theredmajority.com",
        "body": "We’re waiting for you, Friend. | Please don't share. Join the top 1% of all supporters and become a Trump Life Member! Friend, URGENT! This message is for your eyes only, Friend. Please don't share. Join the top 1% of all supporters and become a Trump Life Member! Please contribute $45 or more by 11:59 PM TONIGHT to become an Official 2021 Trump Life Member. >> CONTRIBUTE $250 >> CONTRIBUTE $100 >> CONTRIBUTE $50 >> CONTRIBUTE $45 >> CONTRIBUTE ANY AMOUNT >> Thank you, GOP CONTRIBUTE NOW >> Paid for by the Republican National Committee Not authorized by any candidate or candidate's committee. www.GOP.com Republican National Committee (RNC), 310 1st Street SE Washington, DC, 20003-1885, US Privacy Policy Unsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [],
        "places": [
            "Washington, DC",
            "US"
        ],
        "organizations": [
            "Republican National Committee",
            "GOP"
        ],
        "products": [],
        "committee": "Republican National Committee",
        "name": "Trump Member Services (via GOP)",
        "email": "info@ourdefenseofamerica.com",
        "subject": "We’re saving the TOP SPOT for YOU",
        "date": "2021-08-17T14:05:19Z",
        "year": "2021",
        "month": "8",
        "day": "17",
        "hour": "14",
        "minute": "5",
        "domain": "ourdefenseofamerica.com",
        "body": "We’re waiting for you, Friend. | Please don't share. Join the top 1% of all supporters and become a Trump Life Member! Friend, URGENT! This message is for your eyes only, Friend. Please don't share. Join the top 1% of all supporters and become a Trump Life Member! Please contribute $45 or more by 11:59 PM TONIGHT to become an Official 2021 Trump Life Member. >> CONTRIBUTE $250 >> CONTRIBUTE $100 >> CONTRIBUTE $50 >> CONTRIBUTE $45 >> CONTRIBUTE ANY AMOUNT >> Thank you, GOP CONTRIBUTE NOW >> Paid for by the Republican National Committee Not authorized by any candidate or candidate's committee. www.GOP.com Republican National Committee (RNC), 310 1st Street SE Washington, DC, 20003-1885, US Privacy Policy Don't want to receive any more of our emails?Click here to unsubscribe .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Josh Mandel"
        ],
        "places": [
            "Mayfield Heights",
            "OH"
        ],
        "organizations": [
            "Team Josh",
            "Citizens for Josh Mandel, Inc.",
            "Justice Opportunity Strength Honor PAC",
            "Shelby County Republican Party Federal Account",
            "Mandel for Senate"
        ],
        "products": [],
        "committee": "Team Josh",
        "name": "Team Josh",
        "email": "info@joshmandel2022.com",
        "subject": "LAST CHANCE",
        "date": "2021-08-16T20:02:25Z",
        "year": "2021",
        "month": "8",
        "day": "16",
        "hour": "20",
        "minute": "2",
        "domain": "joshmandel2022.com",
        "body": "Peter, Did you see our messages? We FAILED to hit yesterday’s deadline goal,falling 79 patriots short. That’s why we haveEXTENDED the mid-monthfundraising deadline until midnight tonight. You don’t have much time, youmust act NOW.Join the fight. >> DONATE: <> <> <> <> We MUST hold theDemocrats accountable for their blatant abuse of power and disregard for ourfreedom, but we can’t do it without you.Stand with Josh Mandel NOW. >>> Thankyou, Team Josh Paid for by Team Josh A joint fundraising committee authorizedby and composed of Citizens for Josh Mandel, Inc., Justice OpportunityStrength Honor PAC, and Shelby County Republican Party Federal Account. PO Box24875, Mayfield Heights, OH 44124 This email was sent to dpwillis67@gmail.com. Don't want to receive these emails anymore?Unsubscribe Mandel for Senate,P. O. BOX 24875, MAYFIELD HEIGHTS, OH 44124",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Donald Trump"
        ],
        "places": [
            "Florida",
            "Arlington",
            "VA"
        ],
        "organizations": [
            "Save America",
            "Make America Great Again PAC",
            "Save America JFC"
        ],
        "products": [
            "Official Trump Cards"
        ],
        "committee": "Save America JFC",
        "name": "DonaldJTrump.com",
        "email": "info@ourdefenseofamerica.com",
        "subject": "President Trump needs your input",
        "date": "2021-08-14T20:14:07Z",
        "year": "2021",
        "month": "8",
        "day": "14",
        "hour": "20",
        "minute": "14",
        "domain": "ourdefenseofamerica.com",
        "body": "Tell President Trump what you think. | We're about to launch our Official Trump Cards, which will be reserved for President Trump's STRONGEST supporters. Friend, We're about to launch our Official Trump Cards, which will be reserved for President Trump's STRONGEST supporters, and we have some very exciting news to share with you. We recently met with the President in his Florida office and showed him four designs. Originally we were planning on releasing just one design, but when President Trump saw the cards on his desk, he said,“These are BEAUTIFUL. We should let the American People decide - they ALWAYS know best!” So, Friend, what do you think? We're counting ALL responses until 11:59 PM TONIGHT. Please cast your vote below for our brand new Official Trump Card. President Trump always values your input, and he has made it clear that YOUR voice is the ONLY one that matters. We're updating the President the results first thing TOMORROW morning, and we know he's going to ask which card you voted for. Don't let him down. Please vote for your favorite Trump Card by 11:59 PM TONIGHT to make sure President Trump sees your vote. Thank you, Team Trump Paid for by Save America JFC, a joint fundraising committee of Save America and Make America Great Again PAC. Not authorized by any candidate or candidate's committee. Donaldjtrump.com Save America, PO Box 13570, Arlington, VA 22219 Privacy Policy Don't want to receive any more of our emails? Click here to unsubscribe .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Marco Rubio",
            "Peter"
        ],
        "places": [
            "Florida",
            "Miami"
        ],
        "organizations": [
            "Marco Rubio for Senate"
        ],
        "products": [],
        "committee": "Marco Rubio for Senate",
        "name": "Marco Rubio (iPhone)",
        "email": "info@bestamericanow.com",
        "subject": "This will be quick",
        "date": "2021-08-13T21:02:10Z",
        "year": "2021",
        "month": "8",
        "day": "13",
        "hour": "21",
        "minute": "2",
        "domain": "bestamericanow.com",
        "body": "Peter it’s Marco. I only have a few minutes but I wanted to let you know Ihave an important deadline coming up. I only have a couple days left and weare going to be short. This situation is no joke and missing our deadlinecould mean Florida will flipBLUE. FLIP THE SENATE KEEP FLORIDA RED Don’tmiss this chance to keep Florida RED today. Talk soon, Marco Rubio Paid for byMarco Rubio for Senate P.O. Box 661537 Miami, FL 33266 Privacy Policy Don'twant to receive any more of our emails?Click here to unsubscribe .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Tim Scott",
            "Peter"
        ],
        "places": [
            "Charleston",
            "SC"
        ],
        "organizations": [
            "Tim Scott for Senate"
        ],
        "products": [],
        "committee": "Tim Scott for Senate",
        "name": "Tim Scott",
        "email": "info@standingstrongamerica.com",
        "subject": "I hate to ask, but will you be one of the final 4 donors I need to reach my 8/14 goal?",
        "date": "2021-08-14T13:06:32Z",
        "year": "2021",
        "month": "8",
        "day": "14",
        "hour": "13",
        "minute": "6",
        "domain": "standingstrongamerica.com",
        "body": "Please help me reach my goal.                                                                             Hey Peter, it's Tim Scott. I hate to ask, butwill you be one of the final 4 donors I need to reach my 8/14 goal? If so,here's a link: https://secure.winred.com/tim-scott-for-senate/-821 HELP MEREACH MY GOAL Thanks, Tim Scott PAID FOR BY TIM SCOTT FOR SENATE 1405 ASHLEYRIVER ROAD CHARLESTON, SC 29407 Don't want to receive any more of our emails?Click here to unsubscribe .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Charlie Crist",
            "Nikki Fried",
            "Stephanie Murphy",
            "Ron DeSantis",
            "Brice"
        ],
        "places": [
            "Fort Lauderdale"
        ],
        "organizations": [
            "Team Ron Be Gone",
            "Ron Be Gone, Inc."
        ],
        "products": [],
        "committee": "Ron Be Gone, Inc.",
        "name": "Brice Barnes",
        "email": "info@e.ronbegone.com",
        "subject": "TONIGHT (Charlie Crist + Nikki Fried)",
        "date": "2021-08-12T17:31:48Z",
        "year": "2021",
        "month": "8",
        "day": "12",
        "hour": "17",
        "minute": "31",
        "domain": "e.ronbegone.com",
        "body": "Friends, All of us here at Team Ron Be Gone are so grateful for yourincredible grassroots support. That’s why we’re inviting you to a specialevent TONIGHT at 6PM EST! ⬇️ “Join us for a special event”, images and namesof guests, chip in anything to attend → (https://act.ronbegone.com/go/1948?t=1002&akid;=428%2E564421%2EMyMOXh ) Comejoin Charlie Crist, Nikki Fried, Rep. Stephanie Murphy, and the hilarious castof 'Whose Line Is It Anyway' and listen in as we discuss our strategy to takedown Ron DeSantis. The best part? Chip in ANYTHING to attend! » (https://act.ronbegone.com/go/1949?t=1003&akid;=428%2E564421%2EMyMOXh ) CHIP INANYTHING TO SIGN UP » (https://act.ronbegone.com/go/1949?t=1004&akid;=428%2E564421%2EMyMOXh ) See yousoon, Brice ------------------ Paid for by Ron Be Gone, Inc. www.ronbegone.comNot authorized by any candidate or candidate's committee. P.O. Box 30295, FortLauderdale, FL 33303 Click here to request fewer emails:https://act.ronbegone.com/signup/fewer-emails/?t=1001&akid;=428%2E564421%2EMyMOXh Click here to unsubscribe:https://act.ronbegone.com/unsubscribe/unsubscribe/?akid=428%2E564421%2EMyMOXh",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Joe Biden",
            "President Trump"
        ],
        "places": [],
        "organizations": [
            "NRSC",
            "Senate",
            "Republicans"
        ],
        "products": [],
        "committee": "the NRSC",
        "name": "NRSC Alerts",
        "email": "info@bestamericanow.com",
        "subject": "Joe Biden is a LIAR",
        "date": "2021-08-17T22:31:17Z",
        "year": "2021",
        "month": "8",
        "day": "17",
        "hour": "22",
        "minute": "31",
        "domain": "bestamericanow.com",
        "body": "NRSC Do you think Joe Biden should resign as President of the United States? 🚨BREAKING NEWS 🚨 Peter, Joe Biden just went on national TV and BLAMED PresidentTrump. Joe Biden is a LIAR – do you think he should resign as President of theUnited States? Do you think Joe Biden should resign as President of the UnitedStates? YES ➞ NO ➞ Thank you, NRSC TAKE THE POLL >> If you want to helpRepublicans TAKE BACK THE SENATE, text WIN to 55404 to receive mobile alerts!Message and data rates may apply. Text \"STOP\" to opt-out. T&C;/Privacy Policy.Paid for by the NRSC. Not authorized by any candidate or candidate'scommittee. www.NRSC.org Contributions to the NRSC are not deductible ascharitable contributions for federal income tax purposes. NRSC, 425 2nd StreetNE, Washington D.C. 20002 Don't want to receive any more of our emails? Wehate to see you go, but you can unsubscribe here .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Dr. Anthony Fauci",
            "Peter",
            "Jared Borg",
            "Josh Mandel",
            "Dpwillis"
        ],
        "places": [],
        "organizations": [
            "Team Mandel",
            "Chinese Communist Party",
            "Citizens for Josh Mandel, Inc.",
            "Justice Opportunity Strength Honor PAC",
            "Shelby County Republican Party Federal Account"
        ],
        "products": [],
        "committee": "Team Josh",
        "name": "Jared Borg, Deputy Campaign Manager (via Team Mandel)",
        "email": "info@joshmandel2022.com",
        "subject": "Fauci is COMPROMISED",
        "date": "2021-08-10T19:30:17Z",
        "year": "2021",
        "month": "8",
        "day": "10",
        "hour": "19",
        "minute": "30",
        "domain": "joshmandel2022.com",
        "body": "Peter, After a YEAR of lying to the American people, it has become clear thatno one in our government is more compromised than Dr. Anthony Fauci. Fact:Fauci is the highest-paid employee in the ENTIRE federal government, but it isclear that he is being controlled by the Chinese Communist Party and he willdo whatever it takes to protect them. This begs the question, which governmentpays him more? U.S. CHINA As one of our TOP supporters, we need to hear yourinput ASAP, Peter. Stand with Josh Mandel and take the poll NOW. >>> Thankyou, Jared Borg, Deputy Campaign Manager (via Team Mandel) Paid for by TeamJosh A joint fundraising committee authorized by and composed of Citizens forJosh Mandel, Inc., Justice Opportunity Strength Honor PAC, and Shelby CountyRepublican Party Federal Account. PO Box 24875, Mayfield Heights, OH 44124This email was sent to dpwillis67@gmail.com . Don't want to receive theseemails anymore?Unsubscribe Mandel for Senate, P. O. BOX 24875, MAYFIELDHEIGHTS, OH 44124",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Nancy Pelosi",
            "Miller-Meeks"
        ],
        "places": [
            "Iowa",
            "America"
        ],
        "organizations": [
            "Miller-Meeks for Congress"
        ],
        "products": [],
        "committee": "Miller-Meeks for Congress",
        "name": "Congresswoman Miller-Meeks",
        "email": "info@drmillermeeks.com",
        "subject": "I know firsthand",
        "date": "2021-08-08T21:45:02Z",
        "year": "2021",
        "month": "8",
        "day": "8",
        "hour": "21",
        "minute": "45",
        "domain": "drmillermeeks.com",
        "body": "Miller-Meeks for Congress An attack on ALL people.                                                                                                                   Friend, Nancy Pelosi’sattack on my election win wasn’t just an attack on the people of Iowa, but anattack on every single American. Nancy Pelosi has made it clear that her onlypriority is furthering her own agenda, no matter what. STOP PELOSI Here’swhat America looks like under Pelosi’s leadership: * Countless ILLEGALIMMIGRANTS are flooding into the country. * INFLATION is hitting record highs.* Anti-Science MASK MANDATES are once again popping up in cities across thecountry. It is downright disgraceful. DONATE TO STOP THE HYPOCRISY! We needyour support if we are going to Flip the House and Fire Pelosi. God Bless,Congresswoman Miller-Meeks Paid for by Miller-Meeks for Congress Miller-Meeksfor Congress P.O. Box 33 Ottumwa, IA 52501 If you would like to send donationby mail, click here Don't want to receive our emails anymore? Unsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "President Trump",
            "Peter"
        ],
        "places": [
            "Alabama"
        ],
        "organizations": [
            "NRSC"
        ],
        "products": [],
        "committee": "NRSC",
        "name": "Trump Rally Announcement",
        "email": "info@standingstrongamerica.com",
        "subject": "Did you hear the news?",
        "date": "2021-08-09T20:18:53Z",
        "year": "2021",
        "month": "8",
        "day": "9",
        "hour": "20",
        "minute": "18",
        "domain": "standingstrongamerica.com",
        "body": "NRSC President Trump just announced his NEXT RALLY! Don’t believe us? See foryourself: TRUMP RALLY ALERT Peter, Did you hear the news? President Trump justannounced his NEXT RALLY! Don’t believe us? See for yourself: With thePresident headed to Alabama soon, it got us thinking – if President Trump cameto YOUR STATE, would you attend his rally? DO YOU WANT TO ATTEND AN UPCOMINGTRUMP RALLY? YES NO TAKE THE POLL ➞ Thanks, NRSC TAKE THE POLL ➞ If youwant to help Republicans TAKE BACK THE SENATE, text WIN to 55404 to receivemobile alerts! Message and data rates may apply. Text \"STOP\" to opt-out.T&C;/Privacy Policy. Paid for by the NRSC. Not authorized by any candidate orcandidate's committee. www.NRSC.org Contributions to the NRSC are notdeductible as charitable contributions for federal income tax purposes. NRSC,425 2nd Street NE, Washington D.C. 20002 Don't want to receive any more of ouremails? We hate to see you go, but you can unsubscribe here .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Annette Hyde",
            "Nick Freitas"
        ],
        "places": [
            "VA-30"
        ],
        "organizations": [
            "Moms Demand Action",
            "Everytown"
        ],
        "products": [],
        "committee": "Friends of Nick Freitas",
        "name": "Team Freitas",
        "email": "team@nickforva.com",
        "subject": "We need your help 👀👀",
        "date": "2021-08-30T19:07:21Z",
        "year": "2021",
        "month": "8",
        "day": "30",
        "hour": "19",
        "minute": "7",
        "domain": "nickforva.com",
        "body": "ALERT: RADICAL OPPONENT IN VA-30 Friend, Our opponent, Annette Hyde, has said,“no one wants to take your guns” and that she supports our 2A rights but oncloser inspection her actions don’t match her words. She founded a localchapter of Moms Demand Action, an anti-second amendment organization and theirfounder is personally hosting fundraisers for her. She was also endorsed bythe gun-control lobbying group, Everytown. Rush in $20 now to protect ourSecond Amendment rights >>> Nick needs your support to fight back againstHyde and her socialist allies. We’re still $10,000 short of our goal. Will youhelp us catch up,Friend? CHIP IN $25 CHIP IN $50 CHIP IN $100 CHIP IN $250Hurry, if we miss this URGENT deadline we could be handing over our districtto gun-grabbing socialists.Chip in and protect the Commonwealth here >>>Thank you, Team Freitas CONTRIBUTE Paid for by Friends of Nick Freitas Thisemail was sent to dpwillis67@gmail.com . Don't want to receive these emailsanymore?Unsubscribe Nick Freitas, P.O. Box 1000",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Josh Mandel"
        ],
        "places": [
            "Silicon Valley",
            "Ohio",
            "Mayfield Heights"
        ],
        "organizations": [
            "Big Tech",
            "Citizens for Josh Mandel, Inc.",
            "Justice Opportunity Strength Honor PAC",
            "Shelby County Republican Party Federal Account",
            "Mandel for Senate"
        ],
        "products": [],
        "committee": "Team Josh",
        "name": "Josh Mandel",
        "email": "info@joshmandel2022.com",
        "subject": "Big Tech 🤝 The Democrats",
        "date": "2021-08-06T21:15:06Z",
        "year": "2021",
        "month": "8",
        "day": "6",
        "hour": "21",
        "minute": "15",
        "domain": "joshmandel2022.com",
        "body": "Peter, Every day MILLIONS of conservative Americans are being silenced andcensored by Big Tech elites in Silicon Valley, simply because they do notcomply with the radical left’s socialist agenda. One thing is clear: Big Techcensorship is out of control. This is not only un-American, it directlyviolates our Bill of Rights. That’s why I am calling on ALL patriots to standwith me in my fight to win the U.S. Senate race in the great state of Ohio, soI can fight back and defend our God-given rights.Take a stand NOW. >>>Supporter: Peter Deadline: MIDNIGHT Join the fight NOW We MUST send a loudand clear message to Big Tech and the radical left that the American peoplewill ALWAYS fight to defend our rights. Can I count on your support, Peter?Take a stand NOW. >>> Thank you, Josh Mandel Paid for by Team Josh A jointfundraising committee authorized by and composed of Citizens for Josh Mandel,Inc., Justice Opportunity Strength Honor PAC, and Shelby County RepublicanParty Federal Account. PO Box 24875, Mayfield Heights, OH 44124 This email wassent to dpwillis67@gmail.com . Don't want to receive these emailsanymore?Unsubscribe Mandel for Senate, P. O. BOX 24875, MAYFIELD HEIGHTS, OH44124",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Josh Hawley",
            "Peter"
        ],
        "places": [],
        "organizations": [
            "Fox News",
            "Team Hawley",
            "Josh Hawley for Senate"
        ],
        "products": [],
        "committee": "Josh Hawley for Senate",
        "name": "Team Hawley",
        "email": "josh@hawleyformo.com",
        "subject": "Did you catch Josh on Fox?",
        "date": "2021-08-17T15:30:32Z",
        "year": "2021",
        "month": "8",
        "day": "17",
        "hour": "15",
        "minute": "30",
        "domain": "hawleyformo.com",
        "body": "Peter, Last week, Josh joined Fox News to talk about the recently passed\"infrastructure bill.\" The bill isn't about infrastructure — this bill isabout woke politics and a left-wing social agenda. Why else would it includelanguage about gender identity or the green new deal? WATCH CLIP BELOW Joshsaid — “This is a Radical Left woke politics bill that has stuff in it likegender identity mandates.” Watch his full interview HERE . We need to focus onthe kitchen table issues like inflation and taxes. Not wokeism! DONATE TO TEAMHAWLEY —Team Hawley Paid for by Josh Hawley for Senate Click here tounsubscribe.",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Nicole Malliotakis",
            "Cuomo"
        ],
        "places": [
            "New York",
            "Staten Island"
        ],
        "organizations": [
            "Nicole for New York (Federal)"
        ],
        "products": [],
        "committee": "Nicole for New York (Federal)",
        "name": "Nicole Malliotakis",
        "email": "info@nicolemalliotakis.com",
        "subject": "Enough Cuomo, Resign!",
        "date": "2021-08-06T17:41:49Z",
        "year": "2021",
        "month": "8",
        "day": "6",
        "hour": "17",
        "minute": "41",
        "domain": "nicolemalliotakis.com",
        "body": "Nicole for New York (Federal) New Yorkers Want Him Gone!                                                                                                                    Friend, Enough isenough. Governor Cuomo is a complete disgrace and has proven that he is unfitto run the great state of New York. It’s time for him to resign. As a NewYorker, I am FURIOUS! After spending the past year completely bungling ourstate’s COVID response and now being accused of assaulting 11 women, it’s pasttime for Cuomo to go. IMPEACH CUOMO! Cuomo must go, for the good of all NewYorkers. Contribute today to IMPEACH CUOMO! God bless you and God bless NewYork, Rep. Nicole Malliotakis Paid for by Nicole for New York (Federal) Nicolefor New York (Federal) P.O. Box 60487 Staten Island, NY 10306 Don't want toreceive our emails anymore? Unsubscribe",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [],
        "places": [
            "Wisconsin",
            "Middleton"
        ],
        "organizations": [
            "The Republican Party of Wisconsin"
        ],
        "products": [],
        "committee": "The Republican Party of Wisconsin",
        "name": "Team WisGOP",
        "email": "info@wisgop.org",
        "subject": "Secure Our Borders!!",
        "date": "2021-08-10T15:40:58Z",
        "year": "2021",
        "month": "8",
        "day": "10",
        "hour": "15",
        "minute": "40",
        "domain": "wisgop.org",
        "body": "This message was intended for: dpwillis67@gmail.com You were added to thesystem May 22, 2018. For more information please follow the URL below:http://email.granitelists.com/p/ism_fJtdNt Follow the URL below to update yourpreferences or opt-out: http://email.granitelists.com/p/osm_fJtdNt Tounsubscribe from future mailings, send an email tomailto:unsub-66089474458-echo3-8214420C71EF3CE64AF701C3C178DCB0@emailsendr.net?Subject=Unsubscribe&body;=Please%20remove%20me%20from%20further%20mailingswith \"Unsubscribe\" as the subject line. This email was sent by: The RepublicanParty of Wisconsin, PO Box 628250, Middleton, WI 53562. PAID FOR BY THEREPUBLICAN PARTY OF WISCONSIN",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [],
        "places": [
            "Saint Louis",
            "Missouri"
        ],
        "organizations": [
            "McCloskey for Missouri",
            "Mark McCloskey For Senate",
            "Constant Contact"
        ],
        "products": [],
        "committee": "McCloskey for Missouri",
        "name": "Mark McCloskey for Missouri",
        "email": "info@mccloskeyforsenate.com",
        "subject": "We need your help with this",
        "date": "2021-08-09T19:01:13Z",
        "year": "2021",
        "month": "8",
        "day": "9",
        "hour": "19",
        "minute": "1",
        "domain": "mccloskeyforsenate.com",
        "body": "You don't want to miss this. We have until 11:59pm tonight to get you vote in for this poll. Use the link below and make show your support HTTP://www.PaulCurtman.com/survey Paid for by McCloskey for Missouri Mark McCloskey For Senate | www.McCloskeyforSenate.com Mark McCloskey for Missouri | 4579 Laclede Ave , PMB 335, Saint Louis, MO 63108 Unsubscribe dpwillis67@gmail.com Update Profile | About Constant Contact Sent by info@mccloskeyforsenate.com in collaboration with Try email marketing for free today!",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Sharif Street"
        ],
        "places": [
            "Philadelphia",
            "United States"
        ],
        "organizations": [
            "Sharif Street for PA"
        ],
        "products": [],
        "committee": "Sharif Street for PA",
        "name": "Sharif (personal)",
        "email": "info@mailer.streetforpa.com",
        "subject": "Peter",
        "date": "2021-08-01T00:45:17Z",
        "year": "2021",
        "month": "8",
        "day": "1",
        "hour": "0",
        "minute": "45",
        "domain": "mailer.streetforpa.com",
        "body": "I have one last request for you -- we’re just $104 away from reaching our end-of-month goal of grassroots donations. Can you chip in $25 or the full $104today? [https://secure.actblue.com/donate/SSPA-ALL-Email-July2021-FR-JulyEOM21?refcode=E10494-20210731-EOM6-SL-DeadlineEOM-PlainText-NA-NA&amount;=25] Thanks, Sharif PAID FOR BY SHARIF STREET FOR PA If you believeyou received this message in error or wish to no longer receive email from us,please unsubscribe:https://email.ngpvan.com/unsubscribeUnique/f47d46b6-5cf1-eb11-b563-501ac57b8fa7/86e15fb8-61f2-eb11-b563-501ac57b8fa7?nvep=ew0KICAiVGVuYW50VXJpIjogIm5ncHZhbjovL3Zhbi9OR1AvTkdQMDYvMS84MzEwOCIsDQogICJEaXN0cmlidXRpb25VbmlxdWVJZCI6ICI4NmUxNWZiOC02MWYyLWViMTEtYjU2My01MDFhYzU3YjhmYTciLA0KICAiRW1haWxBZGRyZXNzIjogImRwd2lsbGlzNjdAZ21haWwuY29tIg0KfQ%3D%3D&hmac;=JDlPMAIEakN35cWPcSoSes3r3XX39dcVI7iwNxbA-dU=&id;=117874703 . Sharif Street for PA PO BOX 28729 658 N. 63RD STREETPhiladelphia, PA 19151 United States",
        "party": "D",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Peter",
            "Laura Ingraham",
            "Josh Hawley"
        ],
        "places": [],
        "organizations": [
            "Josh Hawley for Senate",
            "Supreme Court"
        ],
        "products": [],
        "committee": "Josh Hawley for Senate",
        "name": "Josh Hawley",
        "email": "josh@hawleyformo.com",
        "subject": "Let’s Overturn Roe V. Wade Once And For All",
        "date": "2021-08-02T16:01:04Z",
        "year": "2021",
        "month": "8",
        "day": "2",
        "hour": "16",
        "minute": "1",
        "domain": "hawleyformo.com",
        "body": "Peter, Roe v. Wade was one of the worst decisions in American history. Sincethat fateful decision, 62 Million innocent unborn babies have lost theirlives, with millions of millions more imperiled as long as the decisionstands. We can’t sit back and continue to let future generations of innocentunborn babies be sacrificed on the altar of liberalism. Words aren’t enough,which is why this week I filed an amicus brief with the Supreme Court askingit to overturn Roe v. Wade. I talked with Laura Ingraham about the criticalneed to overturn Roe and Casey. If you believe that every person is fearfullyand wonderfully made, if you stand for life, and if you stand for futuregenerations, join me in fighting the evils of abortion!! GET IN THE FIGHT >>>DONATE In Liberty, Josh Hawley Paid for by Josh Hawley for Senate Click hereto unsubscribe.",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "Tim Scott",
            "Chuck Schumer",
            "Peter"
        ],
        "places": [
            "Charleston",
            "SC"
        ],
        "organizations": [
            "Tim Scott For Senate"
        ],
        "products": [],
        "committee": "Tim Scott For Senate",
        "name": "Tim Scott",
        "email": "info@bestamericanow.com",
        "subject": "My heart sank when I saw the news...",
        "date": "2021-08-22T13:02:03Z",
        "year": "2021",
        "month": "8",
        "day": "22",
        "hour": "13",
        "minute": "2",
        "domain": "bestamericanow.com",
        "body": "I hate to be blunt but our situation is truly dire.                                                                             Peter, it’s Tim Scott. Myheart sank when I saw the news… Chuck Schumer just raised $12 million! I hateto be blunt, but our situation is truly dire. I’m personally calling on everypatriot on this list to chip in $10 in the next 10 minutes. CHIP IN $10 It’sthe absolute minimum we need to counter Schumer’s dark money assault. Can Icount on you? Thank you, Tim Scott CHIP IN $10 PAID FOR BY TIM SCOTT FORSENATE 1405 ASHLEY RIVER ROAD CHARLESTON, SC 29407 Don't want to receive anymore of our emails? Click here to unsubscribe .",
        "party": "R",
        "disclaimer": "TRUE"
    },
    {
        "names": [
            "David Perdue",
            "Burt Jones"
        ],
        "places": [
            "Georgia",
            "Jackson"
        ],
        "organizations": [
            "Burt Jones for Georgia",
            "Constant Contact"
        ],
        "products": [],
        "committee": "Burt Jones for Georgia",
        "name": "Burt Jones for Georgia",
        "email": "press@burtjonesforga.com",
        "subject": "Special Guest Attending Burt Jones KickOff Event!",
        "date": "2021-08-18T16:09:18Z",
        "year": "2021",
        "month": "8",
        "day": "18",
        "hour": "16",
        "minute": "9",
        "domain": "burtjonesforga.com",
        "body": "SPECIAL GUEST SENATOR DAVID PERDUE SPEAKING AT BURT JONES KICKOFF EVENT Click on the image above or HERE to RSVP for the event! Space is filling up quickly, so make sure you get your tickets TODAY! www.BurtJonesForGA.com  DONATE PAID FOR BY BURT JONES FOR GEORGIA Burt Jones for Georgia | P.O. Box 767, Jackson, GA 30233 Unsubscribe dpwillis67@gmail.com Update Profile | Constant Contact Data Notice Sent by press@burtjonesforga.com powered by Try email marketing for free today!",
        "party": "NA",
        "disclaimer": "TRUE"
    }
]